README.org
# -*- org-export-use-babel: nil; after-save-hook: org-html-export-to-html; -*-

#+TITLE: Elements of Programming Interviews: Solutions
#+AUTHOR: Jonathan Jin
#+TODO: TODO(t) | WRITTEN(w) PSEUDOCODE(c) DONE(d) LOOKED-UP(l)

#+OPTIONS: tags:nil H:4

#+HTML_HEAD:    <!-- Global site tag (gtag.js) - Google Analytics -->
#+HTML_HEAD:    <script async src="https://www.googletagmanager.com/gtag/js?id=UA-42551205-2"></script>
#+HTML_HEAD:    <script>
#+HTML_HEAD:    window.dataLayer = window.dataLayer || [];
#+HTML_HEAD:    function gtag(){dataLayer.push(arguments);}
#+HTML_HEAD:    gtag('js', new Date());
#+HTML_HEAD:    gtag('config', 'UA-42551205-2');
#+HTML_HEAD:    </script>

#+EXPORT_FILE_NAME: index

#+SETUPFILE: theme.setup

* Foreward

  All problems presented here are from [[http://elementsofprogramminginterviews.com/][Elements of Programming Interviews]], by
  Dr. Adnan Aziz, Tsung-Hsien Lee, and Amit Prakash. All credit goes to them.

  All solutions presented are my own. 

* Data Structures and Algorithms

** Primitive Types

