index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-27 Fri 16:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elements of Programming Interviews: Solutions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Jin" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Elements of Programming Interviews: Solutions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org14bebf2">1. Foreward</a></li>
<li><a href="#org132f0db">2. Data Structures and Algorithms</a>
<ul>
<li><a href="#orge520a14">2.1. Primitive Types</a>
<ul>
<li><a href="#orgf3ad5ab">2.1.1. <span class="done DONE">DONE</span> Computing the parity of a word</a></li>
<li><a href="#org1433c08">2.1.2. <span class="todo TODO">TODO</span> Compute x<sup>y</sup></a></li>
</ul>
</li>
<li><a href="#orge49eb00">2.2. Arrays</a>
<ul>
<li><a href="#org7db2a58">2.2.1. <span class="todo TODO">TODO</span> The Dutch national flag problem</a>
<ul>
<li><a href="#org6740276">2.2.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgf5c05c3">2.2.2. <span class="done DONE">DONE</span> Sample offline data</a>
<ul>
<li><a href="#org234742a">2.2.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#org6b3361c">2.2.3. <span class="done DONE">DONE</span> Sample online data</a>
<ul>
<li><a href="#orgee07e4c">2.2.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#orge50ea49">2.2.4. <span class="done DONE">DONE</span> Compute the spiral ordering of a 2D array</a></li>
<li><a href="#orgb3f8a7a">2.2.5. <span class="done DONE">DONE</span> Buy and sell a stock once</a>
<ul>
<li><a href="#org3410f9d">2.2.5.1. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org80b7ad9">2.3. Strings</a>
<ul>
<li><a href="#org226049b">2.3.1. <span class="done DONE">DONE</span> Interconvert strings and integers</a>
<ul>
<li><a href="#org2b24c18">2.3.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#org8cd87a3">2.3.2. <span class="todo TODO">TODO</span> Base conversion</a></li>
<li><a href="#org99349ac">2.3.3. <span class="todo TODO">TODO</span> Replace and remove</a></li>
<li><a href="#org87de558">2.3.4. <span class="done DONE">DONE</span> Test palindromicity</a>
<ul>
<li><a href="#org38bd57a">2.3.4.1. Solution</a></li>
</ul>
</li>
<li><a href="#org628eb26">2.3.5. <span class="done DONE">DONE</span> Compute all mnemonics for a phone number</a>
<ul>
<li><a href="#orgda54acd">2.3.5.1. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4628c2c">2.4. Linked Lists</a>
<ul>
<li><a href="#org7b95d82">2.4.1. <span class="done DONE">DONE</span> Merge two sorted lists</a>
<ul>
<li><a href="#org4cb9596">2.4.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#org338e5bb">2.4.2. <span class="done DONE">DONE</span> Reverse a singly linked list</a>
<ul>
<li><a href="#org49fd9f3">2.4.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgbe3e808">2.4.3. <span class="done DONE">DONE</span> Test for cyclicity</a>
<ul>
<li><a href="#orga785e26">2.4.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#org7f06290">2.4.4. <span class="done DONE">DONE</span> Test for overlapping lists &#x2013; lists are cycle-free</a>
<ul>
<li><a href="#orge4b528a">2.4.4.1. Solution</a></li>
</ul>
</li>
<li><a href="#org5012930">2.4.5. <span class="done DONE">DONE</span> Remove the k<sup>th</sup> last element from a list</a>
<ul>
<li><a href="#org20830b9">2.4.5.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgb8c3cef">2.4.6. <span class="todo TODO">TODO</span> Implement even-odd merge</a></li>
<li><a href="#org710848b">2.4.7. <span class="todo TODO">TODO</span> Test whether a singly linked list is palindromic</a></li>
</ul>
</li>
<li><a href="#org900f287">2.5. Stacks and Queues</a>
<ul>
<li><a href="#orge24ce0e">2.5.1. <span class="done DONE">DONE</span> Implement a stack with <code>max</code> API</a>
<ul>
<li><a href="#org8efb493">2.5.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgf564eae">2.5.2. <span class="done DONE">DONE</span> Test a string of parentheses, braces, and brackets for well-formedness</a>
<ul>
<li><a href="#org35cfa77">2.5.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#orga7d5373">2.5.3. <span class="done DONE">DONE</span> Compute binary tree nodes in order of increasing depth</a>
<ul>
<li><a href="#orge29475c">2.5.3.1. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org157e768">2.6. Binary Trees</a>
<ul>
<li><a href="#orgde7d03d">2.6.1. <span class="done DONE">DONE</span> Test if a binary tree is height-balanced</a>
<ul>
<li><a href="#orgd743159">2.6.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#org545d1ed">2.6.2. <span class="done DONE">DONE</span> Compute the LCA when nodes have parent pointers</a>
<ul>
<li><a href="#org61376be">2.6.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#org3d2456b">2.6.3. <span class="done DONE">DONE</span> Test if a binary tree is symmetric</a>
<ul>
<li><a href="#org63c12d4">2.6.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#org31905a6">2.6.4. <span class="done DONE">DONE</span> Reconstruct a binary tree from traversal data</a>
<ul>
<li><a href="#org2419e05">2.6.4.1. Corollary</a></li>
</ul>
</li>
<li><a href="#org2fe8f51">2.6.5. <span class="todo TODO">TODO</span> Implement an inorder traversal with O(1) space</a></li>
<li><a href="#org42c30d5">2.6.6. <span class="done LOOKED_UP">LOOKED-UP</span> Reconstruct a binary tree from a preorder traversal with markers</a></li>
<li><a href="#org84d13fe">2.6.7. <span class="todo TODO">TODO</span> Compute the right sibling tree</a></li>
</ul>
</li>
<li><a href="#org609726b">2.7. Heaps</a>
<ul>
<li><a href="#org1c79809">2.7.1. <span class="todo TODO">TODO</span> Merge sorted files</a></li>
<li><a href="#org1bd04a1">2.7.2. <span class="todo TODO">TODO</span> Compute the k closest stars</a></li>
</ul>
</li>
<li><a href="#orgc7d9a76">2.8. Searching</a>
<ul>
<li><a href="#orgfc7d1a7">2.8.1. <span class="done DONE">DONE</span> Search a sorted array for first occurrence of <code>k</code></a>
<ul>
<li><a href="#org24aa0bc">2.8.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#orge2a42f5">2.8.2. <span class="todo TODO">TODO</span> Compute the integer square root</a></li>
<li><a href="#orge5fe20a">2.8.3. <span class="todo TODO">TODO</span> Find the k-th largest element</a></li>
</ul>
</li>
<li><a href="#org1da1935">2.9. Hash Tables</a>
<ul>
<li><a href="#orgd497b4a">2.9.1. <span class="done DONE">DONE</span> Partition into anagrams</a>
<ul>
<li><a href="#orgeb749b2">2.9.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgb566af4">2.9.2. <span class="done DONE">DONE</span> Test for palindromic permutations</a>
<ul>
<li><a href="#orge53f971">2.9.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#org14b6c7b">2.9.3. <span class="done DONE">DONE</span> Is an anonymous letter constructible?</a>
<ul>
<li><a href="#orgd620f76">2.9.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#org25f8e2a">2.9.4. <span class="todo TODO">TODO</span> Implement an ISBN cache</a></li>
</ul>
</li>
<li><a href="#orgcc387a3">2.10. Sorting</a>
<ul>
<li><a href="#orgc0d8169">2.10.1. <span class="done DONE">DONE</span> Compute the intersection of two sorted arrays</a>
<ul>
<li><a href="#org50b243f">2.10.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#org89fb070">2.10.2. <span class="todo TODO">TODO</span> Implement mergesort in-place</a></li>
<li><a href="#org530b1cf">2.10.3. <span class="done DONE">DONE</span> Count the frequencies of characters in a sentence</a>
<ul>
<li><a href="#orge068fe7">2.10.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#org3be4ff6">2.10.4. <span class="done DONE">DONE</span> Render a calendar</a>
<ul>
<li><a href="#org60ca383">2.10.4.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgd4e6588">2.10.5. <span class="todo TODO">TODO</span> Compute the union of intervals</a></li>
<li><a href="#orgcf3bc8b">2.10.6. <span class="todo TODO">TODO</span> Implement a fast sorting algorithm for lists</a></li>
<li><a href="#orga6e4188">2.10.7. <span class="todo TODO">TODO</span> Partitioning and sorting an array with many repeated entries</a></li>
</ul>
</li>
<li><a href="#org61111ce">2.11. Binary Search Trees</a>
<ul>
<li><a href="#org575a4a4">2.11.1. <span class="done DONE">DONE</span> Test if a binary tree satisfies the BST property</a>
<ul>
<li><a href="#org20d43be">2.11.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#org76c7bb5">2.11.2. <span class="done DONE">DONE</span> Find the first key larger than a given value in a BST</a>
<ul>
<li><a href="#org3478ab9">2.11.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#org96c405e">2.11.3. <span class="done DONE">DONE</span> Find the k largest elements in a BST</a></li>
<li><a href="#org5c77758">2.11.4. <span class="done DONE">DONE</span> Compute the LCA in a BST</a>
<ul>
<li><a href="#org2896d60">2.11.4.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgf3ca378">2.11.5. <span class="todo TODO">TODO</span> The most visited pages problem</a></li>
<li><a href="#org465bf26">2.11.6. <span class="todo TODO">TODO</span> Reconstruct a BST from traversal data</a></li>
<li><a href="#org96eea61">2.11.7. <span class="todo TODO">TODO</span> Build a minimum height BST from a sorted array</a></li>
<li><a href="#org33e218c">2.11.8. <span class="todo TODO">TODO</span> Enumerate numbers of the form a + b sqrt(2)</a></li>
<li><a href="#org1b53936">2.11.9. <span class="todo TODO">TODO</span> Insertion and deletion in a BST</a>
<ul>
<li><a href="#org41d98cb">2.11.9.1. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1122b1c">2.12. Recursion</a>
<ul>
<li><a href="#orgf0959ab">2.12.1. <span class="done DONE">DONE</span> Tower of Hanoi</a></li>
<li><a href="#org54dd751">2.12.2. <span class="todo TODO">TODO</span> Generate all nonattacking placements of n-Queens</a></li>
</ul>
</li>
<li><a href="#org75fed2a">2.13. Dynamic Programming</a>
<ul>
<li><a href="#orgdfa8181">2.13.1. <span class="done WRITTEN">WRITTEN</span> Count the number of score combinations</a>
<ul>
<li><a href="#orgfc3010d">2.13.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgdebe768">2.13.2. <span class="todo TODO">TODO</span> Compute the Levenshtein distance</a></li>
<li><a href="#org18485ac">2.13.3. <span class="done DONE">DONE</span> Count the number of ways to traverse a 2D array</a>
<ul>
<li><a href="#org42ab0df">2.13.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#org1ffa5dc">2.13.4. <span class="done DONE">DONE</span> Compute the binomial coefficient without overflow</a>
<ul>
<li><a href="#org1675d29">2.13.4.1. Solution</a></li>
</ul>
</li>
<li><a href="#org35c4021">2.13.5. <span class="done DONE">DONE</span> Search for a sequence in a 2D array</a>
<ul>
<li><a href="#orgfabcc86">2.13.5.1. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgacfe5fd">2.14. Greedy Algorithms and Invariants</a>
<ul>
<li><a href="#orge29446c">2.14.1. <span class="done DONE">DONE</span> The 3-sum problem</a>
<ul>
<li><a href="#orgc701172">2.14.1.1. Solution</a></li>
</ul>
</li>
<li><a href="#orgc31d1fa">2.14.2. <span class="done LOOKED_UP">LOOKED-UP</span> The gasup problem</a>
<ul>
<li><a href="#org8452838">2.14.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#orga1151f4">2.14.3. <span class="todo TODO">TODO</span> Find the majority element</a></li>
<li><a href="#org76b3e1c">2.14.4. <span class="todo TODO">TODO</span> Compute the maximum water trapped by a pair of vertical lines</a></li>
<li><a href="#org955e17b">2.14.5. <span class="todo TODO">TODO</span> Compute the largest rectangle under the skyline</a></li>
<li><a href="#org4572825">2.14.6. <span class="todo TODO">TODO</span> Implement Huffman coding</a></li>
</ul>
</li>
<li><a href="#org6a47807">2.15. Graphs</a>
<ul>
<li><a href="#orgbeace61">2.15.1. <span class="done DONE">DONE</span> Search a maze</a>
<ul>
<li><a href="#orgcefba3e">2.15.1.1. <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-05-05 Sat&gt; </span></span> Solution</a></li>
</ul>
</li>
<li><a href="#org2170b8b">2.15.2. <span class="done WRITTEN">WRITTEN</span> Transform one string to another</a>
<ul>
<li><a href="#orged1059c">2.15.2.1. Solution</a></li>
</ul>
</li>
<li><a href="#org93dbd1b">2.15.3. <span class="done DONE">DONE</span> Paint a Boolean matrix</a>
<ul>
<li><a href="#org15b58a8">2.15.3.1. Solution</a></li>
</ul>
</li>
<li><a href="#org5e1158c">2.15.4. <span class="done DONE">DONE</span> Compute enclosed regions</a></li>
<li><a href="#org22f7d09">2.15.5. Compute a shortest path with fewest edges</a></li>
</ul>
</li>
<li><a href="#orgd5af4c9">2.16. Parallel Computing</a></li>
</ul>
</li>
<li><a href="#org138f5e4">3. Domain Specific Problems</a>
<ul>
<li><a href="#org93156dc">3.1. Design Problems</a></li>
<li><a href="#org5bd56a4">3.2. Language Questions</a></li>
<li><a href="#org7770752">3.3. Object-Oriented Design</a></li>
<li><a href="#orge712c79">3.4. Common Tools</a></li>
</ul>
</li>
<li><a href="#org4a3ce55">4. Honors Class</a></li>
</ul>
</div>
</div>

<div id="outline-container-org14bebf2" class="outline-2">
<h2 id="org14bebf2"><span class="section-number-2">1</span> Foreward</h2>
<div class="outline-text-2" id="text-1">
<p>
All problems presented here are from <a href="http://elementsofprogramminginterviews.com/">Elements of Programming Interviews</a>, by
Dr. Adnan Aziz, Tsung-Hsien Lee, and Amit Prakash. All credit goes to them.
</p>

<p>
All solutions presented are my own. 
</p>
</div>
</div>

<div id="outline-container-org132f0db" class="outline-2">
<h2 id="org132f0db"><span class="section-number-2">2</span> Data Structures and Algorithms</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge520a14" class="outline-3">
<h3 id="orge520a14"><span class="section-number-3">2.1</span> Primitive Types</h3>
<div class="outline-text-3" id="text-2-1">
</div>
