README.org
*** DONE Computing the parity of a word                                     :C0:
    CLOSED: [2017-06-21 Wed 00:44]
    
    #+BEGIN_QUOTE
    The parity of a binary word is 1 if the number of 1s in the word is odd;
    otherwise, it is 0. For example, the parity of 1011 is 1, and the parity of
    10001000 is 0. Parity checks are used to detect single bit errors in data
    storage and communication. It is fairly straightforward to write code that
    computes the parity of a single 64-bit word
    #+END_QUOTE

    We assume that the word is provided as a 64-bit unsigned integer.

    A naive implementation would be to iterate through every bit of the word,
    XOR-ing a counter for every 1-bit.

    #+BEGIN_SRC python :results silent :session
      def parity(word):
          p = 0
          for shift in range(0,64):
              p ^= (word>>shift)&1
          return p
    #+END_SRC

    #+BEGIN_SRC python :results value :session
      all([parity(int(w,2))==p for w,p in [
          ("1011", 1),
          ("0000", 0),
      ]])
    #+END_SRC

    #+RESULTS:
    : True

    This implementation is O(n), where n is the length of the input word.

    We can, however, optimize this function further by precomputing the
    parities of words and storing the parities in a lookup table. For
    illustration's purpose, we'll define a lookup table that stores the
    parities of all words of length 2:

    #+BEGIN_SRC python :results none :session
      PARITIES_2 = {
          int(w,2): p for w,p in [
              ("00", 0),
              ("01", 1),
              ("10", 1),
              ("11", 0),
          ]
      }
    #+END_SRC

    Resulting in the following implementation:

    #+BEGIN_SRC python :results none :session
      def memoized_parity(word):
          p = 0
          memo_word_length = 2
          for s in range(0,64/memo_word_length):
              mask = 2^memo_word_length - 1
              shift = s * memo_word_length
              p ^= PARITIES_2[(word >> shift) & mask]
          return p
    #+END_SRC

    #+BEGIN_SRC python :results value :session
      all([memoized_parity(int(w,2))==p for w,p in [
          ("1011", 1),
          ("0000", 0),
      ]])
    #+END_SRC

    #+RESULTS:
    : True

    This revised implementation is O(n/w) = O(n), where w is the word length of
    the lookup key.

*** TODO Compute x^{y}                                                      :C1:

    #+BEGIN_QUOTE
    Compute x^{y} without using arithmetic operators, i.e. using only assignment,
    bitwise operators, and equality checks.
    #+END_QUOTE

** Arrays
   
*** TODO The Dutch national flag problem                                    :C0:

    Write a program that takes an array A and an index i into A, and rearranges
    the elements such that all elements less than A[i] (the "pivot") appear
    first, followed by eleents equal to the pivot followed by elements greater
    than the pivot.

    /Hint/: Think about the partition step in quicksort.

**** Solution

*** DONE Sample offline data                                                :C1:
    CLOSED: [2017-06-27 Tue 00:00]

    Implement an algorithm that takes as input an array of distinct elements and
    a size, and returns a subset of the given size of the array elements. All
    subsets should be equally likely.

**** Solution

     We can use reservoir sampling to achieve a linear-time implementation.

     #+BEGIN_SRC python :results output :session
       def sample(N, l):
           from random import randint
           reservoir = [N[i] for i in range(0, l)]
           for i in range(l, len(N)):
               _i = randint(0, i)
               if _i < l:
                   reservoir[_i] = N[i]
           return reservoir
     #+END_SRC

*** DONE Sample online data
    CLOSED: [2017-06-27 Tue 00:00]

    Design a program that takes as input a size k, and reads packets,
    continuously maintaining a uniform random subset of size k of the read
    packets.

**** Solution

     Analogous to solution outlined in "Sample offline data."

