index.html
<div id="outline-container-orgf3ad5ab" class="outline-4">
<h4 id="orgf3ad5ab"><span class="section-number-4">2.1.1</span> <span class="done DONE">DONE</span> Computing the parity of a word</h4>
<div class="outline-text-4" id="text-2-1-1">
<blockquote>
<p>
The parity of a binary word is 1 if the number of 1s in the word is odd;
otherwise, it is 0. For example, the parity of 1011 is 1, and the parity of
10001000 is 0. Parity checks are used to detect single bit errors in data
storage and communication. It is fairly straightforward to write code that
computes the parity of a single 64-bit word
</p>
</blockquote>

<p>
We assume that the word is provided as a 64-bit unsigned integer.
</p>

<p>
A naive implementation would be to iterate through every bit of the word,
XOR-ing a counter for every 1-bit.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">parity</span>(word):
    <span style="color: #D8DEE9;">p</span> = 0
    <span style="color: #81A1C1;">for</span> shift <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0,64):
        <span style="color: #D8DEE9;">p</span> ^= (word&gt;&gt;shift)&amp;1
    <span style="color: #81A1C1;">return</span> p
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([parity(<span style="color: #81A1C1;">int</span>(w,2))==p <span style="color: #81A1C1;">for</span> w,p <span style="color: #81A1C1;">in</span> [
    (<span style="color: #A3BE8C;">"1011"</span>, 1),
    (<span style="color: #A3BE8C;">"0000"</span>, 0),
]])
</pre>
</div>

<pre class="example">
True
</pre>


<p>
This implementation is O(n), where n is the length of the input word.
</p>

<p>
We can, however, optimize this function further by precomputing the
parities of words and storing the parities in a lookup table. For
illustration&rsquo;s purpose, we&rsquo;ll define a lookup table that stores the
parities of all words of length 2:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #D8DEE9;">PARITIES_2</span> = {
    <span style="color: #81A1C1;">int</span>(w,2): p <span style="color: #81A1C1;">for</span> w,p <span style="color: #81A1C1;">in</span> [
        (<span style="color: #A3BE8C;">"00"</span>, 0),
        (<span style="color: #A3BE8C;">"01"</span>, 1),
        (<span style="color: #A3BE8C;">"10"</span>, 1),
        (<span style="color: #A3BE8C;">"11"</span>, 0),
    ]
}
</pre>
</div>

<p>
Resulting in the following implementation:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">memoized_parity</span>(word):
    <span style="color: #D8DEE9;">p</span> = 0
    <span style="color: #D8DEE9;">memo_word_length</span> = 2
    <span style="color: #81A1C1;">for</span> s <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0,64/memo_word_length):
        <span style="color: #D8DEE9;">mask</span> = 2^memo_word_length - 1
        <span style="color: #D8DEE9;">shift</span> = s * memo_word_length
        <span style="color: #D8DEE9;">p</span> ^= PARITIES_2[(word &gt;&gt; shift) &amp; mask]
    <span style="color: #81A1C1;">return</span> p
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([memoized_parity(<span style="color: #81A1C1;">int</span>(w,2))==p <span style="color: #81A1C1;">for</span> w,p <span style="color: #81A1C1;">in</span> [
    (<span style="color: #A3BE8C;">"1011"</span>, 1),
    (<span style="color: #A3BE8C;">"0000"</span>, 0),
]])
</pre>
</div>

<pre class="example">
True
</pre>


<p>
This revised implementation is O(n/w) = O(n), where w is the word length of
the lookup key.
</p>
</div>
</div>

<div id="outline-container-org1433c08" class="outline-4">
<h4 id="org1433c08"><span class="section-number-4">2.1.2</span> <span class="todo TODO">TODO</span> Compute x<sup>y</sup></h4>
<div class="outline-text-4" id="text-2-1-2">
<blockquote>
<p>
Compute x<sup>y</sup> without using arithmetic operators, i.e. using only assignment,
bitwise operators, and equality checks.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orge49eb00" class="outline-3">
<h3 id="orge49eb00"><span class="section-number-3">2.2</span> Arrays</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org7db2a58" class="outline-4">
<h4 id="org7db2a58"><span class="section-number-4">2.2.1</span> <span class="todo TODO">TODO</span> The Dutch national flag problem</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Write a program that takes an array A and an index i into A, and rearranges
the elements such that all elements less than A[i] (the &ldquo;pivot&rdquo;) appear
first, followed by eleents equal to the pivot followed by elements greater
than the pivot.
</p>

<p>
<i>Hint</i>: Think about the partition step in quicksort.
</p>
</div>

<div id="outline-container-org6740276" class="outline-5">
<h5 id="org6740276"><span class="section-number-5">2.2.1.1</span> Solution</h5>
</div>
</div>

<div id="outline-container-orgf5c05c3" class="outline-4">
<h4 id="orgf5c05c3"><span class="section-number-4">2.2.2</span> <span class="done DONE">DONE</span> Sample offline data</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Implement an algorithm that takes as input an array of distinct elements and
a size, and returns a subset of the given size of the array elements. All
subsets should be equally likely.
</p>
</div>

<div id="outline-container-org234742a" class="outline-5">
<h5 id="org234742a"><span class="section-number-5">2.2.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-2-2-1">
<p>
We can use reservoir sampling to achieve a linear-time implementation.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">sample</span>(N, l):
    <span style="color: #81A1C1;">from</span> random <span style="color: #81A1C1;">import</span> randint
    <span style="color: #D8DEE9;">reservoir</span> = [N[i] <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0, l)]
    <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(l, <span style="color: #81A1C1;">len</span>(N)):
        <span style="color: #D8DEE9;">_i</span> = randint(0, i)
        <span style="color: #81A1C1;">if</span> _i &lt; l:
            <span style="color: #D8DEE9;">reservoir</span>[_i] = N[i]
    <span style="color: #81A1C1;">return</span> reservoir
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6b3361c" class="outline-4">
<h4 id="org6b3361c"><span class="section-number-4">2.2.3</span> <span class="done DONE">DONE</span> Sample online data</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Design a program that takes as input a size k, and reads packets,
continuously maintaining a uniform random subset of size k of the read
packets.
</p>
</div>

<div id="outline-container-orgee07e4c" class="outline-5">
<h5 id="orgee07e4c"><span class="section-number-5">2.2.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-2-3-1">
<p>
Analogous to solution outlined in &ldquo;Sample offline data.&rdquo;
</p>
</div>
</div>
</div>
