README.org
*** DONE Compute the spiral ordering of a 2D array                          :C1:
    CLOSED: [2018-04-30 Mon 23:18]

    #+BEGIN_SRC python
      def spiral(mtx):
          bounds = {
              "top": -1,
              "bottom": len(mtx),
              "left": -1,
              "right": len(mtx[0]),
          }
          actions = {
              "left": {
                  "update": (lambda i,j: (i,j-1)),
                  "within": lambda i,j: j>bounds["left"],
                  "next": "up",
              },
              "right": {
                  "update": (lambda i,j: (i,j+1)),
                  "within": lambda i,j: j<bounds["right"],
                  "next": "down",
              },
              "up": {
                  "update": (lambda i,j: (i-1,j)),
                  "within": lambda i,j: i>bounds["top"],
                  "next": "right",
              },
              "down": {
                  "update": (lambda i,j: (i+1,j)),
                  "within": lambda i,j: i<bounds["bottom"],
                  "next": "left",
              },
          }

          action = "right"

          i,j=0,0
          moved = False

          while True:
              yield mtx[i][j]
              _i, _j = actions[action]["update"](i,j)
              if actions[action]["within"](_i, _j):
                  i,j = _i, _j
                  moved = True
              else:
                  if action == "right":
                      bounds["top"]+=1
                  elif action == "down":
                      bounds["right"]-=1
                  elif action == "left":
                      bounds["bottom"]-=1
                  elif action == "up":
                      bounds["left"]+=1

                  action = actions[action]["next"]
                  _i, _j = actions[action]["update"](i,j)
                  if not actions[action]["within"](_i, _j):
                      break
                  else:
                      i,j = _i, _j
    #+END_SRC

    #+BEGIN_SRC python :results value :session
      all([
          list(spiral([[1,2],[3,4]])) == [1,2,4,3],
          list(spiral([[1,2,3],[4,5,6],[7,8,9]])) == [1,2,3,6,9,8,7,4,5],
      ])
    #+END_SRC

    #+RESULTS:
    : True

*** DONE Buy and sell a stock once                                          :C0:
    CLOSED: [2017-06-22 Thu 12:28]

    This problem is concerned with the problem of optimally buying and selling a
    stock once. As an example, consider the following sequence of stock prices:
    =<310, 315, 275, 295, 260, 270, 290, 230, 255, 250>=. The maximum profit
    that can be made with one buy and one sell is 30 -- buy at 260 and sell
    at 290. Note that 260 is not the lowest price, nor 290 the highest price.

    Write a program that takes an array denoting the daily stock price, and
    returns the maximum profit that could be made by buying and then selling one
    share of that stock.
    
**** Solution

     Note that this problem is a simplification of the knapsack problem. A naive
     solution would reduce this problem to its inspiration, giving us a O(n^{2})
     solution.  However, we note that the problem doesn't ask for exactly
     *which* stocks to buy and sell for maximum profit -- only the profit
     amount. This simplification means that we do not need the comprehensive
     bookkeeping that a DP-based solution to the knapsack problem provides us.

     We first note that a lower buying price always results in a higher profit
     with the same selling price.

     We can then implement a O(n) solution that compares the "current profit" --
     defined as difference between the current sell-price under consideration
     and the as-yet-seen lowest buy price, with a rolling maximum of that
     value. Every time we see a value less than the as-yet-seen lowest buy
     price, we update accordingly. Once we reach the end of the list, we return
     the rolling max value.

     #+BEGIN_SRC python :results silent :session
       def max_profit(*args):
           min_so_far = args[0]
           profit = 0
           for p in args:
               profit = max(profit, p - min_so_far)
               if p < min_so_far:
                   min_so_far = p
           return profit
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       max_profit(310,315,275,295,260,270,290,230,255,250) == 30
     #+END_SRC

     #+RESULTS:
     : True

** Strings

*** DONE Interconvert strings and integers                                  :C0:
    CLOSED: [2017-06-26 Mon 22:08]

    Implement string/integer inter-conversion functions.

