index.html

<div id="outline-container-orge50ea49" class="outline-4">
<h4 id="orge50ea49"><span class="section-number-4">2.2.4</span> <span class="done DONE">DONE</span> Compute the spiral ordering of a 2D array</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">spiral</span>(mtx):
    <span style="color: #D8DEE9;">bounds</span> = {
        <span style="color: #A3BE8C;">"top"</span>: -1,
        <span style="color: #A3BE8C;">"bottom"</span>: <span style="color: #81A1C1;">len</span>(mtx),
        <span style="color: #A3BE8C;">"left"</span>: -1,
        <span style="color: #A3BE8C;">"right"</span>: <span style="color: #81A1C1;">len</span>(mtx[0]),
    }
    <span style="color: #D8DEE9;">actions</span> = {
        <span style="color: #A3BE8C;">"left"</span>: {
            <span style="color: #A3BE8C;">"update"</span>: (<span style="color: #81A1C1;">lambda</span> i,j: (i,j-1)),
            <span style="color: #A3BE8C;">"within"</span>: <span style="color: #81A1C1;">lambda</span> i,j: j&gt;bounds[<span style="color: #A3BE8C;">"left"</span>],
            <span style="color: #A3BE8C;">"next"</span>: <span style="color: #A3BE8C;">"up"</span>,
        },
        <span style="color: #A3BE8C;">"right"</span>: {
            <span style="color: #A3BE8C;">"update"</span>: (<span style="color: #81A1C1;">lambda</span> i,j: (i,j+1)),
            <span style="color: #A3BE8C;">"within"</span>: <span style="color: #81A1C1;">lambda</span> i,j: j&lt;bounds[<span style="color: #A3BE8C;">"right"</span>],
            <span style="color: #A3BE8C;">"next"</span>: <span style="color: #A3BE8C;">"down"</span>,
        },
        <span style="color: #A3BE8C;">"up"</span>: {
            <span style="color: #A3BE8C;">"update"</span>: (<span style="color: #81A1C1;">lambda</span> i,j: (i-1,j)),
            <span style="color: #A3BE8C;">"within"</span>: <span style="color: #81A1C1;">lambda</span> i,j: i&gt;bounds[<span style="color: #A3BE8C;">"top"</span>],
            <span style="color: #A3BE8C;">"next"</span>: <span style="color: #A3BE8C;">"right"</span>,
        },
        <span style="color: #A3BE8C;">"down"</span>: {
            <span style="color: #A3BE8C;">"update"</span>: (<span style="color: #81A1C1;">lambda</span> i,j: (i+1,j)),
            <span style="color: #A3BE8C;">"within"</span>: <span style="color: #81A1C1;">lambda</span> i,j: i&lt;bounds[<span style="color: #A3BE8C;">"bottom"</span>],
            <span style="color: #A3BE8C;">"next"</span>: <span style="color: #A3BE8C;">"left"</span>,
        },
    }

    <span style="color: #D8DEE9;">action</span> = <span style="color: #A3BE8C;">"right"</span>

    <span style="color: #D8DEE9;">i</span>,<span style="color: #D8DEE9;">j</span>=0,0
    <span style="color: #D8DEE9;">moved</span> = <span style="color: #81A1C1;">False</span>

    <span style="color: #81A1C1;">while</span> <span style="color: #81A1C1;">True</span>:
        <span style="color: #81A1C1;">yield</span> mtx[i][j]
        <span style="color: #D8DEE9;">_i</span>, <span style="color: #D8DEE9;">_j</span> = actions[action][<span style="color: #A3BE8C;">"update"</span>](i,j)
        <span style="color: #81A1C1;">if</span> actions[action][<span style="color: #A3BE8C;">"within"</span>](_i, _j):
            <span style="color: #D8DEE9;">i</span>,<span style="color: #D8DEE9;">j</span> = _i, _j
            <span style="color: #D8DEE9;">moved</span> = <span style="color: #81A1C1;">True</span>
        <span style="color: #81A1C1;">else</span>:
            <span style="color: #81A1C1;">if</span> action == <span style="color: #A3BE8C;">"right"</span>:
                <span style="color: #D8DEE9;">bounds</span>[<span style="color: #A3BE8C;">"top"</span>]+=1
            <span style="color: #81A1C1;">elif</span> action == <span style="color: #A3BE8C;">"down"</span>:
                <span style="color: #D8DEE9;">bounds</span>[<span style="color: #A3BE8C;">"right"</span>]-=1
            <span style="color: #81A1C1;">elif</span> action == <span style="color: #A3BE8C;">"left"</span>:
                <span style="color: #D8DEE9;">bounds</span>[<span style="color: #A3BE8C;">"bottom"</span>]-=1
            <span style="color: #81A1C1;">elif</span> action == <span style="color: #A3BE8C;">"up"</span>:
                <span style="color: #D8DEE9;">bounds</span>[<span style="color: #A3BE8C;">"left"</span>]+=1

            <span style="color: #D8DEE9;">action</span> = actions[action][<span style="color: #A3BE8C;">"next"</span>]
            <span style="color: #D8DEE9;">_i</span>, <span style="color: #D8DEE9;">_j</span> = actions[action][<span style="color: #A3BE8C;">"update"</span>](i,j)
            <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> actions[action][<span style="color: #A3BE8C;">"within"</span>](_i, _j):
                <span style="color: #81A1C1;">break</span>
            <span style="color: #81A1C1;">else</span>:
                <span style="color: #D8DEE9;">i</span>,<span style="color: #D8DEE9;">j</span> = _i, _j
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    <span style="color: #81A1C1;">list</span>(spiral([[1,2],[3,4]])) == [1,2,4,3],
    <span style="color: #81A1C1;">list</span>(spiral([[1,2,3],[4,5,6],[7,8,9]])) == [1,2,3,6,9,8,7,4,5],
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>

<div id="outline-container-orgb3f8a7a" class="outline-4">
<h4 id="orgb3f8a7a"><span class="section-number-4">2.2.5</span> <span class="done DONE">DONE</span> Buy and sell a stock once</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
This problem is concerned with the problem of optimally buying and selling a
stock once. As an example, consider the following sequence of stock prices:
<code>&lt;310, 315, 275, 295, 260, 270, 290, 230, 255, 250&gt;</code>. The maximum profit
that can be made with one buy and one sell is 30 &#x2013; buy at 260 and sell
at 290. Note that 260 is not the lowest price, nor 290 the highest price.
</p>

<p>
Write a program that takes an array denoting the daily stock price, and
returns the maximum profit that could be made by buying and then selling one
share of that stock.
</p>
</div>

<div id="outline-container-org3410f9d" class="outline-5">
<h5 id="org3410f9d"><span class="section-number-5">2.2.5.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-2-5-1">
<p>
Note that this problem is a simplification of the knapsack problem. A naive
solution would reduce this problem to its inspiration, giving us a O(n<sup>2</sup>)
solution.  However, we note that the problem doesn&rsquo;t ask for exactly
<b>which</b> stocks to buy and sell for maximum profit &#x2013; only the profit
amount. This simplification means that we do not need the comprehensive
bookkeeping that a DP-based solution to the knapsack problem provides us.
</p>

<p>
We first note that a lower buying price always results in a higher profit
with the same selling price.
</p>

<p>
We can then implement a O(n) solution that compares the &ldquo;current profit&rdquo; &#x2013;
defined as difference between the current sell-price under consideration
and the as-yet-seen lowest buy price, with a rolling maximum of that
value. Every time we see a value less than the as-yet-seen lowest buy
price, we update accordingly. Once we reach the end of the list, we return
the rolling max value.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">max_profit</span>(*args):
    <span style="color: #D8DEE9;">min_so_far</span> = args[0]
    <span style="color: #D8DEE9;">profit</span> = 0
    <span style="color: #81A1C1;">for</span> p <span style="color: #81A1C1;">in</span> args:
        <span style="color: #D8DEE9;">profit</span> = <span style="color: #81A1C1;">max</span>(profit, p - min_so_far)
        <span style="color: #81A1C1;">if</span> p &lt; min_so_far:
            <span style="color: #D8DEE9;">min_so_far</span> = p
    <span style="color: #81A1C1;">return</span> profit
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">max_profit(310,315,275,295,260,270,290,230,255,250) == 30
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org80b7ad9" class="outline-3">
<h3 id="org80b7ad9"><span class="section-number-3">2.3</span> Strings</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org226049b" class="outline-4">
<h4 id="org226049b"><span class="section-number-4">2.3.1</span> <span class="done DONE">DONE</span> Interconvert strings and integers</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Implement string/integer inter-conversion functions.
</p>
</div>
