README.org
**** Solution
     
     #+BEGIN_SRC python :results silent :session
        def stoi(s):
            i = 0
            for c in s:
                i = 10 * i + ord(c) - ord("0")
            return i
     #+END_SRC
     
     #+BEGIN_SRC python :results value :session
        all([
            stoi("123") == 123,
            stoi("0") == 0,
            stoi("98765432198") == 98765432198,
        ])      
     #+END_SRC
     
     #+RESULTS:
      : True

     #+BEGIN_SRC python :results silent :session
       def itos(i):
           import math
           s = ""
           while True:
               s += chr(ord("0") + i % 10)
               i = int(math.floor(i / 10))
               if i == 0:
                   break
           return s[::-1]
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           itos(123) == "123",
           itos(0) == "0",
           itos(98765432198) == "98765432198",
       ])      
     #+END_SRC

     #+RESULTS:
     : True

*** TODO Base conversion                                                    :C1:

    In the decimal number system, the position of a digit is used to signify the
    power of 10 that digit is to be multiplied with. For example, "314" denotes
    the number 3 * 100 + 1 * 10 + 4 * 1. The base b number system generalizes
    the decimal number system: the string "a_{k-1}a_{k-2}...a_{1}a_{1}", where 0 \leq a_i \leq
    b, denotes in base-b the integer a_0 \times b^{0} + a_1 \times b^{1} + a_2 \times
    b^{2} + ... + a_{k-1} \times b^{k-1}.

    Write a program that performs base conversion. The input is a string, an
    integer b_1, and another integer b_2. The string represents an integer in base
    b_1. The output should be the string representing the integer in base
    b_2. Assume 2 \leq b_1, b_2 \leq 16. Use "A" to represent 10, "B" for 11, ..., and
    "F" for 15. (For example, if the string is "615", b_1 is 7 and b_2 is 13, then
    the result should be "1A7", since 6 \times 7^{2} + 1 \times 7 + 5 = 1 \times 13^{2} + 10 \times 13 + 7).

*** TODO Replace and remove                                                 :C1:

    Consider the following two rules that are to be applied to an array of
    characters.

    - Replace each "a" by two "d"s.
    - Delete each entry containing a "b".


    For example, applying these rules to the array =<a,c,d,b,b,c,a>= results in
    the array =<d,d,c,d,c,d,d>=.

    Write a program which takes as input an array of characters, and removes
    each "b" and replaces each "a" by two "d"s. Specifically, along with the
    array, you are provided an integer-valued size. Size denotes the number of
    entries of the array that the operation is to be applied to. You do not
    have to worry about preserving subsequent entries. For example, if the array
    is =<a,b,a,c,_>= and the size is 4, then you can return =<d,d,d,d,c>=. You
    can assume there is enough space in the array to hold the final result.

*** DONE Test palindromicity                                                :C2:
    CLOSED: [2017-07-05 Wed 11:18]

    For the purpose of this problem, define a palindromic string to be a string
    which when all the nonalphanumeric are removed it reads the same front to
    back ignoring case.

    Implement a function which takes as input a string s and returns true if s
    is a palindromic string.

**** Solution

     Use two cursors; one that starts at start of string, and one at the end.

     Each step, perform equality comparison of the chars under each, returning
     early with False if equality does not hold. Continue until i_{s} > i_{e}
     and return True if reach end of iteration. 

     Time O(n) and space O(1).

     #+BEGIN_SRC python :results output :session
       def is_pal(S):
           i_s, i_e = 0, len(S) - 1
           while i_s < i_e:
               if S[i_s].lower() != S[i_e].lower():
                   return False
               i_s += 1
               i_e -= 1
               while not S[i_s].isalnum() and i_s < i_e:
                   i_s += 1
               while not S[i_e].isalnum() and i_s < i_e:
                   i_e -= 1
           return True
     #+END_SRC

     #+RESULTS:

     #+BEGIN_SRC python :results value :session
       all([
           is_pal("A man, a plan, a canal, Panama"),
           not is_pal(",,a,b,,"),
       ])
     #+END_SRC

     #+RESULTS:
     : True

*** DONE Compute all mnemonics for a phone number                           :C3:
    CLOSED: [2017-07-05 Wed 11:36]

    Write a program which takes as input a phone number, specified as a string
    of digits, and returns all possible character sequences that correspond to
    the phone nuber. The cell phone keypad is specified by a mapping that takes
    a digit and returns the corresponding set of characters. The character
    sequencs do not have to be legal words or phrases.

