index.html

<div id="outline-container-org2b24c18" class="outline-5">
<h5 id="org2b24c18"><span class="section-number-5">2.3.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-3-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">stoi</span>(s):
    <span style="color: #D8DEE9;">i</span> = 0
    <span style="color: #81A1C1;">for</span> c <span style="color: #81A1C1;">in</span> s:
        <span style="color: #D8DEE9;">i</span> = 10 * i + <span style="color: #81A1C1;">ord</span>(c) - <span style="color: #81A1C1;">ord</span>(<span style="color: #A3BE8C;">"0"</span>)
    <span style="color: #81A1C1;">return</span> i
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    stoi(<span style="color: #A3BE8C;">"123"</span>) == 123,
    stoi(<span style="color: #A3BE8C;">"0"</span>) == 0,
    stoi(<span style="color: #A3BE8C;">"98765432198"</span>) == 98765432198,
])      
</pre>
</div>

<pre class="example">
True
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">itos</span>(i):
    <span style="color: #81A1C1;">import</span> math
    <span style="color: #D8DEE9;">s</span> = <span style="color: #A3BE8C;">""</span>
    <span style="color: #81A1C1;">while</span> <span style="color: #81A1C1;">True</span>:
        <span style="color: #D8DEE9;">s</span> += <span style="color: #81A1C1;">chr</span>(<span style="color: #81A1C1;">ord</span>(<span style="color: #A3BE8C;">"0"</span>) + i % 10)
        <span style="color: #D8DEE9;">i</span> = <span style="color: #81A1C1;">int</span>(math.floor(i / 10))
        <span style="color: #81A1C1;">if</span> i == 0:
            <span style="color: #81A1C1;">break</span>
    <span style="color: #81A1C1;">return</span> s[::-1]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    itos(123) == <span style="color: #A3BE8C;">"123"</span>,
    itos(0) == <span style="color: #A3BE8C;">"0"</span>,
    itos(98765432198) == <span style="color: #A3BE8C;">"98765432198"</span>,
])      
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cd87a3" class="outline-4">
<h4 id="org8cd87a3"><span class="section-number-4">2.3.2</span> <span class="todo TODO">TODO</span> Base conversion</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
In the decimal number system, the position of a digit is used to signify the
power of 10 that digit is to be multiplied with. For example, &ldquo;314&rdquo; denotes
the number 3 * 100 + 1 * 10 + 4 * 1. The base b number system generalizes
the decimal number system: the string &ldquo;a<sub>k-1</sub>a<sub>k-2</sub>&#x2026;a<sub>1</sub>a<sub>1</sub>&rdquo;, where 0 &le; a<sub>i</sub> &le;
b, denotes in base-b the integer a<sub>0</sub> &times; b<sup>0</sup> + a<sub>1</sub> &times; b<sup>1</sup> + a<sub>2</sub> &times;
b<sup>2</sup> + &#x2026; + a<sub>k-1</sub> &times; b<sup>k-1</sup>.
</p>

<p>
Write a program that performs base conversion. The input is a string, an
integer b<sub>1</sub>, and another integer b<sub>2</sub>. The string represents an integer in base
b<sub>1</sub>. The output should be the string representing the integer in base
b<sub>2</sub>. Assume 2 &le; b<sub>1</sub>, b<sub>2</sub> &le; 16. Use &ldquo;A&rdquo; to represent 10, &ldquo;B&rdquo; for 11, &#x2026;, and
&ldquo;F&rdquo; for 15. (For example, if the string is &ldquo;615&rdquo;, b<sub>1</sub> is 7 and b<sub>2</sub> is 13, then
the result should be &ldquo;1A7&rdquo;, since 6 &times; 7<sup>2</sup> + 1 &times; 7 + 5 = 1 &times; 13<sup>2</sup> + 10 &times; 13 + 7).
</p>
</div>
</div>

<div id="outline-container-org99349ac" class="outline-4">
<h4 id="org99349ac"><span class="section-number-4">2.3.3</span> <span class="todo TODO">TODO</span> Replace and remove</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Consider the following two rules that are to be applied to an array of
characters.
</p>

<ul class="org-ul">
<li>Replace each &ldquo;a&rdquo; by two &ldquo;d&rdquo;s.</li>
<li>Delete each entry containing a &ldquo;b&rdquo;.</li>
</ul>


<p>
For example, applying these rules to the array <code>&lt;a,c,d,b,b,c,a&gt;</code> results in
the array <code>&lt;d,d,c,d,c,d,d&gt;</code>.
</p>

<p>
Write a program which takes as input an array of characters, and removes
each &ldquo;b&rdquo; and replaces each &ldquo;a&rdquo; by two &ldquo;d&rdquo;s. Specifically, along with the
array, you are provided an integer-valued size. Size denotes the number of
entries of the array that the operation is to be applied to. You do not
have to worry about preserving subsequent entries. For example, if the array
is <code>&lt;a,b,a,c,_&gt;</code> and the size is 4, then you can return <code>&lt;d,d,d,d,c&gt;</code>. You
can assume there is enough space in the array to hold the final result.
</p>
</div>
</div>

<div id="outline-container-org87de558" class="outline-4">
<h4 id="org87de558"><span class="section-number-4">2.3.4</span> <span class="done DONE">DONE</span> Test palindromicity</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
For the purpose of this problem, define a palindromic string to be a string
which when all the nonalphanumeric are removed it reads the same front to
back ignoring case.
</p>

<p>
Implement a function which takes as input a string s and returns true if s
is a palindromic string.
</p>
</div>

<div id="outline-container-org38bd57a" class="outline-5">
<h5 id="org38bd57a"><span class="section-number-5">2.3.4.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-3-4-1">
<p>
Use two cursors; one that starts at start of string, and one at the end.
</p>

<p>
Each step, perform equality comparison of the chars under each, returning
early with False if equality does not hold. Continue until i<sub>s</sub> &gt; i<sub>e</sub>
and return True if reach end of iteration. 
</p>

<p>
Time O(n) and space O(1).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">is_pal</span>(S):
    <span style="color: #D8DEE9;">i_s</span>, <span style="color: #D8DEE9;">i_e</span> = 0, <span style="color: #81A1C1;">len</span>(S) - 1
    <span style="color: #81A1C1;">while</span> i_s &lt; i_e:
        <span style="color: #81A1C1;">if</span> S[i_s].lower() != S[i_e].lower():
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
        <span style="color: #D8DEE9;">i_s</span> += 1
        <span style="color: #D8DEE9;">i_e</span> -= 1
        <span style="color: #81A1C1;">while</span> <span style="color: #81A1C1;">not</span> S[i_s].isalnum() <span style="color: #81A1C1;">and</span> i_s &lt; i_e:
            <span style="color: #D8DEE9;">i_s</span> += 1
        <span style="color: #81A1C1;">while</span> <span style="color: #81A1C1;">not</span> S[i_e].isalnum() <span style="color: #81A1C1;">and</span> i_s &lt; i_e:
            <span style="color: #D8DEE9;">i_e</span> -= 1
    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    is_pal(<span style="color: #A3BE8C;">"A man, a plan, a canal, Panama"</span>),
    <span style="color: #81A1C1;">not</span> is_pal(<span style="color: #A3BE8C;">",,a,b,,"</span>),
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-org628eb26" class="outline-4">
<h4 id="org628eb26"><span class="section-number-4">2.3.5</span> <span class="done DONE">DONE</span> Compute all mnemonics for a phone number</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
Write a program which takes as input a phone number, specified as a string
of digits, and returns all possible character sequences that correspond to
the phone nuber. The cell phone keypad is specified by a mapping that takes
a digit and returns the corresponding set of characters. The character
sequencs do not have to be legal words or phrases.
</p>
</div>
