README.org
**** Solution

     We maintain a static mapping from digits to sets of characters and use
     recursion to generate the power set of each digits' set.

     Complexity O(4^{n}), since each recursion step "fans out" at most four times
     (due to keypad mapping).

     #+BEGIN_SRC python :results output :session
       def mnemonics(S):
           MAP = {
               "0": ["0"],
               "1": ["1"],
               "2": set("abc"),
               "3": set("def"),
               "4": set("ghi"),
               "5": set("jkl"),
               "6": set("mno"),
               "7": set("pqrs"),
               "8": set("tuv"),
               "9": set("wxyz"),
           }
           if S == "":
               return []
           elif S[0] not in MAP:
               raise Exception
           return set([c+t for c in MAP[S[0]] for t in mnemonics(S[1:])])
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           mnemonics("2276696") | { "ACRONYM", "ABPOMZN" },
       ])
     #+END_SRC

     #+RESULTS:
     : True
     
** Linked Lists

*** DONE Merge two sorted lists                                             :C0:
    CLOSED: [2017-06-21 Wed 12:53]

    Write a program that takes two lists, assumed to be sorted, and returns
    their merge. The only field your program can change in a node is its =next=
    field.

    /Hint/: Two sorted arrays can be merged using two indices. For lists, take
    care when one iterator reaches the end.
    
**** Solution

     We describe a solution that completes the task in linear time and constant
     space.

     Call input lists =A= and =B=.

     We decide on the head of the return list with respect to comparison. We
     save a reference =H= to this head for final return; in the meantime, we
     create an additional "work-in-progress" reference =l= that we will use to
     iteratively wire up the return value.

     While neither =A= nor =B= have reached their ends, we compare the head
     values of each; whichever is less than or equal to the other, becomes the
     new target for =l.next=. We then increment both the assignee and =l= to
     their next links.

     Once one of =A= or =B= have reached their end, we treat the other as the
     "remainder" list. Since the two input lists are given to be sorted, we have
     the invariant that every element in the remainder is greater than or equal
     to the current =l=. As such, we assign =l.next = remainder=.

     For this solution's purpose, we define a lightweight linked-list API as
     follows:

     #+BEGIN_SRC python :results silent :session
       class LL():
           def __init__(self, v):
               self.v = v
               self.next = None
           def append(self, l):
               self.next = l
               return self
           def __eq__(self,l):
               me = self
               while me is not None and l is not None:
                   if me.v != l.v:
                       return False
                   me = me.next
                   l = l.next
               return me is None and l is None 
     #+END_SRC

     Our solution is as follows:

     #+BEGIN_SRC python :results silent :session
       def merge(A,B):
           if A is None:
               return B
           if B is None:
               return A
           if A.v < B.v:
               head = A
               A = A.next
           else:
               head = B
               B = B.next
           l = head # wip tracker
           cursors = { "A": A, "B": B }
           while cursors["A"] is not None and cursors["B"] is not None:
               k_next = "A" if cursors["A"].v < cursors["B"].v else "B"
               l.next = cursors[k_next]
               l = l.next
               cursors[k_next] = cursors[k_next].next
           l.next = cursors["A"] if cursors["A"] is not None else cursors["B"]
           return head
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           # base cases
           merge(None,None) == None,
           merge(None, LL(1).append(LL(2))) == LL(1).append(LL(2)),
           merge(LL(1).append(LL(3)), None) == LL(1).append(LL(3)),

           # "normal" case
           merge(
               LL(1).append(LL(3).append(LL(5))),
               LL(2).append(LL(4).append(LL(6))),
           ) == LL(1).append(LL(2).append(LL(3).append(LL(4).append(LL(5).append(LL(6)))))),

           # remainder case
           merge(
               LL(1).append(LL(5)),
               LL(2).append(LL(6).append(LL(10))),
           ) == LL(1).append(LL(2).append(LL(5).append(LL(6).append(LL(10))))),
       ])
     #+END_SRC

     #+RESULTS:
     : True

