index.html

<div id="outline-container-orgda54acd" class="outline-5">
<h5 id="orgda54acd"><span class="section-number-5">2.3.5.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-3-5-1">
<p>
We maintain a static mapping from digits to sets of characters and use
recursion to generate the power set of each digits&rsquo; set.
</p>

<p>
Complexity O(4<sup>n</sup>), since each recursion step &ldquo;fans out&rdquo; at most four times
(due to keypad mapping).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">mnemonics</span>(S):
    <span style="color: #D8DEE9;">MAP</span> = {
        <span style="color: #A3BE8C;">"0"</span>: [<span style="color: #A3BE8C;">"0"</span>],
        <span style="color: #A3BE8C;">"1"</span>: [<span style="color: #A3BE8C;">"1"</span>],
        <span style="color: #A3BE8C;">"2"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"abc"</span>),
        <span style="color: #A3BE8C;">"3"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"def"</span>),
        <span style="color: #A3BE8C;">"4"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"ghi"</span>),
        <span style="color: #A3BE8C;">"5"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"jkl"</span>),
        <span style="color: #A3BE8C;">"6"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"mno"</span>),
        <span style="color: #A3BE8C;">"7"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"pqrs"</span>),
        <span style="color: #A3BE8C;">"8"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"tuv"</span>),
        <span style="color: #A3BE8C;">"9"</span>: <span style="color: #81A1C1;">set</span>(<span style="color: #A3BE8C;">"wxyz"</span>),
    }
    <span style="color: #81A1C1;">if</span> S == <span style="color: #A3BE8C;">""</span>:
        <span style="color: #81A1C1;">return</span> []
    <span style="color: #81A1C1;">elif</span> S[0] <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">in</span> MAP:
        <span style="color: #81A1C1;">raise</span> <span style="color: #8FBCBB;">Exception</span>
    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">set</span>([c+t <span style="color: #81A1C1;">for</span> c <span style="color: #81A1C1;">in</span> MAP[S[0]] <span style="color: #81A1C1;">for</span> t <span style="color: #81A1C1;">in</span> mnemonics(S[1:])])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    mnemonics(<span style="color: #A3BE8C;">"2276696"</span>) | { <span style="color: #A3BE8C;">"ACRONYM"</span>, <span style="color: #A3BE8C;">"ABPOMZN"</span> },
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4628c2c" class="outline-3">
<h3 id="org4628c2c"><span class="section-number-3">2.4</span> Linked Lists</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org7b95d82" class="outline-4">
<h4 id="org7b95d82"><span class="section-number-4">2.4.1</span> <span class="done DONE">DONE</span> Merge two sorted lists</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Write a program that takes two lists, assumed to be sorted, and returns
their merge. The only field your program can change in a node is its <code>next</code>
field.
</p>

<p>
<i>Hint</i>: Two sorted arrays can be merged using two indices. For lists, take
care when one iterator reaches the end.
</p>
</div>

<div id="outline-container-org4cb9596" class="outline-5">
<h5 id="org4cb9596"><span class="section-number-5">2.4.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-4-1-1">
<p>
We describe a solution that completes the task in linear time and constant
space.
</p>

<p>
Call input lists <code>A</code> and <code>B</code>.
</p>

<p>
We decide on the head of the return list with respect to comparison. We
save a reference <code>H</code> to this head for final return; in the meantime, we
create an additional &ldquo;work-in-progress&rdquo; reference <code>l</code> that we will use to
iteratively wire up the return value.
</p>

<p>
While neither <code>A</code> nor <code>B</code> have reached their ends, we compare the head
values of each; whichever is less than or equal to the other, becomes the
new target for <code>l.next</code>. We then increment both the assignee and <code>l</code> to
their next links.
</p>

<p>
Once one of <code>A</code> or <code>B</code> have reached their end, we treat the other as the
&ldquo;remainder&rdquo; list. Since the two input lists are given to be sorted, we have
the invariant that every element in the remainder is greater than or equal
to the current <code>l</code>. As such, we assign <code>l.next = remainder</code>.
</p>

<p>
For this solution&rsquo;s purpose, we define a lightweight linked-list API as
follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">LL</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.<span style="color: #81A1C1;">next</span> = <span style="color: #81A1C1;">None</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">append</span>(<span style="color: #81A1C1;">self</span>, l):
        <span style="color: #81A1C1;">self</span>.<span style="color: #81A1C1;">next</span> = l
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">self</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__eq__</span>(<span style="color: #81A1C1;">self</span>,l):
        <span style="color: #D8DEE9;">me</span> = <span style="color: #81A1C1;">self</span>
        <span style="color: #81A1C1;">while</span> me <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> l <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span>:
            <span style="color: #81A1C1;">if</span> me.v != l.v:
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
            <span style="color: #D8DEE9;">me</span> = me.<span style="color: #81A1C1;">next</span>
            <span style="color: #D8DEE9;">l</span> = l.<span style="color: #81A1C1;">next</span>
        <span style="color: #81A1C1;">return</span> me <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> l <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> 
</pre>
</div>

<p>
Our solution is as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">merge</span>(A,B):
    <span style="color: #81A1C1;">if</span> A <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span>:
        <span style="color: #81A1C1;">return</span> B
    <span style="color: #81A1C1;">if</span> B <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span>:
        <span style="color: #81A1C1;">return</span> A
    <span style="color: #81A1C1;">if</span> A.v &lt; B.v:
        <span style="color: #D8DEE9;">head</span> = A
        <span style="color: #D8DEE9;">A</span> = A.<span style="color: #81A1C1;">next</span>
    <span style="color: #81A1C1;">else</span>:
        <span style="color: #D8DEE9;">head</span> = B
        <span style="color: #D8DEE9;">B</span> = B.<span style="color: #81A1C1;">next</span>
    <span style="color: #D8DEE9;">l</span> = head <span style="color: #616e88;"># </span><span style="color: #616e88;">wip tracker</span>
    <span style="color: #D8DEE9;">cursors</span> = { <span style="color: #A3BE8C;">"A"</span>: A, <span style="color: #A3BE8C;">"B"</span>: B }
    <span style="color: #81A1C1;">while</span> cursors[<span style="color: #A3BE8C;">"A"</span>] <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> cursors[<span style="color: #A3BE8C;">"B"</span>] <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span>:
        <span style="color: #D8DEE9;">k_next</span> = <span style="color: #A3BE8C;">"A"</span> <span style="color: #81A1C1;">if</span> cursors[<span style="color: #A3BE8C;">"A"</span>].v &lt; cursors[<span style="color: #A3BE8C;">"B"</span>].v <span style="color: #81A1C1;">else</span> <span style="color: #A3BE8C;">"B"</span>
        l.<span style="color: #81A1C1;">next</span> = cursors[k_next]
        <span style="color: #D8DEE9;">l</span> = l.<span style="color: #81A1C1;">next</span>
        <span style="color: #D8DEE9;">cursors</span>[k_next] = cursors[k_next].<span style="color: #81A1C1;">next</span>
    l.<span style="color: #81A1C1;">next</span> = cursors[<span style="color: #A3BE8C;">"A"</span>] <span style="color: #81A1C1;">if</span> cursors[<span style="color: #A3BE8C;">"A"</span>] <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">else</span> cursors[<span style="color: #A3BE8C;">"B"</span>]
    <span style="color: #81A1C1;">return</span> head
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    <span style="color: #616e88;"># </span><span style="color: #616e88;">base cases</span>
    merge(<span style="color: #81A1C1;">None</span>,<span style="color: #81A1C1;">None</span>) == <span style="color: #81A1C1;">None</span>,
    merge(<span style="color: #81A1C1;">None</span>, LL(1).append(LL(2))) == LL(1).append(LL(2)),
    merge(LL(1).append(LL(3)), <span style="color: #81A1C1;">None</span>) == LL(1).append(LL(3)),

    <span style="color: #616e88;"># </span><span style="color: #616e88;">"normal" case</span>
    merge(
        LL(1).append(LL(3).append(LL(5))),
        LL(2).append(LL(4).append(LL(6))),
    ) == LL(1).append(LL(2).append(LL(3).append(LL(4).append(LL(5).append(LL(6)))))),

    <span style="color: #616e88;"># </span><span style="color: #616e88;">remainder case</span>
    merge(
        LL(1).append(LL(5)),
        LL(2).append(LL(6).append(LL(10))),
    ) == LL(1).append(LL(2).append(LL(5).append(LL(6).append(LL(10))))),
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>
