README.org
*** DONE Reverse a singly linked list                                       :C1:
    CLOSED: [2017-06-27 Tue 13:07]

**** Solution

     #+BEGIN_SRC python :results output :session
       class LL():
           def __init__(self, v):
               self.v = v
               self.next = None
           def append(self, l):
               self.next = l
               return self
           def __eq__(self,l):
               me = self
               while me is not None and l is not None:
                   if me.v != l.v:
                       return False
                   me = me.next
                   l = l.next
               return me is None and l is None 
     #+END_SRC

     #+RESULTS:

     #+BEGIN_SRC python :results output :session
       def ll_rev(L):
           tail = None
           cursor = L
           while cursor is not None:
               nxt = cursor.next
               cursor.next = tail
               tail = cursor
               cursor = nxt
           return tail
     #+END_SRC

     #+BEGIN_SRC python :results output :session
     ll_rev(LL(4).append(LL(5).append(LL(6)))) == LL(6).append(LL(5).append(LL(4)))
     #+END_SRC

*** DONE Test for cyclicity                                                 :C1:
    CLOSED: [2018-04-29 Sun 18:02]

**** Solution

     #+BEGIN_SRC python :results silent :session
       class LL():
           def __init__(self, value, nxt=None):
               self.value = value
               self.nxt = nxt
     #+END_SRC

     For convenience's sake, we assume that the linked-list has a uniqueness
     constraint. This constraint allows us to uniquely reference each node in
     the linked-list by its contained value.

     This constraint can be removed by using, say, memory address as the unique
     reference, but the algorithm remains the same.

     #+BEGIN_SRC python :results silent :session
       def is_cycle(ll):
           c_back = ll
           c_front = ll.nxt
           if not c_front:
               return False
           while c_back.value != c_front.value:
               c_back = c_back.nxt
               for _ in xrange(2):
                   c_front = c_front.nxt
                   if not c_front:
                       return False
           return True
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           not is_cycle(LL(1)),
           not is_cycle(LL(1, LL(2, LL(3, LL(4, LL(5)))))),
           is_cycle(LL(1, LL(2, LL(3, LL(2, LL(3, LL(2, LL(3)))))))),
       ])
     #+END_SRC

     #+RESULTS:
     : True

*** DONE Test for overlapping lists -- lists are cycle-free                 :C2:
    CLOSED: [2017-07-01 Sat 18:19]

    Write a program that takes two cycle-free singly linked lists, and
    determines if there exists a node that is common to both lists.

**** Solution

     We note that the case where lists L_{1} and L_{2} are of equal length is
     trivial. We therefore attempt to reduce cases where the input lists are of
     different length to that simple case. Measure the lengths of lists L_{1}
     and L_{2}; this can be done in O(n) time. Advance the longer of the two
     lists by the difference in lengths, at which point you've arrived at the
     trivial case; advance through both in tandem until you either reach the end
     of both lists -- showing that there is no overlap -- or until you reach the
     overlap.

*** DONE Remove the k^{th} last element from a list                         :C2:
    CLOSED: [2017-07-01 Sat 18:38]

    Given a singly linked list and an integer k, write a program to remove the
    kth last element from the list. Your algorithm cannot use more than a few
    words of storage, regardless of the length of the list. In particular, you
    cannot assume that it is possible to record the length of the list.

    /Hint/: If you know the length of the list, can you find the kth last node
    using two iterators?

