index.html

<div id="outline-container-org338e5bb" class="outline-4">
<h4 id="org338e5bb"><span class="section-number-4">2.4.2</span> <span class="done DONE">DONE</span> Reverse a singly linked list</h4>
<div class="outline-text-4" id="text-2-4-2">
</div>

<div id="outline-container-org49fd9f3" class="outline-5">
<h5 id="org49fd9f3"><span class="section-number-5">2.4.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-4-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">LL</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.<span style="color: #81A1C1;">next</span> = <span style="color: #81A1C1;">None</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">append</span>(<span style="color: #81A1C1;">self</span>, l):
        <span style="color: #81A1C1;">self</span>.<span style="color: #81A1C1;">next</span> = l
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">self</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__eq__</span>(<span style="color: #81A1C1;">self</span>,l):
        <span style="color: #D8DEE9;">me</span> = <span style="color: #81A1C1;">self</span>
        <span style="color: #81A1C1;">while</span> me <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> l <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span>:
            <span style="color: #81A1C1;">if</span> me.v != l.v:
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
            <span style="color: #D8DEE9;">me</span> = me.<span style="color: #81A1C1;">next</span>
            <span style="color: #D8DEE9;">l</span> = l.<span style="color: #81A1C1;">next</span>
        <span style="color: #81A1C1;">return</span> me <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> l <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">ll_rev</span>(L):
    <span style="color: #D8DEE9;">tail</span> = <span style="color: #81A1C1;">None</span>
    <span style="color: #D8DEE9;">cursor</span> = L
    <span style="color: #81A1C1;">while</span> cursor <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span>:
        <span style="color: #D8DEE9;">nxt</span> = cursor.<span style="color: #81A1C1;">next</span>
        cursor.<span style="color: #81A1C1;">next</span> = tail
        <span style="color: #D8DEE9;">tail</span> = cursor
        <span style="color: #D8DEE9;">cursor</span> = nxt
    <span style="color: #81A1C1;">return</span> tail
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">ll_rev(LL(4).append(LL(5).append(LL(6)))) == LL(6).append(LL(5).append(LL(4)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbe3e808" class="outline-4">
<h4 id="orgbe3e808"><span class="section-number-4">2.4.3</span> <span class="done DONE">DONE</span> Test for cyclicity</h4>
<div class="outline-text-4" id="text-2-4-3">
</div>

<div id="outline-container-orga785e26" class="outline-5">
<h5 id="orga785e26"><span class="section-number-5">2.4.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-4-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">LL</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, value, nxt=<span style="color: #81A1C1;">None</span>):
        <span style="color: #81A1C1;">self</span>.value = value
        <span style="color: #81A1C1;">self</span>.nxt = nxt
</pre>
</div>

<p>
For convenience&rsquo;s sake, we assume that the linked-list has a uniqueness
constraint. This constraint allows us to uniquely reference each node in
the linked-list by its contained value.
</p>

<p>
This constraint can be removed by using, say, memory address as the unique
reference, but the algorithm remains the same.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">is_cycle</span>(ll):
    <span style="color: #D8DEE9;">c_back</span> = ll
    <span style="color: #D8DEE9;">c_front</span> = ll.nxt
    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> c_front:
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
    <span style="color: #81A1C1;">while</span> c_back.value != c_front.value:
        <span style="color: #D8DEE9;">c_back</span> = c_back.nxt
        <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">xrange</span>(2):
            <span style="color: #D8DEE9;">c_front</span> = c_front.nxt
            <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> c_front:
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    <span style="color: #81A1C1;">not</span> is_cycle(LL(1)),
    <span style="color: #81A1C1;">not</span> is_cycle(LL(1, LL(2, LL(3, LL(4, LL(5)))))),
    is_cycle(LL(1, LL(2, LL(3, LL(2, LL(3, LL(2, LL(3)))))))),
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f06290" class="outline-4">
<h4 id="org7f06290"><span class="section-number-4">2.4.4</span> <span class="done DONE">DONE</span> Test for overlapping lists &#x2013; lists are cycle-free</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
Write a program that takes two cycle-free singly linked lists, and
determines if there exists a node that is common to both lists.
</p>
</div>

<div id="outline-container-orge4b528a" class="outline-5">
<h5 id="orge4b528a"><span class="section-number-5">2.4.4.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-4-4-1">
<p>
We note that the case where lists L<sub>1</sub> and L<sub>2</sub> are of equal length is
trivial. We therefore attempt to reduce cases where the input lists are of
different length to that simple case. Measure the lengths of lists L<sub>1</sub>
and L<sub>2</sub>; this can be done in O(n) time. Advance the longer of the two
lists by the difference in lengths, at which point you&rsquo;ve arrived at the
trivial case; advance through both in tandem until you either reach the end
of both lists &#x2013; showing that there is no overlap &#x2013; or until you reach the
overlap.
</p>
</div>
</div>
</div>

<div id="outline-container-org5012930" class="outline-4">
<h4 id="org5012930"><span class="section-number-4">2.4.5</span> <span class="done DONE">DONE</span> Remove the k<sup>th</sup> last element from a list</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
Given a singly linked list and an integer k, write a program to remove the
kth last element from the list. Your algorithm cannot use more than a few
words of storage, regardless of the length of the list. In particular, you
cannot assume that it is possible to record the length of the list.
</p>

<p>
<i>Hint</i>: If you know the length of the list, can you find the kth last node
using two iterators?
</p>
</div>
