README.org
**** Solution

     We note that we do not need to know the specific length of the list L in
     order to find the kth-last element.

     We use two cursors, c_{1} and c_{2}, where c_{2} is k steps ahead of c_{1}
     in the list L. If L is not long enough to satisfy this invariant on
     initialization, we terminate with an error.

     We then iterate each cursor in tandem, keeping a separate pointer to the
     previous item under c_{1} on each iteration -- call it c_{p} -- until c_{2}
     reaches the terminus of the list -- concretely, the null-pointer of the
     linked list. At this point, c_{1} is referring to the k-th last element
     of L. We then delete the element the usual way.

     This implementation is O(n) in time and O(1) in space.

     #+BEGIN_SRC python :results silent :session
       class LL():
           def __init__(self, v):
               self.v = v
               self.next = None
           def append(self, l):
               self.next = l
               return self
           def __eq__(self,l):
               me = self
               while me is not None and l is not None:
                   if me.v != l.v:
                       return False
                   me = me.next
                   l = l.next
               return me is None and l is None 

       def cons(v, n=None):
           l = LL(v)
           l.next = n
           return l
     #+END_SRC

     #+BEGIN_SRC python :results silent :session
       def rm_kth_last(L, k):
           out = L
           c_p = None
           c_1, c_2 = out, out
           for _ in range(k):
               if c_2.next is None:
                   raise Exception
               c_2 = c_2.next
           while c_2 is not None:
               c_p = c_1
               c_1 = c_1.next
               c_2 = c_2.next
           c_p.next = c_1.next
           return out
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           rm_kth_last(cons(1,cons(2,cons(3))), 1) == cons(1,cons(2)),
           rm_kth_last(cons(1,cons(2,cons(3,cons(4,cons(5))))), 3) == cons(1,cons(2,cons(4,cons(5)))),
       ])

     #+END_SRC

     #+RESULTS:
     : True

     
*** TODO Implement even-odd merge                                           :C3:

*** TODO Test whether a singly linked list is palindromic                   :C4:

** Stacks and Queues
   
*** DONE Implement a stack with =max= API                                   :C0:
    CLOSED: [2017-06-21 Wed 01:06]

    Design a stack that includes a max operation, in addition to push and
    pop. The max method should return the maximum value stored in the stack.
    
**** Solution

     We can use an augmentation of a "vanilla" stack for this purpose. Each
     element of this augmented stack -- call it a "max stack" -- will maintain a
     record of the maximum value at or below its current level. This will allow
     us to preserve the following invariant for given max-stack =S=:

     #+BEGIN_VERBATIM
     S.head.max = max(S)
     #+END_VERBATIM

     We can implement the max-stack as follows:

     #+BEGIN_SRC python :results silent :session
       class MaxStack():
           def __init__(self, *args):
               self.record = []
               for v in args:
                   self.push(v)
           def push(self, v):
               if not self.record:
                   self.record.append((v,v))
               else:
                   self.record.append((v,max(v,self.record[-1][1])))
               return self
           def pop(self):
               if not self.record:
                   return None
               out = self.record[-1][0]
               self.record = self.record[0:-1]
               return out
           # drop silently pops 
           def drop(self):
               self.pop()
               return self
           def max(self):
               if not self.record:
                   return None
               return self.record[-1][1]
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           MaxStack(1,4,3,2,5).max() == 5,
           MaxStack(1,4,3,2,5).drop().max() == 4,
           MaxStack(2,3,4,1).drop().drop().max() == 3,
       ])
     #+END_SRC

     #+RESULTS:
     : True

     This implementation is:

     - O(1) for push;
     - O(1) for pop;
     - O(1) for max lookup.


     Space complexity is O(2n) = O(n), where n is the stack size.

*** DONE Test a string of parentheses, braces, and brackets for well-formedness
    CLOSED: [2017-06-25 Sun 22:46]

