index.html

<div id="outline-container-org20830b9" class="outline-5">
<h5 id="org20830b9"><span class="section-number-5">2.4.5.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-4-5-1">
<p>
We note that we do not need to know the specific length of the list L in
order to find the kth-last element.
</p>

<p>
We use two cursors, c<sub>1</sub> and c<sub>2</sub>, where c<sub>2</sub> is k steps ahead of c<sub>1</sub>
in the list L. If L is not long enough to satisfy this invariant on
initialization, we terminate with an error.
</p>

<p>
We then iterate each cursor in tandem, keeping a separate pointer to the
previous item under c<sub>1</sub> on each iteration &#x2013; call it c<sub>p</sub> &#x2013; until c<sub>2</sub>
reaches the terminus of the list &#x2013; concretely, the null-pointer of the
linked list. At this point, c<sub>1</sub> is referring to the k-th last element
of L. We then delete the element the usual way.
</p>

<p>
This implementation is O(n) in time and O(1) in space.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">LL</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.<span style="color: #81A1C1;">next</span> = <span style="color: #81A1C1;">None</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">append</span>(<span style="color: #81A1C1;">self</span>, l):
        <span style="color: #81A1C1;">self</span>.<span style="color: #81A1C1;">next</span> = l
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">self</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__eq__</span>(<span style="color: #81A1C1;">self</span>,l):
        <span style="color: #D8DEE9;">me</span> = <span style="color: #81A1C1;">self</span>
        <span style="color: #81A1C1;">while</span> me <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> l <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span>:
            <span style="color: #81A1C1;">if</span> me.v != l.v:
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
            <span style="color: #D8DEE9;">me</span> = me.<span style="color: #81A1C1;">next</span>
            <span style="color: #D8DEE9;">l</span> = l.<span style="color: #81A1C1;">next</span>
        <span style="color: #81A1C1;">return</span> me <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> l <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> 

<span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">cons</span>(v, n=<span style="color: #81A1C1;">None</span>):
    <span style="color: #D8DEE9;">l</span> = LL(v)
    l.<span style="color: #81A1C1;">next</span> = n
    <span style="color: #81A1C1;">return</span> l
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">rm_kth_last</span>(L, k):
    <span style="color: #D8DEE9;">out</span> = L
    <span style="color: #D8DEE9;">c_p</span> = <span style="color: #81A1C1;">None</span>
    <span style="color: #D8DEE9;">c_1</span>, <span style="color: #D8DEE9;">c_2</span> = out, out
    <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(k):
        <span style="color: #81A1C1;">if</span> c_2.<span style="color: #81A1C1;">next</span> <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span>:
            <span style="color: #81A1C1;">raise</span> <span style="color: #8FBCBB;">Exception</span>
        <span style="color: #D8DEE9;">c_2</span> = c_2.<span style="color: #81A1C1;">next</span>
    <span style="color: #81A1C1;">while</span> c_2 <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span>:
        <span style="color: #D8DEE9;">c_p</span> = c_1
        <span style="color: #D8DEE9;">c_1</span> = c_1.<span style="color: #81A1C1;">next</span>
        <span style="color: #D8DEE9;">c_2</span> = c_2.<span style="color: #81A1C1;">next</span>
    c_p.<span style="color: #81A1C1;">next</span> = c_1.<span style="color: #81A1C1;">next</span>
    <span style="color: #81A1C1;">return</span> out
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    rm_kth_last(cons(1,cons(2,cons(3))), 1) == cons(1,cons(2)),
    rm_kth_last(cons(1,cons(2,cons(3,cons(4,cons(5))))), 3) == cons(1,cons(2,cons(4,cons(5)))),
])

</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb8c3cef" class="outline-4">
<h4 id="orgb8c3cef"><span class="section-number-4">2.4.6</span> <span class="todo TODO">TODO</span> Implement even-odd merge</h4>
</div>

<div id="outline-container-org710848b" class="outline-4">
<h4 id="org710848b"><span class="section-number-4">2.4.7</span> <span class="todo TODO">TODO</span> Test whether a singly linked list is palindromic</h4>
</div>
</div>

<div id="outline-container-org900f287" class="outline-3">
<h3 id="org900f287"><span class="section-number-3">2.5</span> Stacks and Queues</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orge24ce0e" class="outline-4">
<h4 id="orge24ce0e"><span class="section-number-4">2.5.1</span> <span class="done DONE">DONE</span> Implement a stack with <code>max</code> API</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Design a stack that includes a max operation, in addition to push and
pop. The max method should return the maximum value stored in the stack.
</p>
</div>

<div id="outline-container-org8efb493" class="outline-5">
<h5 id="org8efb493"><span class="section-number-5">2.5.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-5-1-1">
<p>
We can use an augmentation of a &ldquo;vanilla&rdquo; stack for this purpose. Each
element of this augmented stack &#x2013; call it a &ldquo;max stack&rdquo; &#x2013; will maintain a
record of the maximum value at or below its current level. This will allow
us to preserve the following invariant for given max-stack <code>S</code>:
</p>

<div class="VERBATIM">
<p>
S.head.max = max(S)
</p>

</div>

<p>
We can implement the max-stack as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">MaxStack</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, *args):
        <span style="color: #81A1C1;">self</span>.record = []
        <span style="color: #81A1C1;">for</span> v <span style="color: #81A1C1;">in</span> args:
            <span style="color: #81A1C1;">self</span>.push(v)
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">push</span>(<span style="color: #81A1C1;">self</span>, v):
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">self</span>.record:
            <span style="color: #81A1C1;">self</span>.record.append((v,v))
        <span style="color: #81A1C1;">else</span>:
            <span style="color: #81A1C1;">self</span>.record.append((v,<span style="color: #81A1C1;">max</span>(v,<span style="color: #81A1C1;">self</span>.record[-1][1])))
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">self</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">pop</span>(<span style="color: #81A1C1;">self</span>):
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">self</span>.record:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">None</span>
        <span style="color: #D8DEE9;">out</span> = <span style="color: #81A1C1;">self</span>.record[-1][0]
        <span style="color: #81A1C1;">self</span>.record = <span style="color: #81A1C1;">self</span>.record[0:-1]
        <span style="color: #81A1C1;">return</span> out
    <span style="color: #616e88;"># </span><span style="color: #616e88;">drop silently pops </span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">drop</span>(<span style="color: #81A1C1;">self</span>):
        <span style="color: #81A1C1;">self</span>.pop()
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">self</span>
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">max</span>(<span style="color: #81A1C1;">self</span>):
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">self</span>.record:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">None</span>
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">self</span>.record[-1][1]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    MaxStack(1,4,3,2,5).<span style="color: #81A1C1;">max</span>() == 5,
    MaxStack(1,4,3,2,5).drop().<span style="color: #81A1C1;">max</span>() == 4,
    MaxStack(2,3,4,1).drop().drop().<span style="color: #81A1C1;">max</span>() == 3,
])
</pre>
</div>

<pre class="example">
True
</pre>


<p>
This implementation is:
</p>

<ul class="org-ul">
<li>O(1) for push;</li>
<li>O(1) for pop;</li>
<li>O(1) for max lookup.</li>
</ul>


<p>
Space complexity is O(2n) = O(n), where n is the stack size.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf564eae" class="outline-4">
<h4 id="orgf564eae"><span class="section-number-4">2.5.2</span> <span class="done DONE">DONE</span> Test a string of parentheses, braces, and brackets for well-formedness</h4>
<div class="outline-text-4" id="text-2-5-2">
</div>
