README.org
**** Solution

     #+BEGIN_SRC python :results silent :session
       def is_well_formed(S):
           PAIRS = {
               "{": "}",
               "(": ")",
               "[": "]",
           }
           opens = []
           for c in S:
               if c in PAIRS:
                   opens.append(c)
               elif opens and c == PAIRS[opens[-1]]:
                   opens = opens[:-1]
               else:
                   return False
           return not opens
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           is_well_formed(""),
           is_well_formed("()"),
           is_well_formed("[]"),
           is_well_formed("{}"),
           is_well_formed("{[()]}"),
           not is_well_formed("{[([)]}"),
           not is_well_formed("}"),
       ])
     #+END_SRC

     #+RESULTS:
     : True

*** DONE Compute binary tree nodes in order of increasing depth             :C1:
    CLOSED: [2017-06-27 Tue 13:29]

**** Solution

     We use a queue as the basis of our solution. We start with the input tree T
     in the queue. For each node N in the queue, we enqueue its children, and
     then yield N. We continue until the queue is empty for a final time
     complexity of O(n) and likewise for space.

     #+BEGIN_SRC python :results silent :session
       def serialize_inc_depth(T):
           q = [T]
           while q and q[0] is not None:
               curr = q[0]
               q.extend([c for c in [curr.l, curr.r] if c])
               yield q.popleft()
     #+END_SRC

** Binary Trees

*** DONE Test if a binary tree is height-balanced                           :C0:
    CLOSED: [2017-06-25 Sun 21:56]

    A binary tree is said to be balanced if for each node in the tree, the
    difference in the height of its left and right subtrees is at most one. A
    perfect binary tree is balanced, as is a complete binary tree. A balanced
    binary tree does not have to be perfect or complete.

    Write a program that takes as input the root of a binary tree and checks
    whether the tree is balanced.
    
**** Solution

     We can use a post-order traversal as the backbone for our implementation.

     For each subtree, we determine its height. When traversing parent nodes, if
     the difference in the height of its two subtrees is greater than 1, we
     return false immediately. Otherwise, we return one greater than the greater
     of the two children heights.

     #+BEGIN_SRC python :results output :session
       def is_height_balanced(T):
           def height(n):
               if not n:
                   return 0
               hl, hr = height(n.left), height(n.right)
               if abs(hl - hr) > 1:
                   raise Exception
               return max(hl, hr) + 1
           try:
               height(T)
           except Exception:
               return False
           return True
     #+END_SRC

     This implementation is O(n), where n is the number of nodes in the tree. It
     is O(1) in space. 
     
*** DONE Compute the LCA when nodes have parent pointers                    :C1:
    CLOSED: [2017-06-25 Sun 18:37]

**** Solution

     We note that the solution is trivial if the nodes are at the same depth:
     iterate in tandem until you reach the common ancestor node. This operation
     is O(log n).

     Otherwise, if the nodes are at different depths, we can iterate the deeper
     node until both cursors are at the same depth, at which point the problem
     reduces to the same-depth case.

     Both of these cases require us to determine the depths of the two
     nodes. This can be done by tracing the respective parent pointers to the
     root and storing the traversal length.

     We note that both depth-determination and final traversal are O(log n); the
     combined solution is O(log n) w.r.t. time and O(1) w.r.t. space.

*** DONE Test if a binary tree is symmetric                                 :C2:
    CLOSED: [2017-06-29 Thu 15:50]

    A binary tree is symmetric if you can draw a vertical line through the root
    and then the left subtree is the mirror image of the right subtree.

    Write a program that checks whether a binary tree is symmetric.

    /Hint/: The definition of symmetry is recursive.

