index.html

<div id="outline-container-org35cfa77" class="outline-5">
<h5 id="org35cfa77"><span class="section-number-5">2.5.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-5-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">is_well_formed</span>(S):
    <span style="color: #D8DEE9;">PAIRS</span> = {
        <span style="color: #A3BE8C;">"{"</span>: <span style="color: #A3BE8C;">"}"</span>,
        <span style="color: #A3BE8C;">"("</span>: <span style="color: #A3BE8C;">")"</span>,
        <span style="color: #A3BE8C;">"["</span>: <span style="color: #A3BE8C;">"]"</span>,
    }
    <span style="color: #D8DEE9;">opens</span> = []
    <span style="color: #81A1C1;">for</span> c <span style="color: #81A1C1;">in</span> S:
        <span style="color: #81A1C1;">if</span> c <span style="color: #81A1C1;">in</span> PAIRS:
            opens.append(c)
        <span style="color: #81A1C1;">elif</span> opens <span style="color: #81A1C1;">and</span> c == PAIRS[opens[-1]]:
            <span style="color: #D8DEE9;">opens</span> = opens[:-1]
        <span style="color: #81A1C1;">else</span>:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">not</span> opens
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    is_well_formed(<span style="color: #A3BE8C;">""</span>),
    is_well_formed(<span style="color: #A3BE8C;">"()"</span>),
    is_well_formed(<span style="color: #A3BE8C;">"[]"</span>),
    is_well_formed(<span style="color: #A3BE8C;">"{}"</span>),
    is_well_formed(<span style="color: #A3BE8C;">"{[()]}"</span>),
    <span style="color: #81A1C1;">not</span> is_well_formed(<span style="color: #A3BE8C;">"{[([)]}"</span>),
    <span style="color: #81A1C1;">not</span> is_well_formed(<span style="color: #A3BE8C;">"}"</span>),
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-orga7d5373" class="outline-4">
<h4 id="orga7d5373"><span class="section-number-4">2.5.3</span> <span class="done DONE">DONE</span> Compute binary tree nodes in order of increasing depth</h4>
<div class="outline-text-4" id="text-2-5-3">
</div>

<div id="outline-container-orge29475c" class="outline-5">
<h5 id="orge29475c"><span class="section-number-5">2.5.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-5-3-1">
<p>
We use a queue as the basis of our solution. We start with the input tree T
in the queue. For each node N in the queue, we enqueue its children, and
then yield N. We continue until the queue is empty for a final time
complexity of O(n) and likewise for space.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">serialize_inc_depth</span>(T):
    <span style="color: #D8DEE9;">q</span> = [T]
    <span style="color: #81A1C1;">while</span> q <span style="color: #81A1C1;">and</span> q[0] <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span>:
        <span style="color: #D8DEE9;">curr</span> = q[0]
        q.extend([c <span style="color: #81A1C1;">for</span> c <span style="color: #81A1C1;">in</span> [curr.l, curr.r] <span style="color: #81A1C1;">if</span> c])
        <span style="color: #81A1C1;">yield</span> q.popleft()
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org157e768" class="outline-3">
<h3 id="org157e768"><span class="section-number-3">2.6</span> Binary Trees</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgde7d03d" class="outline-4">
<h4 id="orgde7d03d"><span class="section-number-4">2.6.1</span> <span class="done DONE">DONE</span> Test if a binary tree is height-balanced</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
A binary tree is said to be balanced if for each node in the tree, the
difference in the height of its left and right subtrees is at most one. A
perfect binary tree is balanced, as is a complete binary tree. A balanced
binary tree does not have to be perfect or complete.
</p>

<p>
Write a program that takes as input the root of a binary tree and checks
whether the tree is balanced.
</p>
</div>

<div id="outline-container-orgd743159" class="outline-5">
<h5 id="orgd743159"><span class="section-number-5">2.6.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-6-1-1">
<p>
We can use a post-order traversal as the backbone for our implementation.
</p>

<p>
For each subtree, we determine its height. When traversing parent nodes, if
the difference in the height of its two subtrees is greater than 1, we
return false immediately. Otherwise, we return one greater than the greater
of the two children heights.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">is_height_balanced</span>(T):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">height</span>(n):
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> n:
            <span style="color: #81A1C1;">return</span> 0
        <span style="color: #D8DEE9;">hl</span>, <span style="color: #D8DEE9;">hr</span> = height(n.left), height(n.right)
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">abs</span>(hl - hr) &gt; 1:
            <span style="color: #81A1C1;">raise</span> <span style="color: #8FBCBB;">Exception</span>
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">max</span>(hl, hr) + 1
    <span style="color: #81A1C1;">try</span>:
        height(T)
    <span style="color: #81A1C1;">except</span> <span style="color: #8FBCBB;">Exception</span>:
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
</pre>
</div>

<p>
This implementation is O(n), where n is the number of nodes in the tree. It
is O(1) in space. 
</p>
</div>
</div>
</div>

<div id="outline-container-org545d1ed" class="outline-4">
<h4 id="org545d1ed"><span class="section-number-4">2.6.2</span> <span class="done DONE">DONE</span> Compute the LCA when nodes have parent pointers</h4>
<div class="outline-text-4" id="text-2-6-2">
</div>

<div id="outline-container-org61376be" class="outline-5">
<h5 id="org61376be"><span class="section-number-5">2.6.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-6-2-1">
<p>
We note that the solution is trivial if the nodes are at the same depth:
iterate in tandem until you reach the common ancestor node. This operation
is O(log n).
</p>

<p>
Otherwise, if the nodes are at different depths, we can iterate the deeper
node until both cursors are at the same depth, at which point the problem
reduces to the same-depth case.
</p>

<p>
Both of these cases require us to determine the depths of the two
nodes. This can be done by tracing the respective parent pointers to the
root and storing the traversal length.
</p>

<p>
We note that both depth-determination and final traversal are O(log n); the
combined solution is O(log n) w.r.t. time and O(1) w.r.t. space.
</p>
</div>
</div>
</div>

<div id="outline-container-org3d2456b" class="outline-4">
<h4 id="org3d2456b"><span class="section-number-4">2.6.3</span> <span class="done DONE">DONE</span> Test if a binary tree is symmetric</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
A binary tree is symmetric if you can draw a vertical line through the root
and then the left subtree is the mirror image of the right subtree.
</p>

<p>
Write a program that checks whether a binary tree is symmetric.
</p>

<p>
<i>Hint</i>: The definition of symmetry is recursive.
</p>
</div>
