README.org
**** Solution

     We note that trees  T_{1} and T_{2} are symmetric if their root values are equal
     and T_{1}'s left child equals T_{2}'s right child and vice-versa.

     We recursively check the input tree. The input root level is a special case
     where we simply check children equality. We then begin recursive
     "mirroring" comparison on the two child trees. "Mirroring" comparison
     consists of first checking that the left-right and right-left child value
     equalities are satisfied and then performing recursive mirroring comparison
     on the left-right and right-left pairs.

     #+BEGIN_SRC python :results silent :session
       class Tree():
           def __init__(self, v, l=none, r=none):
               self.v = v
               self.l = l
               self.r = r
     #+END_SRC

     #+BEGIN_SRC python :results output :session
       def is_sym(T):
           def is_mirror(T1, T2):
               return ((T1 is None and T2 is None)
                       or (T1.v == T2.v
                           and is_mirror(T1.l, T2.r)
                           and is_mirror(T1.r, T2.l)))
           return T is None or is_mirror(T.l, T.r)
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           is_sym(None),
           is_sym(Tree(v=1, l=Tree(v=2), r=Tree(v=2))),
           is_sym(Tree(
               v=1,
               l=Tree(v=2, l=Tree(v=3, l=Tree(v=10)), r=Tree(v=4)),
               r=Tree(v=2, l=Tree(v=4), r=Tree(v=3, r=Tree(v=10))),
           )),
           not is_sym(Tree(v=1, l=Tree(v=2), r=Tree(v=3))),
       ])
     #+END_SRC

     #+RESULTS:
     : True

     
*** DONE Reconstruct a binary tree from traversal data                      :C2:
    CLOSED: [2017-07-01 Sat 18:00]

    #+BEGIN_QUOTE
    Given an inorder traversal sequence and a postorder traversal sequence of a
    binary tree write a program to reconstruct the tree. Assume each node has a
    unique key.

    /Hint/: Focus on the root.
    #+END_QUOTE

    The key insight here is that, for any input in-order traversal =it= and any
    input post-order traversal =pt=, we have the following invariants:

    - =it= and =pt= are equal in length;
    - The last element of =pt= corresponds to the "root" of the given tree.


    Furthermore, we observe that =it= and =pt= are each laid out as follows:

    #+BEGIN_VERBATIM
    it [<----LHS----><ROOT><----RHS---->]
    pt [<----LHS----><----RHS----><ROOT>]
    #+END_VERBATIM

    As such, we can use the tail value of =pt= during every iteration to
    "bisect" the in-order traversal list, giving us the number of elements in
    both the left branch and the right branch. Using these quantities, we can
    extract the corresponding sub-lists out of the top-level post-order
    traversal, giving us everything that we need for a recursive
    implementation.

    #+BEGIN_SRC python :results silent :session
      def teq(lhs, rhs):
          return (lhs is None and rhs is None) \
              or (lhs.value == rhs.value
                  and teq(lhs.lhs, rhs.lhs)
                  and teq(lhs.rhs, rhs.rhs))


      class Tree():
          def __init__(self, value, lhs=None, rhs=None):
              self.value = value
              self.lhs = lhs
              self.rhs = rhs


      def reconstruct(it, pt):
          assert len(it) == len(pt)
          if not it and not pt:
              return None

          if len(it) == 1 and len(pt) == 1:
              assert it[0] == pt[0]
              return Tree(it[0])

          v_root = pt[-1]

          it_root_index = it.index(v_root)

          it_lhs = it[0:it_root_index]
          pt_lhs = [] if it_root_index == 0 else pt[
              0:len(it_lhs)
          ]

          it_rhs = it[it_root_index+1:]

          pt_rhs_start = 0 if len(pt_lhs) == 0 else len(pt_lhs)
          pt_rhs = [] if it_root_index == len(it)-1 else pt[
              pt_rhs_start:pt.index(v_root)
          ]

          return Tree(
              value=v_root,
              lhs=reconstruct(it_lhs, pt_lhs),
              rhs=reconstruct(it_rhs, pt_rhs),
          )
    #+END_SRC

    #+BEGIN_SRC python :results value :session
      all([
          teq(reconstruct("A", "A"), Tree("A")),
          teq(reconstruct("213", "231"),
              Tree("1", lhs=Tree("2"), rhs=Tree("3"))),
          teq(reconstruct("acbd", "abcd"),
              Tree("d", lhs=Tree("c", lhs=Tree("a"), rhs=Tree("b")))),
          teq(reconstruct("dacb", "abcd"),
              Tree("d", rhs=Tree("c", lhs=Tree("a"), rhs=Tree("b")))),
      ])
    #+END_SRC

    #+RESULTS:
    : True

    This implementation, given that it needs to perform an index-search on the
    unordered lists effectively for every element of the list, is O(n^2) with
    respect to the number of elements in the tree. 

**** Corollary

     What about in-order and pre-order?

*** TODO Implement an inorder traversal with O(1) space                     :C3:

    The direct implementation of an inorder traversal using recursion has O(h)
    space complexity, where h is the height of the tree. Recursion can be
    removed with an explicit stack, but the space complexity remains O(n).

    Write a nonrecursive program for computing the inorder traversal sequence
    for a binary tree. Assume nodes have parent fields.

    /Hint/: How can you tell whether a node is a left child or right child of
    its parent?

