index.html

<div id="outline-container-org63c12d4" class="outline-5">
<h5 id="org63c12d4"><span class="section-number-5">2.6.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-6-3-1">
<p>
We note that trees  T<sub>1</sub> and T<sub>2</sub> are symmetric if their root values are equal
and T<sub>1</sub>&rsquo;s left child equals T<sub>2</sub>&rsquo;s right child and vice-versa.
</p>

<p>
We recursively check the input tree. The input root level is a special case
where we simply check children equality. We then begin recursive
&ldquo;mirroring&rdquo; comparison on the two child trees. &ldquo;Mirroring&rdquo; comparison
consists of first checking that the left-right and right-left child value
equalities are satisfied and then performing recursive mirroring comparison
on the left-right and right-left pairs.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">Tree</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v, l=none, r=none):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.l = l
        <span style="color: #81A1C1;">self</span>.r = r
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">is_sym</span>(T):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">is_mirror</span>(T1, T2):
        <span style="color: #81A1C1;">return</span> ((T1 <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> T2 <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span>)
                <span style="color: #81A1C1;">or</span> (T1.v == T2.v
                    <span style="color: #81A1C1;">and</span> is_mirror(T1.l, T2.r)
                    <span style="color: #81A1C1;">and</span> is_mirror(T1.r, T2.l)))
    <span style="color: #81A1C1;">return</span> T <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">or</span> is_mirror(T.l, T.r)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    is_sym(<span style="color: #81A1C1;">None</span>),
    is_sym(Tree(v=1, l=Tree(v=2), r=Tree(v=2))),
    is_sym(Tree(
        v=1,
        l=Tree(v=2, l=Tree(v=3, l=Tree(v=10)), r=Tree(v=4)),
        r=Tree(v=2, l=Tree(v=4), r=Tree(v=3, r=Tree(v=10))),
    )),
    <span style="color: #81A1C1;">not</span> is_sym(Tree(v=1, l=Tree(v=2), r=Tree(v=3))),
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>


<div id="outline-container-org31905a6" class="outline-4">
<h4 id="org31905a6"><span class="section-number-4">2.6.4</span> <span class="done DONE">DONE</span> Reconstruct a binary tree from traversal data</h4>
<div class="outline-text-4" id="text-2-6-4">
<blockquote>
<p>
Given an inorder traversal sequence and a postorder traversal sequence of a
binary tree write a program to reconstruct the tree. Assume each node has a
unique key.
</p>

<p>
<i>Hint</i>: Focus on the root.
</p>
</blockquote>

<p>
The key insight here is that, for any input in-order traversal <code>it</code> and any
input post-order traversal <code>pt</code>, we have the following invariants:
</p>

<ul class="org-ul">
<li><code>it</code> and <code>pt</code> are equal in length;</li>
<li>The last element of <code>pt</code> corresponds to the &ldquo;root&rdquo; of the given tree.</li>
</ul>


<p>
Furthermore, we observe that <code>it</code> and <code>pt</code> are each laid out as follows:
</p>

<div class="VERBATIM">
<p>
it [&lt;-&#x2014;LHS-&#x2014;&gt;&lt;ROOT&gt;&lt;-&#x2014;RHS-&#x2014;&gt;]
pt [&lt;-&#x2014;LHS-&#x2014;&gt;&lt;-&#x2014;RHS-&#x2014;&gt;&lt;ROOT&gt;]
</p>

</div>

<p>
As such, we can use the tail value of <code>pt</code> during every iteration to
&ldquo;bisect&rdquo; the in-order traversal list, giving us the number of elements in
both the left branch and the right branch. Using these quantities, we can
extract the corresponding sub-lists out of the top-level post-order
traversal, giving us everything that we need for a recursive
implementation.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">teq</span>(lhs, rhs):
    <span style="color: #81A1C1;">return</span> (lhs <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> rhs <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span>) \
        <span style="color: #81A1C1;">or</span> (lhs.value == rhs.value
            <span style="color: #81A1C1;">and</span> teq(lhs.lhs, rhs.lhs)
            <span style="color: #81A1C1;">and</span> teq(lhs.rhs, rhs.rhs))


<span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">Tree</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, value, lhs=<span style="color: #81A1C1;">None</span>, rhs=<span style="color: #81A1C1;">None</span>):
        <span style="color: #81A1C1;">self</span>.value = value
        <span style="color: #81A1C1;">self</span>.lhs = lhs
        <span style="color: #81A1C1;">self</span>.rhs = rhs


<span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">reconstruct</span>(it, pt):
    <span style="color: #81A1C1;">assert</span> <span style="color: #81A1C1;">len</span>(it) == <span style="color: #81A1C1;">len</span>(pt)
    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> it <span style="color: #81A1C1;">and</span> <span style="color: #81A1C1;">not</span> pt:
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">None</span>

    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">len</span>(it) == 1 <span style="color: #81A1C1;">and</span> <span style="color: #81A1C1;">len</span>(pt) == 1:
        <span style="color: #81A1C1;">assert</span> it[0] == pt[0]
        <span style="color: #81A1C1;">return</span> Tree(it[0])

    <span style="color: #D8DEE9;">v_root</span> = pt[-1]

    <span style="color: #D8DEE9;">it_root_index</span> = it.index(v_root)

    <span style="color: #D8DEE9;">it_lhs</span> = it[0:it_root_index]
    <span style="color: #D8DEE9;">pt_lhs</span> = [] <span style="color: #81A1C1;">if</span> it_root_index == 0 <span style="color: #81A1C1;">else</span> pt[
        0:<span style="color: #81A1C1;">len</span>(it_lhs)
    ]

    <span style="color: #D8DEE9;">it_rhs</span> = it[it_root_index+1:]

    <span style="color: #D8DEE9;">pt_rhs_start</span> = 0 <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">len</span>(pt_lhs) == 0 <span style="color: #81A1C1;">else</span> <span style="color: #81A1C1;">len</span>(pt_lhs)
    <span style="color: #D8DEE9;">pt_rhs</span> = [] <span style="color: #81A1C1;">if</span> it_root_index == <span style="color: #81A1C1;">len</span>(it)-1 <span style="color: #81A1C1;">else</span> pt[
        pt_rhs_start:pt.index(v_root)
    ]

    <span style="color: #81A1C1;">return</span> Tree(
        value=v_root,
        lhs=reconstruct(it_lhs, pt_lhs),
        rhs=reconstruct(it_rhs, pt_rhs),
    )
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    teq(reconstruct(<span style="color: #A3BE8C;">"A"</span>, <span style="color: #A3BE8C;">"A"</span>), Tree(<span style="color: #A3BE8C;">"A"</span>)),
    teq(reconstruct(<span style="color: #A3BE8C;">"213"</span>, <span style="color: #A3BE8C;">"231"</span>),
        Tree(<span style="color: #A3BE8C;">"1"</span>, lhs=Tree(<span style="color: #A3BE8C;">"2"</span>), rhs=Tree(<span style="color: #A3BE8C;">"3"</span>))),
    teq(reconstruct(<span style="color: #A3BE8C;">"acbd"</span>, <span style="color: #A3BE8C;">"abcd"</span>),
        Tree(<span style="color: #A3BE8C;">"d"</span>, lhs=Tree(<span style="color: #A3BE8C;">"c"</span>, lhs=Tree(<span style="color: #A3BE8C;">"a"</span>), rhs=Tree(<span style="color: #A3BE8C;">"b"</span>)))),
    teq(reconstruct(<span style="color: #A3BE8C;">"dacb"</span>, <span style="color: #A3BE8C;">"abcd"</span>),
        Tree(<span style="color: #A3BE8C;">"d"</span>, rhs=Tree(<span style="color: #A3BE8C;">"c"</span>, lhs=Tree(<span style="color: #A3BE8C;">"a"</span>), rhs=Tree(<span style="color: #A3BE8C;">"b"</span>)))),
])
</pre>
</div>

<pre class="example">
True
</pre>


<p>
This implementation, given that it needs to perform an index-search on the
unordered lists effectively for every element of the list, is O(n<sup>2</sup>) with
respect to the number of elements in the tree. 
</p>
</div>

<div id="outline-container-org2419e05" class="outline-5">
<h5 id="org2419e05"><span class="section-number-5">2.6.4.1</span> Corollary</h5>
<div class="outline-text-5" id="text-2-6-4-1">
<p>
What about in-order and pre-order?
</p>
</div>
</div>
</div>

<div id="outline-container-org2fe8f51" class="outline-4">
<h4 id="org2fe8f51"><span class="section-number-4">2.6.5</span> <span class="todo TODO">TODO</span> Implement an inorder traversal with O(1) space</h4>
<div class="outline-text-4" id="text-2-6-5">
<p>
The direct implementation of an inorder traversal using recursion has O(h)
space complexity, where h is the height of the tree. Recursion can be
removed with an explicit stack, but the space complexity remains O(n).
</p>

<p>
Write a nonrecursive program for computing the inorder traversal sequence
for a binary tree. Assume nodes have parent fields.
</p>

<p>
<i>Hint</i>: How can you tell whether a node is a left child or right child of
its parent?
</p>
</div>
</div>
