README.org
*** LOOKED-UP Reconstruct a binary tree from a preorder traversal with markers :C4:
    CLOSED: [2018-04-30 Mon 18:51]

    #+BEGIN_QUOTE
    Design an algorithm for reconstructing a binary tree from a preorder
    traversal visit sequence that uses =null= to mark empty children.

    /Hint/: It's difficult to solve this problem by examining the preorder
    traversal visit sequence from left-to-right.
    #+END_QUOTE
    
    #+BEGIN_SRC python 
      def teq(lhs, rhs):
          return (lhs is None and rhs is None) \
              or (lhs.v == rhs.v
                  and teq(lhs.l, rhs.l)
                  and teq(lhs.r, rhs.r))


      class Tree():
          def __init__(self, v, l=None, r=None):
              self.v = v
              self.l = l
              self.r = r


      def from_pre(pre):
          idx = {'idx': 0}

          def _from_pre(pre):
              v = pre[idx['idx']]
              if not v:
                  return None
              idx['idx'] += 1
              l = _from_pre(pre)
              idx['idx'] += 1
              r = _from_pre(pre)
              return Tree(v, l=l, r=r)

          return _from_pre(pre)


      def test():
          assert teq(from_pre([1, 2, None, None, 3, None, None]),
                     Tree(1, l=Tree(2), r=Tree(3)))
    #+END_SRC

*** TODO Compute the right sibling tree                                     :C4:

    Assume each binary tree node has an extra field, call it level-next, that
    holds a binary tree node (this field is distinct from the fields for the
    left and right children). The level-next field will be used to compute a map
    from nodes to their right siblings. The input is assumed to be perfect
    binary tree.

    Write a program that takes a perfect binary tree, and sets each node's
    level-next field to the node on its right, if one exists.

    /Hint/: Think of an appropriate traversal order.

** Heaps

*** TODO Merge sorted files                                                 :C0:

*** TODO Compute the k closest stars                                        :C1:
** Searching

*** DONE Search a sorted array for first occurrence of =k=                  :C0:
    CLOSED: [2017-07-10 Mon 12:26]

    Binary search commonly asks for the index of /any/ element of a sorted array
    that is equal to a specified element. The following problem has a slight
    twist on this.

    Write a method that takes a sorted array and a key and returns the index of
    the /first/ occurrence of the key in the array.

**** Solution

     A brute-force solution would be to iterate through the array A in its
     entirety, from start to end, until key k is found. This solution would be
     O(n), which isn't terrible but would fail to take advantage of the fact
     that A is sorted.

     To improve, we employ binary search, returning the identity of the first
     occurrence of k if k \in A and null otherwise. To account for relative
     indices in recursion, we pass in an "offset" that the returned index is
     then modulated by.

     #+BEGIN_SRC python :results silent :session
       def first_occurrence(A, k):
           import math
           def fo(A, k, offset):
               if A == []:
                   return None
               if len(A) == 1:
                   return offset if A[0]==k else None
               i_mid = int(math.floor(len(A) / 2))
               if A[i_mid] >= k:
                   i = fo(A[:i_mid], k, offset=0)
                   return offset+i_mid if not i else i
               else:
                   return fo(A[i_mid+1:], k, offset=i_mid+1)
           return fo(A,k,0)
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           first_occurrence([1,2,3], 3) == 2,
           first_occurrence([1,2,2,2,3], 2) == 1,
           first_occurrence([1,2,3,4,5], 6) == None,
       ])
     #+END_SRC

     #+RESULTS:
     : True

     
*** TODO Compute the integer square root                                    :C1:

*** TODO Find the k-th largest element                                      :C1:

** Hash Tables

*** DONE Partition into anagrams                                            :C0:
    CLOSED: [2017-06-26 Mon 22:19]

    Write a program that takes as input a set of words and returns groups of
    anagrams for those words. Each group must contain at least two words.

