index.html

<div id="outline-container-org42c30d5" class="outline-4">
<h4 id="org42c30d5"><span class="section-number-4">2.6.6</span> <span class="done LOOKED_UP">LOOKED-UP</span> Reconstruct a binary tree from a preorder traversal with markers</h4>
<div class="outline-text-4" id="text-2-6-6">
<blockquote>
<p>
Design an algorithm for reconstructing a binary tree from a preorder
traversal visit sequence that uses <code>null</code> to mark empty children.
</p>

<p>
<i>Hint</i>: It&rsquo;s difficult to solve this problem by examining the preorder
traversal visit sequence from left-to-right.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">teq</span>(lhs, rhs):
    <span style="color: #81A1C1;">return</span> (lhs <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">and</span> rhs <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span>) \
        <span style="color: #81A1C1;">or</span> (lhs.v == rhs.v
            <span style="color: #81A1C1;">and</span> teq(lhs.l, rhs.l)
            <span style="color: #81A1C1;">and</span> teq(lhs.r, rhs.r))


<span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">Tree</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v, l=<span style="color: #81A1C1;">None</span>, r=<span style="color: #81A1C1;">None</span>):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.l = l
        <span style="color: #81A1C1;">self</span>.r = r


<span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">from_pre</span>(pre):
    <span style="color: #D8DEE9;">idx</span> = {<span style="color: #A3BE8C;">'idx'</span>: 0}

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_from_pre</span>(pre):
        <span style="color: #D8DEE9;">v</span> = pre[idx[<span style="color: #A3BE8C;">'idx'</span>]]
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> v:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">None</span>
        <span style="color: #D8DEE9;">idx</span>[<span style="color: #A3BE8C;">'idx'</span>] += 1
        <span style="color: #D8DEE9;">l</span> = _from_pre(pre)
        <span style="color: #D8DEE9;">idx</span>[<span style="color: #A3BE8C;">'idx'</span>] += 1
        <span style="color: #D8DEE9;">r</span> = _from_pre(pre)
        <span style="color: #81A1C1;">return</span> Tree(v, l=l, r=r)

    <span style="color: #81A1C1;">return</span> _from_pre(pre)


<span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">test</span>():
    <span style="color: #81A1C1;">assert</span> teq(from_pre([1, 2, <span style="color: #81A1C1;">None</span>, <span style="color: #81A1C1;">None</span>, 3, <span style="color: #81A1C1;">None</span>, <span style="color: #81A1C1;">None</span>]),
               Tree(1, l=Tree(2), r=Tree(3)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org84d13fe" class="outline-4">
<h4 id="org84d13fe"><span class="section-number-4">2.6.7</span> <span class="todo TODO">TODO</span> Compute the right sibling tree</h4>
<div class="outline-text-4" id="text-2-6-7">
<p>
Assume each binary tree node has an extra field, call it level-next, that
holds a binary tree node (this field is distinct from the fields for the
left and right children). The level-next field will be used to compute a map
from nodes to their right siblings. The input is assumed to be perfect
binary tree.
</p>

<p>
Write a program that takes a perfect binary tree, and sets each node&rsquo;s
level-next field to the node on its right, if one exists.
</p>

<p>
<i>Hint</i>: Think of an appropriate traversal order.
</p>
</div>
</div>
</div>

<div id="outline-container-org609726b" class="outline-3">
<h3 id="org609726b"><span class="section-number-3">2.7</span> Heaps</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org1c79809" class="outline-4">
<h4 id="org1c79809"><span class="section-number-4">2.7.1</span> <span class="todo TODO">TODO</span> Merge sorted files</h4>
</div>

<div id="outline-container-org1bd04a1" class="outline-4">
<h4 id="org1bd04a1"><span class="section-number-4">2.7.2</span> <span class="todo TODO">TODO</span> Compute the k closest stars</h4>
</div>
</div>
<div id="outline-container-orgc7d9a76" class="outline-3">
<h3 id="orgc7d9a76"><span class="section-number-3">2.8</span> Searching</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-orgfc7d1a7" class="outline-4">
<h4 id="orgfc7d1a7"><span class="section-number-4">2.8.1</span> <span class="done DONE">DONE</span> Search a sorted array for first occurrence of <code>k</code></h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
Binary search commonly asks for the index of <i>any</i> element of a sorted array
that is equal to a specified element. The following problem has a slight
twist on this.
</p>

<p>
Write a method that takes a sorted array and a key and returns the index of
the <i>first</i> occurrence of the key in the array.
</p>
</div>

<div id="outline-container-org24aa0bc" class="outline-5">
<h5 id="org24aa0bc"><span class="section-number-5">2.8.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-8-1-1">
<p>
A brute-force solution would be to iterate through the array A in its
entirety, from start to end, until key k is found. This solution would be
O(n), which isn&rsquo;t terrible but would fail to take advantage of the fact
that A is sorted.
</p>

<p>
To improve, we employ binary search, returning the identity of the first
occurrence of k if k &isin; A and null otherwise. To account for relative
indices in recursion, we pass in an &ldquo;offset&rdquo; that the returned index is
then modulated by.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">first_occurrence</span>(A, k):
    <span style="color: #81A1C1;">import</span> math
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">fo</span>(A, k, offset):
        <span style="color: #81A1C1;">if</span> A == []:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">None</span>
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">len</span>(A) == 1:
            <span style="color: #81A1C1;">return</span> offset <span style="color: #81A1C1;">if</span> A[0]==k <span style="color: #81A1C1;">else</span> <span style="color: #81A1C1;">None</span>
        <span style="color: #D8DEE9;">i_mid</span> = <span style="color: #81A1C1;">int</span>(math.floor(<span style="color: #81A1C1;">len</span>(A) / 2))
        <span style="color: #81A1C1;">if</span> A[i_mid] &gt;= k:
            <span style="color: #D8DEE9;">i</span> = fo(A[:i_mid], k, offset=0)
            <span style="color: #81A1C1;">return</span> offset+i_mid <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> i <span style="color: #81A1C1;">else</span> i
        <span style="color: #81A1C1;">else</span>:
            <span style="color: #81A1C1;">return</span> fo(A[i_mid+1:], k, offset=i_mid+1)
    <span style="color: #81A1C1;">return</span> fo(A,k,0)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    first_occurrence([1,2,3], 3) == 2,
    first_occurrence([1,2,2,2,3], 2) == 1,
    first_occurrence([1,2,3,4,5], 6) == <span style="color: #81A1C1;">None</span>,
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>


<div id="outline-container-orge2a42f5" class="outline-4">
<h4 id="orge2a42f5"><span class="section-number-4">2.8.2</span> <span class="todo TODO">TODO</span> Compute the integer square root</h4>
</div>

<div id="outline-container-orge5fe20a" class="outline-4">
<h4 id="orge5fe20a"><span class="section-number-4">2.8.3</span> <span class="todo TODO">TODO</span> Find the k-th largest element</h4>
</div>
</div>

<div id="outline-container-org1da1935" class="outline-3">
<h3 id="org1da1935"><span class="section-number-3">2.9</span> Hash Tables</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-orgd497b4a" class="outline-4">
<h4 id="orgd497b4a"><span class="section-number-4">2.9.1</span> <span class="done DONE">DONE</span> Partition into anagrams</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
Write a program that takes as input a set of words and returns groups of
anagrams for those words. Each group must contain at least two words.
</p>
</div>
