README.org
**** Solution

     We can implement solution that avoids the need to compare all pairs of
     strings by hashing each string to its sorted version. Strings whose sorted
     forms are equal are anagrams. This implementation uses n calls to sort for
     O(n m log m), where n is the number of strings and m is the length of the
     max string.

     #+BEGIN_SRC python :results silent :session
       def get_anagram_clusters(S):
           cs = {}
           for s in S:
               k = ''.join(sorted(s))
               if k not in cs:
                   cs[k] = set()
               cs[k].add(s)
           return [v for _,v in cs.iteritems()]

     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           s in get_anagram_clusters([
               "debitcard",
               "elvis",
               "silent",
               "badcredit",
               "lives",
               "freedom",
               "listen",
               "levis",
               "money",
           ]) for s in [
               set(["debitcard", "badcredit"]),
               set(["elvis", "lives", "levis"]),
               set(["silent", "listen"]),
           ]
       ])
     #+END_SRC

     #+RESULTS:
     : True

*** DONE Test for palindromic permutations
    CLOSED: [2017-06-25 Sun 00:14]

    Write a program to test whether the letters forming a string can be permuted
    to form a palindrome. For instance, "edified" can be permuted to form
    "deified".

**** Solution

     We assume that there is no requirement that the resulting palindrome be a
     word in the English language.

     We note that, in the case of even-length strings, we require the count of
     each letter to be evenly divisible by two. We additionally note that, in
     the case of odd-length strings, there is one and only one letter with count
     of one.

     This implementation is O(n) in time and space.

     #+BEGIN_SRC python :results silent :session
       def can_palindrome(s):
           lcs = {}
           for c in s:
               if c not in lcs:
                   lcs[c] = 0
               lcs[c] += 1
           if len(s) % 2 == 0:
               return all(v % 2 == 0 for k,v in lcs.iteritems())
           else:
               is_pivot_found = False
               for k,v in lcs.iteritems():
                   if v == 1:
                       if is_pivot_found:
                           return False
                       else:
                           is_pivot_found = True
                           continue
                   elif v % 2 != 0:
                       return False
               return True
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           can_palindrome("racecar"),
           can_palindrome("rraacce"),
           not can_palindrome("foobar"),
       ])
     #+END_SRC

     #+RESULTS:
     : True

*** DONE Is an anonymous letter constructible?                              :C1:
    CLOSED: [2017-06-23 Fri 12:41]

    Write a program which takes text for an anonymous letter and text for a
    magazine and determines if it is possible to write the anonymous letter
    using the magazine. The letter can be written using the magazine if for each
    character in the letter, the number of times it appears in the anonymous
    letter is no more than the number of times it appears in the magazine.

**** Solution

     We implement a solution that reduces the letter and the magazine into
     dictionaries. We then check that the magazine dictionary contains all of
     the letter dictionary's keys and, for each of those keys, that it maps to a
     count greater than or equal to that contained in the letter dictionary.

     This solution is in time O(n) with respect to the cumulative length of the
     letter and magazine. Space is, similarly, O(n).

     For the sake of simplicity, we assume that inputs do not contain
     spaces. Accounting for spaces is trivial and would simply involve splitting
     each input on whitespace characters and iterating across sub-lists.

     #+BEGIN_SRC python :results output :session
       def is_possible(l, m):
           def to_dict(s):
               out = {}
               for c in s:
                   if c not in out:
                       out[c] = 0
                   out[c] += 1
               return out

           dl = to_dict(l)
           dm = to_dict(m)

           for k,v in dl.iteritems():
               if k not in dm or dm[k] < v:
                   return False

           return True
     #+END_SRC

*** TODO Implement an ISBN cache                                            :C1:

** Sorting

*** DONE Compute the intersection of two sorted arrays                      :C0:
    CLOSED: [2017-06-23 Fri 15:24]

    Write a program which takes as input two sorted arrays, and returns a new
    array containing elements that are present in both of the input arrays. The
    input arrays may have duplicate entries, but the returned array should be
    free of duplicates. For example, if the input is =<2,3,3,5,5,6,7,7,8,12>=
    and =<5,5,6,8,8,9,10,10>=, your output should be =<5,6,8>=.

