index.html

<div id="outline-container-orgeb749b2" class="outline-5">
<h5 id="orgeb749b2"><span class="section-number-5">2.9.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-9-1-1">
<p>
We can implement solution that avoids the need to compare all pairs of
strings by hashing each string to its sorted version. Strings whose sorted
forms are equal are anagrams. This implementation uses n calls to sort for
O(n m log m), where n is the number of strings and m is the length of the
max string.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">get_anagram_clusters</span>(S):
    <span style="color: #D8DEE9;">cs</span> = {}
    <span style="color: #81A1C1;">for</span> s <span style="color: #81A1C1;">in</span> S:
        <span style="color: #D8DEE9;">k</span> = <span style="color: #A3BE8C;">''</span>.join(<span style="color: #81A1C1;">sorted</span>(s))
        <span style="color: #81A1C1;">if</span> k <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">in</span> cs:
            <span style="color: #D8DEE9;">cs</span>[k] = <span style="color: #81A1C1;">set</span>()
        cs[k].add(s)
    <span style="color: #81A1C1;">return</span> [v <span style="color: #81A1C1;">for</span> _,v <span style="color: #81A1C1;">in</span> cs.iteritems()]

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    s <span style="color: #81A1C1;">in</span> get_anagram_clusters([
        <span style="color: #A3BE8C;">"debitcard"</span>,
        <span style="color: #A3BE8C;">"elvis"</span>,
        <span style="color: #A3BE8C;">"silent"</span>,
        <span style="color: #A3BE8C;">"badcredit"</span>,
        <span style="color: #A3BE8C;">"lives"</span>,
        <span style="color: #A3BE8C;">"freedom"</span>,
        <span style="color: #A3BE8C;">"listen"</span>,
        <span style="color: #A3BE8C;">"levis"</span>,
        <span style="color: #A3BE8C;">"money"</span>,
    ]) <span style="color: #81A1C1;">for</span> s <span style="color: #81A1C1;">in</span> [
        <span style="color: #81A1C1;">set</span>([<span style="color: #A3BE8C;">"debitcard"</span>, <span style="color: #A3BE8C;">"badcredit"</span>]),
        <span style="color: #81A1C1;">set</span>([<span style="color: #A3BE8C;">"elvis"</span>, <span style="color: #A3BE8C;">"lives"</span>, <span style="color: #A3BE8C;">"levis"</span>]),
        <span style="color: #81A1C1;">set</span>([<span style="color: #A3BE8C;">"silent"</span>, <span style="color: #A3BE8C;">"listen"</span>]),
    ]
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb566af4" class="outline-4">
<h4 id="orgb566af4"><span class="section-number-4">2.9.2</span> <span class="done DONE">DONE</span> Test for palindromic permutations</h4>
<div class="outline-text-4" id="text-2-9-2">
<p>
Write a program to test whether the letters forming a string can be permuted
to form a palindrome. For instance, &ldquo;edified&rdquo; can be permuted to form
&ldquo;deified&rdquo;.
</p>
</div>

<div id="outline-container-orge53f971" class="outline-5">
<h5 id="orge53f971"><span class="section-number-5">2.9.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-9-2-1">
<p>
We assume that there is no requirement that the resulting palindrome be a
word in the English language.
</p>

<p>
We note that, in the case of even-length strings, we require the count of
each letter to be evenly divisible by two. We additionally note that, in
the case of odd-length strings, there is one and only one letter with count
of one.
</p>

<p>
This implementation is O(n) in time and space.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">can_palindrome</span>(s):
    <span style="color: #D8DEE9;">lcs</span> = {}
    <span style="color: #81A1C1;">for</span> c <span style="color: #81A1C1;">in</span> s:
        <span style="color: #81A1C1;">if</span> c <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">in</span> lcs:
            <span style="color: #D8DEE9;">lcs</span>[c] = 0
        <span style="color: #D8DEE9;">lcs</span>[c] += 1
    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">len</span>(s) % 2 == 0:
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">all</span>(v % 2 == 0 <span style="color: #81A1C1;">for</span> k,v <span style="color: #81A1C1;">in</span> lcs.iteritems())
    <span style="color: #81A1C1;">else</span>:
        <span style="color: #D8DEE9;">is_pivot_found</span> = <span style="color: #81A1C1;">False</span>
        <span style="color: #81A1C1;">for</span> k,v <span style="color: #81A1C1;">in</span> lcs.iteritems():
            <span style="color: #81A1C1;">if</span> v == 1:
                <span style="color: #81A1C1;">if</span> is_pivot_found:
                    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
                <span style="color: #81A1C1;">else</span>:
                    <span style="color: #D8DEE9;">is_pivot_found</span> = <span style="color: #81A1C1;">True</span>
                    <span style="color: #81A1C1;">continue</span>
            <span style="color: #81A1C1;">elif</span> v % 2 != 0:
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    can_palindrome(<span style="color: #A3BE8C;">"racecar"</span>),
    can_palindrome(<span style="color: #A3BE8C;">"rraacce"</span>),
    <span style="color: #81A1C1;">not</span> can_palindrome(<span style="color: #A3BE8C;">"foobar"</span>),
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-org14b6c7b" class="outline-4">
<h4 id="org14b6c7b"><span class="section-number-4">2.9.3</span> <span class="done DONE">DONE</span> Is an anonymous letter constructible?</h4>
<div class="outline-text-4" id="text-2-9-3">
<p>
Write a program which takes text for an anonymous letter and text for a
magazine and determines if it is possible to write the anonymous letter
using the magazine. The letter can be written using the magazine if for each
character in the letter, the number of times it appears in the anonymous
letter is no more than the number of times it appears in the magazine.
</p>
</div>

<div id="outline-container-orgd620f76" class="outline-5">
<h5 id="orgd620f76"><span class="section-number-5">2.9.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-9-3-1">
<p>
We implement a solution that reduces the letter and the magazine into
dictionaries. We then check that the magazine dictionary contains all of
the letter dictionary&rsquo;s keys and, for each of those keys, that it maps to a
count greater than or equal to that contained in the letter dictionary.
</p>

<p>
This solution is in time O(n) with respect to the cumulative length of the
letter and magazine. Space is, similarly, O(n).
</p>

<p>
For the sake of simplicity, we assume that inputs do not contain
spaces. Accounting for spaces is trivial and would simply involve splitting
each input on whitespace characters and iterating across sub-lists.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">is_possible</span>(l, m):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">to_dict</span>(s):
        <span style="color: #D8DEE9;">out</span> = {}
        <span style="color: #81A1C1;">for</span> c <span style="color: #81A1C1;">in</span> s:
            <span style="color: #81A1C1;">if</span> c <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">in</span> out:
                <span style="color: #D8DEE9;">out</span>[c] = 0
            <span style="color: #D8DEE9;">out</span>[c] += 1
        <span style="color: #81A1C1;">return</span> out

    <span style="color: #D8DEE9;">dl</span> = to_dict(l)
    <span style="color: #D8DEE9;">dm</span> = to_dict(m)

    <span style="color: #81A1C1;">for</span> k,v <span style="color: #81A1C1;">in</span> dl.iteritems():
        <span style="color: #81A1C1;">if</span> k <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">in</span> dm <span style="color: #81A1C1;">or</span> dm[k] &lt; v:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>

    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org25f8e2a" class="outline-4">
<h4 id="org25f8e2a"><span class="section-number-4">2.9.4</span> <span class="todo TODO">TODO</span> Implement an ISBN cache</h4>
</div>
</div>

<div id="outline-container-orgcc387a3" class="outline-3">
<h3 id="orgcc387a3"><span class="section-number-3">2.10</span> Sorting</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-orgc0d8169" class="outline-4">
<h4 id="orgc0d8169"><span class="section-number-4">2.10.1</span> <span class="done DONE">DONE</span> Compute the intersection of two sorted arrays</h4>
<div class="outline-text-4" id="text-2-10-1">
<p>
Write a program which takes as input two sorted arrays, and returns a new
array containing elements that are present in both of the input arrays. The
input arrays may have duplicate entries, but the returned array should be
free of duplicates. For example, if the input is <code>&lt;2,3,3,5,5,6,7,7,8,12&gt;</code>
and <code>&lt;5,5,6,8,8,9,10,10&gt;</code>, your output should be <code>&lt;5,6,8&gt;</code>.
</p>
</div>
