README.org
**** Solution

     #+BEGIN_SRC python :results output :session
       def intersection(A,B):
           if not A or not B:
               return []
           out = []
           lower,upper = A, B
           while lower and upper:
               lower = lower if lower[0] < upper[0] else upper
               upper = upper if lower[0] < upper[0] else lower
               while lower and lower[0] != upper[0]:
                   lower = lower[1:]
               if not lower or not upper:
                   break
               item = lower[0]
               out.append(item)
               while lower and lower[0] == item:
                   lower = lower[1:]
               while upper and upper[0] == item:
                   upper = upper[1:]
           return out
     #+END_SRC

     #+RESULTS:

     #+BEGIN_SRC python :results value :session
       all([
           intersection([],[]) == [],
           intersection([],[1,2,3]) == [],
           intersection([1,2,3],[]) == [],
           intersection(
               [1,2,3,4,5],
               [4,4,5,6,7],
           ) == [4,5,6,7],
           intersection(
               [1,2,3],
               [4,5,6],
           ) == [],
       ])  
     #+END_SRC

     #+RESULTS:
     : True

     This implementation is linear on its inputs.

*** TODO Implement mergesort in-place                                       :C1:

    Write a program which takes as input two sorted arrays of integers, and
    updates the first to the combined entries of the two arrays in sorted
    order. Assume the first array has enough empty entries at its end to hold
    the result.

    /Hint/: Avoid repeatedly moving entries.

*** DONE Count the frequencies of characters in a sentence                  :C2:
    CLOSED: [2017-06-28 Wed 15:32]

    Given a string, print in alphabetical order each character that appears in
    the string, and the number of times that it appears. For example, if the
    string is "bcdacebe", output =(a,1), (b,2), (c,2), (d,1), (e,2)=.

    /Hint/: Exploit the fact that the keys are drawn from a small set.

**** Solution

     We assume that the input string consists solely of lowercase alphabetic
     characters. However, the solution is generalizeable.

     We point out that the character domain is finite -- specifically, of
     size 26. As such, we use an array of size 26, with index representing
     character, with "0" corresponding to "a" etc., to record the number of
     times the corresponding letter appears in the input string. It is then
     trivial to output the array values in alphabetical order.

     Both the record-keeping operation and the output operation are linear. The
     overall solution is linear in time and constant in space.

     #+BEGIN_SRC python :results silent :session
       def freqs(S):
           counts = [0] * 26
           for c in S:
               counts[ord(c) - ord("a")] += 1
           for i in range(len(counts)):
               if counts[i] > 0:
                   yield (chr(ord("a")+i), counts[i])
     #+END_SRC

     #+BEGIN_SRC python :results value :session
     list(freqs("bcdacebe")) == [("a",1),("b",2),("c",2),("d",1), ("e",2)]
     #+END_SRC

     #+RESULTS:
     : True

*** DONE Render a calendar                                                  :C2:
    CLOSED: [2017-06-28 Wed 18:20]

    Write a program that takes a set of events, and determines the maximum
    number of events that can take place concurrently.

