index.html

<div id="outline-container-org50b243f" class="outline-5">
<h5 id="org50b243f"><span class="section-number-5">2.10.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-10-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">intersection</span>(A,B):
    <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> A <span style="color: #81A1C1;">or</span> <span style="color: #81A1C1;">not</span> B:
        <span style="color: #81A1C1;">return</span> []
    <span style="color: #D8DEE9;">out</span> = []
    <span style="color: #D8DEE9;">lower</span>,<span style="color: #D8DEE9;">upper</span> = A, B
    <span style="color: #81A1C1;">while</span> lower <span style="color: #81A1C1;">and</span> upper:
        <span style="color: #D8DEE9;">lower</span> = lower <span style="color: #81A1C1;">if</span> lower[0] &lt; upper[0] <span style="color: #81A1C1;">else</span> upper
        <span style="color: #D8DEE9;">upper</span> = upper <span style="color: #81A1C1;">if</span> lower[0] &lt; upper[0] <span style="color: #81A1C1;">else</span> lower
        <span style="color: #81A1C1;">while</span> lower <span style="color: #81A1C1;">and</span> lower[0] != upper[0]:
            <span style="color: #D8DEE9;">lower</span> = lower[1:]
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> lower <span style="color: #81A1C1;">or</span> <span style="color: #81A1C1;">not</span> upper:
            <span style="color: #81A1C1;">break</span>
        <span style="color: #D8DEE9;">item</span> = lower[0]
        out.append(item)
        <span style="color: #81A1C1;">while</span> lower <span style="color: #81A1C1;">and</span> lower[0] == item:
            <span style="color: #D8DEE9;">lower</span> = lower[1:]
        <span style="color: #81A1C1;">while</span> upper <span style="color: #81A1C1;">and</span> upper[0] == item:
            <span style="color: #D8DEE9;">upper</span> = upper[1:]
    <span style="color: #81A1C1;">return</span> out
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    intersection([],[]) == [],
    intersection([],[1,2,3]) == [],
    intersection([1,2,3],[]) == [],
    intersection(
        [1,2,3,4,5],
        [4,4,5,6,7],
    ) == [4,5,6,7],
    intersection(
        [1,2,3],
        [4,5,6],
    ) == [],
])  
</pre>
</div>

<pre class="example">
True
</pre>


<p>
This implementation is linear on its inputs.
</p>
</div>
</div>
</div>

<div id="outline-container-org89fb070" class="outline-4">
<h4 id="org89fb070"><span class="section-number-4">2.10.2</span> <span class="todo TODO">TODO</span> Implement mergesort in-place</h4>
<div class="outline-text-4" id="text-2-10-2">
<p>
Write a program which takes as input two sorted arrays of integers, and
updates the first to the combined entries of the two arrays in sorted
order. Assume the first array has enough empty entries at its end to hold
the result.
</p>

<p>
<i>Hint</i>: Avoid repeatedly moving entries.
</p>
</div>
</div>

<div id="outline-container-org530b1cf" class="outline-4">
<h4 id="org530b1cf"><span class="section-number-4">2.10.3</span> <span class="done DONE">DONE</span> Count the frequencies of characters in a sentence</h4>
<div class="outline-text-4" id="text-2-10-3">
<p>
Given a string, print in alphabetical order each character that appears in
the string, and the number of times that it appears. For example, if the
string is &ldquo;bcdacebe&rdquo;, output <code>(a,1), (b,2), (c,2), (d,1), (e,2)</code>.
</p>

<p>
<i>Hint</i>: Exploit the fact that the keys are drawn from a small set.
</p>
</div>

<div id="outline-container-orge068fe7" class="outline-5">
<h5 id="orge068fe7"><span class="section-number-5">2.10.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-10-3-1">
<p>
We assume that the input string consists solely of lowercase alphabetic
characters. However, the solution is generalizeable.
</p>

<p>
We point out that the character domain is finite &#x2013; specifically, of
size 26. As such, we use an array of size 26, with index representing
character, with &ldquo;0&rdquo; corresponding to &ldquo;a&rdquo; etc., to record the number of
times the corresponding letter appears in the input string. It is then
trivial to output the array values in alphabetical order.
</p>

<p>
Both the record-keeping operation and the output operation are linear. The
overall solution is linear in time and constant in space.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">freqs</span>(S):
    <span style="color: #D8DEE9;">counts</span> = [0] * 26
    <span style="color: #81A1C1;">for</span> c <span style="color: #81A1C1;">in</span> S:
        <span style="color: #D8DEE9;">counts</span>[<span style="color: #81A1C1;">ord</span>(c) - <span style="color: #81A1C1;">ord</span>(<span style="color: #A3BE8C;">"a"</span>)] += 1
    <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(<span style="color: #81A1C1;">len</span>(counts)):
        <span style="color: #81A1C1;">if</span> counts[i] &gt; 0:
            <span style="color: #81A1C1;">yield</span> (<span style="color: #81A1C1;">chr</span>(<span style="color: #81A1C1;">ord</span>(<span style="color: #A3BE8C;">"a"</span>)+i), counts[i])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">list</span>(freqs(<span style="color: #A3BE8C;">"bcdacebe"</span>)) == [(<span style="color: #A3BE8C;">"a"</span>,1),(<span style="color: #A3BE8C;">"b"</span>,2),(<span style="color: #A3BE8C;">"c"</span>,2),(<span style="color: #A3BE8C;">"d"</span>,1), (<span style="color: #A3BE8C;">"e"</span>,2)]
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-org3be4ff6" class="outline-4">
<h4 id="org3be4ff6"><span class="section-number-4">2.10.4</span> <span class="done DONE">DONE</span> Render a calendar</h4>
<div class="outline-text-4" id="text-2-10-4">
<p>
Write a program that takes a set of events, and determines the maximum
number of events that can take place concurrently.
</p>
</div>
