README.org
**** Solution

     We assume that the domain is unbounded -- that is, that any event can occur
     at any given time t.

     We assume that an event E is represented as a tuple (t_{s}, t_{e}), where t_{s} is
     the start time and t_{e} the end time.

     Instead of considering discrete time values, we consider unit
     intervals. For instance, the event (t, t+2) falls into two interval
     "buckets" -- the first representing the interval [t, t+1], and the second
     the interval [t+1, t+2].

     We maintain a counter dictionary, keyed on the start times of these
     intervals, that keeps track of how many events overlap with the key
     interval. For each event E, we split E into its constituent unit intervals
     and populate the counter accordingly. We choose dictionary for the
     following reasons:

     - We assume no bound on the domain of time T, so we choose a data structure
       that doesn't require an explicit initial size for convenience;
     - We make no assumptions about the proximity of the respective events'
       intervals; we can very easily have events (0, 10) and (10000,
       10010). Using an alternative storage construct, such as an array, would
       require us to allocate upwards of 10000 buckets to store information for
       these events, only for all but twenty of those buckets to be meaningless,
       i.e. with value zero. A dictionary, on the other hand, allows us to only
       allocate 20 buckets, for considerably greater space efficiency.


     The resulting solution is O(nl) in time and space, where n is the number of
     events and l is the max length of the event intervals.


     #+BEGIN_SRC python :results silent :session
       def atomize_interval(start, end):
           for s in range(start, end):
               yield (s, s+1)
     #+END_SRC

     #+BEGIN_SRC python :results value :session
     list(atomize_interval(0,5)) == [(0,1), (1,2), (2,3), (3,4), (4,5)]
     #+END_SRC

     #+RESULTS:
     : True

     #+BEGIN_SRC python :results silent :session
       def max_sim(*E):
           time_to_sim = {}
           for e in E:
               for i in atomize_interval(*e):
                   if i[0] not in time_to_sim:
                       time_to_sim[i[0]] = 0
                   time_to_sim[i[0]] += 1
           return time_to_sim[max(time_to_sim, key=(lambda k: time_to_sim[k]))]
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           max_sim((0,10)) == 1,
           max_sim((0,10),(2,11),(3,12)) == 3,

           # non-contiguous events
           max_sim((0,10), (2,11), (100, 110), (101,111), (102,112), (103,113)) == 4,
       ])
     #+END_SRC

     #+RESULTS:
     : True

*** TODO Compute the union of intervals                                     :C3:

*** TODO Implement a fast sorting algorithm for lists                       :C3:

*** TODO Partitioning and sorting an array with many repeated entries       :C4:
** Binary Search Trees

*** DONE Test if a binary tree satisfies the BST property                   :C0:
    CLOSED: [2017-06-23 Fri 12:20]

    Write a program that takes as input a binary tree and checks if the tree
    satisfies the BST property.

**** Solution

     Iterate through each subtree, keeping track of a local maximum and
     minimum. In addition to asserting that the two leaves relate to the node as
     necessary, similarly assert that the two leaves fall within the maximum and
     minimum. When recursing into leaves, update either the maximum or the
     minimum with the current node value depending on which leave is being
     recursed into.

*** DONE Find the first key larger than a given value in a BST              :C1:
    CLOSED: [2017-07-01 Sat 22:43]

    Write a program that takes as input a BST and a value, and returns the first
    key that would appear in an inorder traversal which is greater than the
    input value.

    /Hint/: Perform binary search, keeping some additional state.
    
**** Solution

     Given BST T and value v, perform binary search, keeping track of the
     current "minimum greater-than" value v_{gt}, which we can initialize to +\infin. On
     finding v within T, if v_{gt} = +\infin, return the right-hand sub-value of v;
     otherwise, return v_{gt}.

     This implementation is O(1) in space (for v_{gt}) and O(h) in time.

     #+BEGIN_SRC python :results silent :session
       class Tree():
           def __init__(self, v, l=None, r=None):
               self.v = v
               self.l = l
               self.r = r
     #+END_SRC

     #+BEGIN_SRC python :results silent :session
       def first_gt(T, v):
           v_gt = None
           cursor = T
           while cursor.v != v:
               if cursor.v < v:
                   cursor = cursor.r
               elif cursor.v > v:
                   v_gt = cursor.v if v_gt is None else min(v_gt, cursor.v)
                   cursor = cursor.l
           return v_gt if v_gt != None else cursor.r.v if cursor.r is not None else cursor.r
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       _t = Tree(
           v=5,
           l=Tree(v=2, l=Tree(v=1), r=Tree(v=4, l=Tree(v=3))),
           r=Tree(
               v=8,
               l=Tree(v=7, l=Tree(v=6)),
               r=Tree(v=10, l=Tree(v=9), r=Tree(v=11))))
       all([
           first_gt(_t, 6) == 7,
           first_gt(_t, 10) == 11,
           first_gt(_t, 11) == None,
       ])
     #+END_SRC

     #+RESULTS:
     : True

      
*** DONE Find the k largest elements in a BST                               :C1:
    CLOSED: [2017-06-27 Tue 15:25]
    
*** DONE Compute the LCA in a BST                                           :C2:
    CLOSED: [2017-07-01 Sat 23:38]

    Design an algorithm that takes as input a BST and two nodes, and returns the
    LCA of the two nodes. Assume all keys are distinct. Nodes do not have
    references to their parents.

    /Hint/: Take advantage of the BST property.

