index.html

<div id="outline-container-org60ca383" class="outline-5">
<h5 id="org60ca383"><span class="section-number-5">2.10.4.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-10-4-1">
<p>
We assume that the domain is unbounded &#x2013; that is, that any event can occur
at any given time t.
</p>

<p>
We assume that an event E is represented as a tuple (t<sub>s</sub>, t<sub>e</sub>), where t<sub>s</sub> is
the start time and t<sub>e</sub> the end time.
</p>

<p>
Instead of considering discrete time values, we consider unit
intervals. For instance, the event (t, t+2) falls into two interval
&ldquo;buckets&rdquo; &#x2013; the first representing the interval [t, t+1], and the second
the interval [t+1, t+2].
</p>

<p>
We maintain a counter dictionary, keyed on the start times of these
intervals, that keeps track of how many events overlap with the key
interval. For each event E, we split E into its constituent unit intervals
and populate the counter accordingly. We choose dictionary for the
following reasons:
</p>

<ul class="org-ul">
<li>We assume no bound on the domain of time T, so we choose a data structure
that doesn&rsquo;t require an explicit initial size for convenience;</li>
<li>We make no assumptions about the proximity of the respective events&rsquo;
intervals; we can very easily have events (0, 10) and (10000,
10010). Using an alternative storage construct, such as an array, would
require us to allocate upwards of 10000 buckets to store information for
these events, only for all but twenty of those buckets to be meaningless,
i.e. with value zero. A dictionary, on the other hand, allows us to only
allocate 20 buckets, for considerably greater space efficiency.</li>
</ul>


<p>
The resulting solution is O(nl) in time and space, where n is the number of
events and l is the max length of the event intervals.
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">atomize_interval</span>(start, end):
    <span style="color: #81A1C1;">for</span> s <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(start, end):
        <span style="color: #81A1C1;">yield</span> (s, s+1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">list</span>(atomize_interval(0,5)) == [(0,1), (1,2), (2,3), (3,4), (4,5)]
</pre>
</div>

<pre class="example">
True
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">max_sim</span>(*E):
    <span style="color: #D8DEE9;">time_to_sim</span> = {}
    <span style="color: #81A1C1;">for</span> e <span style="color: #81A1C1;">in</span> E:
        <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> atomize_interval(*e):
            <span style="color: #81A1C1;">if</span> i[0] <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">in</span> time_to_sim:
                time_to_sim[i[0]] = 0
            time_to_sim[i[0]] += 1
    <span style="color: #81A1C1;">return</span> time_to_sim[<span style="color: #81A1C1;">max</span>(time_to_sim, key=(<span style="color: #81A1C1;">lambda</span> k: time_to_sim[k]))]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    max_sim((0,10)) == 1,
    max_sim((0,10),(2,11),(3,12)) == 3,

    <span style="color: #616e88;"># </span><span style="color: #616e88;">non-contiguous events</span>
    max_sim((0,10), (2,11), (100, 110), (101,111), (102,112), (103,113)) == 4,
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4e6588" class="outline-4">
<h4 id="orgd4e6588"><span class="section-number-4">2.10.5</span> <span class="todo TODO">TODO</span> Compute the union of intervals</h4>
</div>

<div id="outline-container-orgcf3bc8b" class="outline-4">
<h4 id="orgcf3bc8b"><span class="section-number-4">2.10.6</span> <span class="todo TODO">TODO</span> Implement a fast sorting algorithm for lists</h4>
</div>

<div id="outline-container-orga6e4188" class="outline-4">
<h4 id="orga6e4188"><span class="section-number-4">2.10.7</span> <span class="todo TODO">TODO</span> Partitioning and sorting an array with many repeated entries</h4>
</div>
</div>
<div id="outline-container-org61111ce" class="outline-3">
<h3 id="org61111ce"><span class="section-number-3">2.11</span> Binary Search Trees</h3>
<div class="outline-text-3" id="text-2-11">
</div>
<div id="outline-container-org575a4a4" class="outline-4">
<h4 id="org575a4a4"><span class="section-number-4">2.11.1</span> <span class="done DONE">DONE</span> Test if a binary tree satisfies the BST property</h4>
<div class="outline-text-4" id="text-2-11-1">
<p>
Write a program that takes as input a binary tree and checks if the tree
satisfies the BST property.
</p>
</div>

<div id="outline-container-org20d43be" class="outline-5">
<h5 id="org20d43be"><span class="section-number-5">2.11.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-11-1-1">
<p>
Iterate through each subtree, keeping track of a local maximum and
minimum. In addition to asserting that the two leaves relate to the node as
necessary, similarly assert that the two leaves fall within the maximum and
minimum. When recursing into leaves, update either the maximum or the
minimum with the current node value depending on which leave is being
recursed into.
</p>
</div>
</div>
</div>

<div id="outline-container-org76c7bb5" class="outline-4">
<h4 id="org76c7bb5"><span class="section-number-4">2.11.2</span> <span class="done DONE">DONE</span> Find the first key larger than a given value in a BST</h4>
<div class="outline-text-4" id="text-2-11-2">
<p>
Write a program that takes as input a BST and a value, and returns the first
key that would appear in an inorder traversal which is greater than the
input value.
</p>

<p>
<i>Hint</i>: Perform binary search, keeping some additional state.
</p>
</div>

<div id="outline-container-org3478ab9" class="outline-5">
<h5 id="org3478ab9"><span class="section-number-5">2.11.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-11-2-1">
<p>
Given BST T and value v, perform binary search, keeping track of the
current &ldquo;minimum greater-than&rdquo; value v<sub>gt</sub>, which we can initialize to +&infin;. On
finding v within T, if v<sub>gt</sub> = +&infin;, return the right-hand sub-value of v;
otherwise, return v<sub>gt</sub>.
</p>

<p>
This implementation is O(1) in space (for v<sub>gt</sub>) and O(h) in time.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">Tree</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v, l=<span style="color: #81A1C1;">None</span>, r=<span style="color: #81A1C1;">None</span>):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.l = l
        <span style="color: #81A1C1;">self</span>.r = r
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">first_gt</span>(T, v):
    <span style="color: #D8DEE9;">v_gt</span> = <span style="color: #81A1C1;">None</span>
    <span style="color: #D8DEE9;">cursor</span> = T
    <span style="color: #81A1C1;">while</span> cursor.v != v:
        <span style="color: #81A1C1;">if</span> cursor.v &lt; v:
            <span style="color: #D8DEE9;">cursor</span> = cursor.r
        <span style="color: #81A1C1;">elif</span> cursor.v &gt; v:
            <span style="color: #D8DEE9;">v_gt</span> = cursor.v <span style="color: #81A1C1;">if</span> v_gt <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">else</span> <span style="color: #81A1C1;">min</span>(v_gt, cursor.v)
            <span style="color: #D8DEE9;">cursor</span> = cursor.l
    <span style="color: #81A1C1;">return</span> v_gt <span style="color: #81A1C1;">if</span> v_gt != <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">else</span> cursor.r.v <span style="color: #81A1C1;">if</span> cursor.r <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">None</span> <span style="color: #81A1C1;">else</span> cursor.r
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #D8DEE9;">_t</span> = Tree(
    v=5,
    l=Tree(v=2, l=Tree(v=1), r=Tree(v=4, l=Tree(v=3))),
    r=Tree(
        v=8,
        l=Tree(v=7, l=Tree(v=6)),
        r=Tree(v=10, l=Tree(v=9), r=Tree(v=11))))
<span style="color: #81A1C1;">all</span>([
    first_gt(_t, 6) == 7,
    first_gt(_t, 10) == 11,
    first_gt(_t, 11) == <span style="color: #81A1C1;">None</span>,
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>


<div id="outline-container-org96c405e" class="outline-4">
<h4 id="org96c405e"><span class="section-number-4">2.11.3</span> <span class="done DONE">DONE</span> Find the k largest elements in a BST</h4>
<div class="outline-text-4" id="text-2-11-3">
</div>
</div>

<div id="outline-container-org5c77758" class="outline-4">
<h4 id="org5c77758"><span class="section-number-4">2.11.4</span> <span class="done DONE">DONE</span> Compute the LCA in a BST</h4>
<div class="outline-text-4" id="text-2-11-4">
<p>
Design an algorithm that takes as input a BST and two nodes, and returns the
LCA of the two nodes. Assume all keys are distinct. Nodes do not have
references to their parents.
</p>

<p>
<i>Hint</i>: Take advantage of the BST property.
</p>
</div>
