README.org
**** Solution

     We note that the BST property gives us that the LCA is between the max of
     the two nodes values and the min.

     We use a cursor C that starts at the head of input tree T. We iterate C
     according to the BST principle depending on if its current value is greater
     than or less than the max or the min of the two node values,
     respectively. Once we arrive at a node that's in between the max and the
     min, we are done.

     This implementation is O(h) in time.

     #+BEGIN_SRC python :results silent :session
       class Tree():
           def __init__(self, v, l=None, r=None):
               self.v = v
               self.l = l
               self.r = r
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       def lca(T, v1, v2):
           while not(T.v > min(v1,v2) and T.v < max(v1,v2)):
               if T is None:
                   raise Exception
               if T.v > max(v1,v2):
                   T = T.l
               elif T.v < min(v1,v2):
                   T = T.r
           return T.v
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       _t = Tree(
           v=19,
           l = Tree(
               v=7,
               l=Tree(v=3, l=Tree(v=2), r=Tree(v=5)),
               r=Tree(v=11, r=Tree(v=17, l=Tree(v=13))),
           ),
           r=Tree(
               v=43,
               l=Tree(v=23, r=Tree(v=37, l=Tree(v=29, r=Tree(v=31)), r=Tree(v=41))),
               r=Tree(v=47, r=Tree(v=53)),
           )
       )

       all([
           lca(_t, 5, 17) == 7,
           lca(_t, 13, 53) == 19,
       ])
     #+END_SRC

     #+RESULTS:
     : True

*** TODO The most visited pages problem                                     :C2:

    You are given a server log file containing billions of lines. Each line
    contains a number of fields. For this problem the relevant field is an id
    denoting the page that was accessed.

    Write a function to read a log file line, and a function to find the k most
    visited pages, where k is an input to the function. Optimize performance for
    the situation where calls to the two functions are interleaved. You can
    assume the set of distinct pages is small enough to fit in RAM.

    As a concrete example, suppose the log file ids appear in the following
    order: =g,a,t,t,a,a,a,g,t,c,t,a,t=, i.e., there are four pages with ids
    =a,c,g,t=. After the first 10 lines have been read, the most common page is
    a with a count of 4, and the next most common page is t with a count of 3.

    /Hint/: For each page, count the number of times it has been visited.

*** TODO Reconstruct a BST from traversal data                              :C3:

*** TODO Build a minimum height BST from a sorted array                     :C3:

*** TODO Enumerate numbers of the form a + b sqrt(2)                        :C4:

*** TODO Insertion and deletion in a BST                                    :C4:

**** Solution

     We can use reverse in-order traversal, yielding values until the count has
     been satisfied, for an implementation that is O(n) in time and O(log n) in
     space, where n is the number of entries in the BST.

     #+BEGIN_SRC python :results silent :session
       class Tree():
           def __init__(self, v, l=None, r=None):
               self.v = v
               self.l = l
               self.r = r
     #+END_SRC

     #+BEGIN_SRC python :results silent :session
       def get_k_largest(T, k):
           def _get_k_largest(T,k):
               if not T:
                   return [], k
               vs, k_rem = _get_k_largest(T.r,k)
               if k_rem == 0:
                   return vs, 0
               vs.append(T.v)
               k_rem -= 1
               if k_rem == 0:
                   return vs, 0
               lhs, k_rem = _get_k_largest(T.l, k_rem)
               vs.extend(lhs)
               if k_rem == 0:
                   return vs, 0
               return vs, k_rem 
           vs, _ = _get_k_largest(T,k)
           return vs
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           get_k_largest(Tree(
               v = "A",
               l = Tree(v = "B", l = Tree(v = "D"), r = Tree(v = "E")),
               r = Tree(
                   v = "C",
                   l = Tree(v = "F"),
                   r = Tree(
                       v = "G",
                       l = Tree(v = "H", r = Tree(v = "J")),
                       r = Tree(v = "I"),
                   ),
               ),
           ), 9) == ["I", "G", "J", "H", "C", "F", "A", "E", "B"],
       ])
     #+END_SRC

     #+RESULTS:
     : True

** Recursion

