index.html

<div id="outline-container-org2896d60" class="outline-5">
<h5 id="org2896d60"><span class="section-number-5">2.11.4.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-11-4-1">
<p>
We note that the BST property gives us that the LCA is between the max of
the two nodes values and the min.
</p>

<p>
We use a cursor C that starts at the head of input tree T. We iterate C
according to the BST principle depending on if its current value is greater
than or less than the max or the min of the two node values,
respectively. Once we arrive at a node that&rsquo;s in between the max and the
min, we are done.
</p>

<p>
This implementation is O(h) in time.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">Tree</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v, l=<span style="color: #81A1C1;">None</span>, r=<span style="color: #81A1C1;">None</span>):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.l = l
        <span style="color: #81A1C1;">self</span>.r = r
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">lca</span>(T, v1, v2):
    <span style="color: #81A1C1;">while</span> <span style="color: #81A1C1;">not</span>(T.v &gt; <span style="color: #81A1C1;">min</span>(v1,v2) <span style="color: #81A1C1;">and</span> T.v &lt; <span style="color: #81A1C1;">max</span>(v1,v2)):
        <span style="color: #81A1C1;">if</span> T <span style="color: #81A1C1;">is</span> <span style="color: #81A1C1;">None</span>:
            <span style="color: #81A1C1;">raise</span> <span style="color: #8FBCBB;">Exception</span>
        <span style="color: #81A1C1;">if</span> T.v &gt; <span style="color: #81A1C1;">max</span>(v1,v2):
            <span style="color: #D8DEE9;">T</span> = T.l
        <span style="color: #81A1C1;">elif</span> T.v &lt; <span style="color: #81A1C1;">min</span>(v1,v2):
            <span style="color: #D8DEE9;">T</span> = T.r
    <span style="color: #81A1C1;">return</span> T.v
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #D8DEE9;">_t</span> = Tree(
    v=19,
    l = Tree(
        v=7,
        l=Tree(v=3, l=Tree(v=2), r=Tree(v=5)),
        r=Tree(v=11, r=Tree(v=17, l=Tree(v=13))),
    ),
    r=Tree(
        v=43,
        l=Tree(v=23, r=Tree(v=37, l=Tree(v=29, r=Tree(v=31)), r=Tree(v=41))),
        r=Tree(v=47, r=Tree(v=53)),
    )
)

<span style="color: #81A1C1;">all</span>([
    lca(_t, 5, 17) == 7,
    lca(_t, 13, 53) == 19,
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3ca378" class="outline-4">
<h4 id="orgf3ca378"><span class="section-number-4">2.11.5</span> <span class="todo TODO">TODO</span> The most visited pages problem</h4>
<div class="outline-text-4" id="text-2-11-5">
<p>
You are given a server log file containing billions of lines. Each line
contains a number of fields. For this problem the relevant field is an id
denoting the page that was accessed.
</p>

<p>
Write a function to read a log file line, and a function to find the k most
visited pages, where k is an input to the function. Optimize performance for
the situation where calls to the two functions are interleaved. You can
assume the set of distinct pages is small enough to fit in RAM.
</p>

<p>
As a concrete example, suppose the log file ids appear in the following
order: <code>g,a,t,t,a,a,a,g,t,c,t,a,t</code>, i.e., there are four pages with ids
<code>a,c,g,t</code>. After the first 10 lines have been read, the most common page is
a with a count of 4, and the next most common page is t with a count of 3.
</p>

<p>
<i>Hint</i>: For each page, count the number of times it has been visited.
</p>
</div>
</div>

<div id="outline-container-org465bf26" class="outline-4">
<h4 id="org465bf26"><span class="section-number-4">2.11.6</span> <span class="todo TODO">TODO</span> Reconstruct a BST from traversal data</h4>
</div>

<div id="outline-container-org96eea61" class="outline-4">
<h4 id="org96eea61"><span class="section-number-4">2.11.7</span> <span class="todo TODO">TODO</span> Build a minimum height BST from a sorted array</h4>
</div>

<div id="outline-container-org33e218c" class="outline-4">
<h4 id="org33e218c"><span class="section-number-4">2.11.8</span> <span class="todo TODO">TODO</span> Enumerate numbers of the form a + b sqrt(2)</h4>
</div>

<div id="outline-container-org1b53936" class="outline-4">
<h4 id="org1b53936"><span class="section-number-4">2.11.9</span> <span class="todo TODO">TODO</span> Insertion and deletion in a BST</h4>
<div class="outline-text-4" id="text-2-11-9">
</div>
<div id="outline-container-org41d98cb" class="outline-5">
<h5 id="org41d98cb"><span class="section-number-5">2.11.9.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-11-9-1">
<p>
We can use reverse in-order traversal, yielding values until the count has
been satisfied, for an implementation that is O(n) in time and O(log n) in
space, where n is the number of entries in the BST.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">class</span> <span style="color: #8FBCBB;">Tree</span>():
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">__init__</span>(<span style="color: #81A1C1;">self</span>, v, l=<span style="color: #81A1C1;">None</span>, r=<span style="color: #81A1C1;">None</span>):
        <span style="color: #81A1C1;">self</span>.v = v
        <span style="color: #81A1C1;">self</span>.l = l
        <span style="color: #81A1C1;">self</span>.r = r
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">get_k_largest</span>(T, k):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_get_k_largest</span>(T,k):
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> T:
            <span style="color: #81A1C1;">return</span> [], k
        <span style="color: #D8DEE9;">vs</span>, <span style="color: #D8DEE9;">k_rem</span> = _get_k_largest(T.r,k)
        <span style="color: #81A1C1;">if</span> k_rem == 0:
            <span style="color: #81A1C1;">return</span> vs, 0
        vs.append(T.v)
        <span style="color: #D8DEE9;">k_rem</span> -= 1
        <span style="color: #81A1C1;">if</span> k_rem == 0:
            <span style="color: #81A1C1;">return</span> vs, 0
        <span style="color: #D8DEE9;">lhs</span>, <span style="color: #D8DEE9;">k_rem</span> = _get_k_largest(T.l, k_rem)
        vs.extend(lhs)
        <span style="color: #81A1C1;">if</span> k_rem == 0:
            <span style="color: #81A1C1;">return</span> vs, 0
        <span style="color: #81A1C1;">return</span> vs, k_rem 
    <span style="color: #D8DEE9;">vs</span>, <span style="color: #D8DEE9;">_</span> = _get_k_largest(T,k)
    <span style="color: #81A1C1;">return</span> vs
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    get_k_largest(Tree(
        v = <span style="color: #A3BE8C;">"A"</span>,
        l = Tree(v = <span style="color: #A3BE8C;">"B"</span>, l = Tree(v = <span style="color: #A3BE8C;">"D"</span>), r = Tree(v = <span style="color: #A3BE8C;">"E"</span>)),
        r = Tree(
            v = <span style="color: #A3BE8C;">"C"</span>,
            l = Tree(v = <span style="color: #A3BE8C;">"F"</span>),
            r = Tree(
                v = <span style="color: #A3BE8C;">"G"</span>,
                l = Tree(v = <span style="color: #A3BE8C;">"H"</span>, r = Tree(v = <span style="color: #A3BE8C;">"J"</span>)),
                r = Tree(v = <span style="color: #A3BE8C;">"I"</span>),
            ),
        ),
    ), 9) == [<span style="color: #A3BE8C;">"I"</span>, <span style="color: #A3BE8C;">"G"</span>, <span style="color: #A3BE8C;">"J"</span>, <span style="color: #A3BE8C;">"H"</span>, <span style="color: #A3BE8C;">"C"</span>, <span style="color: #A3BE8C;">"F"</span>, <span style="color: #A3BE8C;">"A"</span>, <span style="color: #A3BE8C;">"E"</span>, <span style="color: #A3BE8C;">"B"</span>],
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>
</div>
