README.org
*** DONE Tower of Hanoi                                                     :C0:
    CLOSED: [2018-04-30 Mon 18:51]

    We note that the base condition -- a tower of height 1 -- is trivial.

    For each operation, each of the three pillars is assigned one of three
    "purposes", as follows:

    - One is the "source" pillar, from which we'd like to move a tile;
    - One is the "destination" pillar, to which we'd like to move said tile; and
    - One is the "buffer" pillar, where we move all tiles that are blocking our
      tile in question from being moved to its destination.


    For explanation's sake, let's say that all tiles start on Pillar 1, and that
    we'd like to move them all to Pillar 3 according to the rules of the game.

    #+BEGIN_SRC python
      def hanoi(p1, p2=[], p3=[]):
          _source = p1
          _buff = p2
          _dest = p3

          def move(source=_source, dest=_dest, buff=_buff, n=len(_source)):
              if n == 0:
                  return
              move(source=source, dest=buff, buff=dest, n=n-1)
              dest.append(source.pop())
              move(source=buff, dest=dest, buff=source, n=n-1)

          move()
          return _source, _buff, _dest
    #+END_SRC

*** TODO Generate all nonattacking placements of n-Queens                   :C1:

** Dynamic Programming

*** WRITTEN Count the number of score combinations                          :C0:
    CLOSED: [2017-06-23 Fri 15:03]

    In an American football game, a play can lead to 2 points (safety), 3 points
    (field goal), or 7 points (touchdown, assuming the extra point). Many
    different combinations of 2, 3, and 7 point plays can make up a final
    score. For example, four combinations of plays yield a score of 12:

    - 6 safeties;
    - 3 safeties, 2 field goals;
    - 1 safety, 1 field goal, and 1 touchdown;
    - 4 field goals.


    Write a program that takes a final score and scores for individual plays,
    and returns the number of combinations of plays that result in the final
    score.

**** Solution

     We can memoize the number of combinations that lead to certain scores,
     iterating through the memo to arrive at the desired final score and, as a
     result, the final combination count.

     Say we have possible play scores 2 and 3, and we'd like the number of
     possible plays that could lead to a score of 9. We can represent our memo
     as a two-dimensional array, where one axis is the score and the other
     represents the set of plays that can comprise the score, the first index
     representing, in this case, the set ={2}= and the second, the set ={2,3}=.

     We note that, for a given score =S= and a given set of plays =P = {P', p}=,
     number of combinations leading to score =S= =N(S, P)= equals (informally):

     =N(S-p, P') + N(S-2p, P') + ... + N(0, P')=

     We say that =N(x, y) = 0= for =x<0= and any =y=.

     |         | *0* | *1* | *2* | *3* | *4* | *5* | *6* | *7* | *8* | *9* |
     | ={2}=   |   1 |   0 |   1 |   0 |   1 |   0 |   1 |   0 |   1 |   0 |
     | ={2,3}= |   1 |   0 |   1 |   1 |   1 |   1 |   2 |   1 |   2 |   2 |

     A solution that uses this memoization strategy will be =O(S \times |P|)=, where
     =S= is the score and =P= is the set of play scores. Likewise for space.

*** TODO Compute the Levenshtein distance                                   :C1:

*** DONE Count the number of ways to traverse a 2D array
    CLOSED: [2017-06-23 Fri 19:18]

**** Solution

     Our memoization strategy is as follows. We use a matrix T of the same
     shape as the input matrix M to track the number of ways to traverse to
     that point in the input. Matrix T is populated according to function
     T(i,j), which we define as follows:

     - T(i,j) = T(i-1,j) + T(i, j-1)
     - T(i, j) = 0 \forall j \in \real, i < 0
     - T(i, j) = 0 \forall j < 0, i \in \real


     Our solution then becomes as follows:

     #+BEGIN_SRC python :results silent :session
       def num_traversals(M):
           t = [[0 for _ in M[0]] for _ in M]
           def T(t, i,j):
               if i == -1 or j == -1:
                   return 0
               if i == 0 and j == 0:
                   return 1
               return t[i-1][j] + t[i][j-1]
           for i in range(0, len(M)):
               for j in range(0, len(M[i])):
                   t[i][j] = T(t, i, j)
           return t[len(M)-1][len(M[0])-1]
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           num_traversals([[0,0,0,0,0] for _ in xrange(5)]) == 70,
       ])
     #+END_SRC

     This implementation is linear for both time and space with respect to the
     number of elements in the input matrix.

*** DONE Compute the binomial coefficient without overflow
    CLOSED: [2017-06-24 Sat 21:10]

