index.html

<div id="outline-container-org1122b1c" class="outline-3">
<h3 id="org1122b1c"><span class="section-number-3">2.12</span> Recursion</h3>
<div class="outline-text-3" id="text-2-12">
</div>
<div id="outline-container-orgf0959ab" class="outline-4">
<h4 id="orgf0959ab"><span class="section-number-4">2.12.1</span> <span class="done DONE">DONE</span> Tower of Hanoi</h4>
<div class="outline-text-4" id="text-2-12-1">
<p>
We note that the base condition &#x2013; a tower of height 1 &#x2013; is trivial.
</p>

<p>
For each operation, each of the three pillars is assigned one of three
&ldquo;purposes&rdquo;, as follows:
</p>

<ul class="org-ul">
<li>One is the &ldquo;source&rdquo; pillar, from which we&rsquo;d like to move a tile;</li>
<li>One is the &ldquo;destination&rdquo; pillar, to which we&rsquo;d like to move said tile; and</li>
<li>One is the &ldquo;buffer&rdquo; pillar, where we move all tiles that are blocking our
tile in question from being moved to its destination.</li>
</ul>


<p>
For explanation&rsquo;s sake, let&rsquo;s say that all tiles start on Pillar 1, and that
we&rsquo;d like to move them all to Pillar 3 according to the rules of the game.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">hanoi</span>(p1, p2=[], p3=[]):
    <span style="color: #D8DEE9;">_source</span> = p1
    <span style="color: #D8DEE9;">_buff</span> = p2
    <span style="color: #D8DEE9;">_dest</span> = p3

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">move</span>(source=_source, dest=_dest, buff=_buff, n=<span style="color: #81A1C1;">len</span>(_source)):
        <span style="color: #81A1C1;">if</span> n == 0:
            <span style="color: #81A1C1;">return</span>
        move(source=source, dest=buff, buff=dest, n=n-1)
        dest.append(source.pop())
        move(source=buff, dest=dest, buff=source, n=n-1)

    move()
    <span style="color: #81A1C1;">return</span> _source, _buff, _dest
</pre>
</div>
</div>
</div>

<div id="outline-container-org54dd751" class="outline-4">
<h4 id="org54dd751"><span class="section-number-4">2.12.2</span> <span class="todo TODO">TODO</span> Generate all nonattacking placements of n-Queens</h4>
</div>
</div>

<div id="outline-container-org75fed2a" class="outline-3">
<h3 id="org75fed2a"><span class="section-number-3">2.13</span> Dynamic Programming</h3>
<div class="outline-text-3" id="text-2-13">
</div>
<div id="outline-container-orgdfa8181" class="outline-4">
<h4 id="orgdfa8181"><span class="section-number-4">2.13.1</span> <span class="done WRITTEN">WRITTEN</span> Count the number of score combinations</h4>
<div class="outline-text-4" id="text-2-13-1">
<p>
In an American football game, a play can lead to 2 points (safety), 3 points
(field goal), or 7 points (touchdown, assuming the extra point). Many
different combinations of 2, 3, and 7 point plays can make up a final
score. For example, four combinations of plays yield a score of 12:
</p>

<ul class="org-ul">
<li>6 safeties;</li>
<li>3 safeties, 2 field goals;</li>
<li>1 safety, 1 field goal, and 1 touchdown;</li>
<li>4 field goals.</li>
</ul>


<p>
Write a program that takes a final score and scores for individual plays,
and returns the number of combinations of plays that result in the final
score.
</p>
</div>

<div id="outline-container-orgfc3010d" class="outline-5">
<h5 id="orgfc3010d"><span class="section-number-5">2.13.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-13-1-1">
<p>
We can memoize the number of combinations that lead to certain scores,
iterating through the memo to arrive at the desired final score and, as a
result, the final combination count.
</p>

<p>
Say we have possible play scores 2 and 3, and we&rsquo;d like the number of
possible plays that could lead to a score of 9. We can represent our memo
as a two-dimensional array, where one axis is the score and the other
represents the set of plays that can comprise the score, the first index
representing, in this case, the set <code>{2}</code> and the second, the set <code>{2,3}</code>.
</p>

<p>
We note that, for a given score <code>S</code> and a given set of plays <code>P = {P', p}</code>,
number of combinations leading to score <code>S</code> <code>N(S, P)</code> equals (informally):
</p>

<p>
<code>N(S-p, P') + N(S-2p, P') + ... + N(0, P')</code>
</p>

<p>
We say that <code>N(x, y) = 0</code> for <code>x&lt;0</code> and any <code>y</code>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right"><b>0</b></td>
<td class="org-right"><b>1</b></td>
<td class="org-right"><b>2</b></td>
<td class="org-right"><b>3</b></td>
<td class="org-right"><b>4</b></td>
<td class="org-right"><b>5</b></td>
<td class="org-right"><b>6</b></td>
<td class="org-right"><b>7</b></td>
<td class="org-right"><b>8</b></td>
<td class="org-right"><b>9</b></td>
</tr>

<tr>
<td class="org-left"><code>{2}</code></td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>{2,3}</code></td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<p>
A solution that uses this memoization strategy will be <code>O(S \times |P|)</code>, where
<code>S</code> is the score and <code>P</code> is the set of play scores. Likewise for space.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdebe768" class="outline-4">
<h4 id="orgdebe768"><span class="section-number-4">2.13.2</span> <span class="todo TODO">TODO</span> Compute the Levenshtein distance</h4>
</div>

<div id="outline-container-org18485ac" class="outline-4">
<h4 id="org18485ac"><span class="section-number-4">2.13.3</span> <span class="done DONE">DONE</span> Count the number of ways to traverse a 2D array</h4>
<div class="outline-text-4" id="text-2-13-3">
</div>

<div id="outline-container-org42ab0df" class="outline-5">
<h5 id="org42ab0df"><span class="section-number-5">2.13.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-13-3-1">
<p>
Our memoization strategy is as follows. We use a matrix T of the same
shape as the input matrix M to track the number of ways to traverse to
that point in the input. Matrix T is populated according to function
T(i,j), which we define as follows:
</p>

<ul class="org-ul">
<li>T(i,j) = T(i-1,j) + T(i, j-1)</li>
<li>T(i, j) = 0 &forall; j &isin; &real;, i &lt; 0</li>
<li>T(i, j) = 0 &forall; j &lt; 0, i &isin; &real;</li>
</ul>


<p>
Our solution then becomes as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">num_traversals</span>(M):
    <span style="color: #D8DEE9;">t</span> = [[0 <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> M[0]] <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> M]
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">T</span>(t, i,j):
        <span style="color: #81A1C1;">if</span> i == -1 <span style="color: #81A1C1;">or</span> j == -1:
            <span style="color: #81A1C1;">return</span> 0
        <span style="color: #81A1C1;">if</span> i == 0 <span style="color: #81A1C1;">and</span> j == 0:
            <span style="color: #81A1C1;">return</span> 1
        <span style="color: #81A1C1;">return</span> t[i-1][j] + t[i][j-1]
    <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0, <span style="color: #81A1C1;">len</span>(M)):
        <span style="color: #81A1C1;">for</span> j <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0, <span style="color: #81A1C1;">len</span>(M[i])):
            t[i][j] = T(t, i, j)
    <span style="color: #81A1C1;">return</span> t[<span style="color: #81A1C1;">len</span>(M)-1][<span style="color: #81A1C1;">len</span>(M[0])-1]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    num_traversals([[0,0,0,0,0] <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">xrange</span>(5)]) == 70,
])
</pre>
</div>

<p>
This implementation is linear for both time and space with respect to the
number of elements in the input matrix.
</p>
</div>
</div>
</div>

<div id="outline-container-org1ffa5dc" class="outline-4">
<h4 id="org1ffa5dc"><span class="section-number-4">2.13.4</span> <span class="done DONE">DONE</span> Compute the binomial coefficient without overflow</h4>
<div class="outline-text-4" id="text-2-13-4">
</div>
