README.org
**** Solution

     For illustration's purpose, we outline a C matrix, where C[n][k] = C(n+1,k+1)
     \forall n,k \in \real:

     | 1 | 2 | 3 | 4 |
     | 0 | 1 | 3 | 6 |
     | 0 | 0 | 1 | 4 |
     | 0 | 0 | 0 | 1 |

     We note that this gives us the following recursive definition of the
     binominal coefficient: C(n, k) = C(n-1, k-1) + C(n-1, k). A naive
     implementation would directly translate this recursive definition into a
     recursive implementation, resulting in re-computation of the same values
     for exponential time complexity w.r.t nk. Instead, we memoize intermediate
     results in a manner identical to the example matrix above:

     #+BEGIN_SRC python :results output :session
       def bico(n,k):
           def C(_C, n, k):
               if n == k:
                   return 1
               elif k == 0:
                   return n + 1
               elif k > n:
                   return 0
               else:
                   return _C[k-1][n-1] + _C[k][n-1]
           _C = [[0 for _ in xrange(n)] for _ in xrange(k)]
           for _k in range(0, k):
               for _n in range(0, n):
                   _C[_k][_n] = C(_C, _n, _k)
           return _C[k-1][n-1]
     #+END_SRC

     #+RESULTS:

     #+BEGIN_SRC python :results output :session
       all([
           bico(29, 3) == 3654,
           bico(3, 2) == 3,
       ])
     #+END_SRC

     This solution is O(nk) for both time and space.

*** DONE Search for a sequence in a 2D array
    CLOSED: [2017-06-24 Sat 22:48]

    Write a program that takes as arguments a 2D array and a 1D array, and
    checks whether the 1D array appears in the 2D array.

**** Solution

     We can use iteration through each element of the 2D array as the backbone
     of our solution's logic; during iteration, if we encounter an element
     that's equal to the first element of the sequence, we break into tracing
     logic. This tracing logic considers all of the element's "neighbors" to see
     if they equal the next value in the sequence. We "trace" the sequence in
     this way; if we reach the end of the sequence in this way, we return true
     and are done. If, however, tracing leads to only a partial match, we mark
     the latest element in the trace as "invalid" and propagate that mark
     backwards through the trace. This is to prevent re-tracing of paths that
     are already known to be "lost causes" -- an implementation that would lead
     to time complexity of O(nml), where n and m are the matrix's dimensions and
     l is the length of the sequence. The result, where we preemptively avoid
     tracing paths that have already been deemed to not match the argument
     sequence, is an implementation that is in time O(nm) (traversal of the
     input sequence is amortized).

     #+BEGIN_SRC python :results silent :session
       def contains_sequence(M, S):
           # eligibility matrix
           m_e = [[True for _ in xrange(len(M[0]))] for _ in xrange(len(M))]
           def neighbor_coords(i, j):
               if i < len(M)-1:
                   yield (i+1, j)
               if i > 0:
                   yield (i-1, j)
               if j < len(M[0])-1:
                   yield (i, j+1)
               if j > 0:
                   yield (i, j-1)
           def trace(i, j, seq):
               if not seq:
                   return True
               if not m_e[i][j]:
                   return False
               if M[i][j] != seq[0] or not any([
                       trace(nc[0], nc[1], seq[1:]) for nc in neighbor_coords(i, j)
               ]):
                   m_e[i][j] = False
                   return False
               else:
                   return True
           for i in range(0, len(M)):
               for j in range(0, len(M[0])):
                   if trace(i, j, S):
                       return True
           return False
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           contains_sequence(M, S) == r for M,S,r in [
               (
                   [[1,2,5],
                    [3,4,3],
                    [5,6,7]],
                   [3,4,7],
                   False,
               ),
               (
                   [[1,2,5],
                    [3,4,3],
                    [5,6,7]],
                   [3,4,6,7],
                   True,
               ),
               (
                   [[1,2,3],
                    [3,4,5],
                    [5,6,7]],
                   [1,3,4,6],
                   True,
               ),
               (
                   [[1,2,3],
                    [3,4,5],
                    [5,6,7]],
                   [1,2,3,4],
                   False,
               ),
           ]
       ])
     #+END_SRC

     #+RESULTS:
     : True

** Greedy Algorithms and Invariants

*** DONE The 3-sum problem                                                  :C0:
    CLOSED: [2017-07-02 Sun 13:01]

    Design an algorithm that takes as input an array and a number, and
    determines if there are three entries in the array (not necessarily
    distinct) which add up to the specified number. For example, if the array is
    =<11,2,5,7,3>= then there are three entries in the array which add up to 21
    (3, 7, 11, and 5, 5, 11) (note that we can use 5 twice, since the problem
    statement said we c an use the same entry more than once). However, no three
    entries add up to 22.

    /Hint/: How would you check if a given array entry can be added to two more
    entries to get the specified number?

