index.html

<div id="outline-container-org1675d29" class="outline-5">
<h5 id="org1675d29"><span class="section-number-5">2.13.4.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-13-4-1">
<p>
For illustration&rsquo;s purpose, we outline a C matrix, where C[n][k] = C(n+1,k+1)
&forall; n,k &isin; &real;:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
We note that this gives us the following recursive definition of the
binominal coefficient: C(n, k) = C(n-1, k-1) + C(n-1, k). A naive
implementation would directly translate this recursive definition into a
recursive implementation, resulting in re-computation of the same values
for exponential time complexity w.r.t nk. Instead, we memoize intermediate
results in a manner identical to the example matrix above:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">bico</span>(n,k):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">C</span>(_C, n, k):
        <span style="color: #81A1C1;">if</span> n == k:
            <span style="color: #81A1C1;">return</span> 1
        <span style="color: #81A1C1;">elif</span> k == 0:
            <span style="color: #81A1C1;">return</span> n + 1
        <span style="color: #81A1C1;">elif</span> k &gt; n:
            <span style="color: #81A1C1;">return</span> 0
        <span style="color: #81A1C1;">else</span>:
            <span style="color: #81A1C1;">return</span> _C[k-1][n-1] + _C[k][n-1]
    <span style="color: #D8DEE9;">_C</span> = [[0 <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">xrange</span>(n)] <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">xrange</span>(k)]
    <span style="color: #81A1C1;">for</span> _k <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0, k):
        <span style="color: #81A1C1;">for</span> _n <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0, n):
            _C[_k][_n] = C(_C, _n, _k)
    <span style="color: #81A1C1;">return</span> _C[k-1][n-1]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    bico(29, 3) == 3654,
    bico(3, 2) == 3,
])
</pre>
</div>

<p>
This solution is O(nk) for both time and space.
</p>
</div>
</div>
</div>

<div id="outline-container-org35c4021" class="outline-4">
<h4 id="org35c4021"><span class="section-number-4">2.13.5</span> <span class="done DONE">DONE</span> Search for a sequence in a 2D array</h4>
<div class="outline-text-4" id="text-2-13-5">
<p>
Write a program that takes as arguments a 2D array and a 1D array, and
checks whether the 1D array appears in the 2D array.
</p>
</div>

<div id="outline-container-orgfabcc86" class="outline-5">
<h5 id="orgfabcc86"><span class="section-number-5">2.13.5.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-13-5-1">
<p>
We can use iteration through each element of the 2D array as the backbone
of our solution&rsquo;s logic; during iteration, if we encounter an element
that&rsquo;s equal to the first element of the sequence, we break into tracing
logic. This tracing logic considers all of the element&rsquo;s &ldquo;neighbors&rdquo; to see
if they equal the next value in the sequence. We &ldquo;trace&rdquo; the sequence in
this way; if we reach the end of the sequence in this way, we return true
and are done. If, however, tracing leads to only a partial match, we mark
the latest element in the trace as &ldquo;invalid&rdquo; and propagate that mark
backwards through the trace. This is to prevent re-tracing of paths that
are already known to be &ldquo;lost causes&rdquo; &#x2013; an implementation that would lead
to time complexity of O(nml), where n and m are the matrix&rsquo;s dimensions and
l is the length of the sequence. The result, where we preemptively avoid
tracing paths that have already been deemed to not match the argument
sequence, is an implementation that is in time O(nm) (traversal of the
input sequence is amortized).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">contains_sequence</span>(M, S):
    <span style="color: #616e88;"># </span><span style="color: #616e88;">eligibility matrix</span>
    <span style="color: #D8DEE9;">m_e</span> = [[<span style="color: #81A1C1;">True</span> <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">xrange</span>(<span style="color: #81A1C1;">len</span>(M[0]))] <span style="color: #81A1C1;">for</span> _ <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">xrange</span>(<span style="color: #81A1C1;">len</span>(M))]
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">neighbor_coords</span>(i, j):
        <span style="color: #81A1C1;">if</span> i &lt; <span style="color: #81A1C1;">len</span>(M)-1:
            <span style="color: #81A1C1;">yield</span> (i+1, j)
        <span style="color: #81A1C1;">if</span> i &gt; 0:
            <span style="color: #81A1C1;">yield</span> (i-1, j)
        <span style="color: #81A1C1;">if</span> j &lt; <span style="color: #81A1C1;">len</span>(M[0])-1:
            <span style="color: #81A1C1;">yield</span> (i, j+1)
        <span style="color: #81A1C1;">if</span> j &gt; 0:
            <span style="color: #81A1C1;">yield</span> (i, j-1)
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">trace</span>(i, j, seq):
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> seq:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
        <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> m_e[i][j]:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
        <span style="color: #81A1C1;">if</span> M[i][j] != seq[0] <span style="color: #81A1C1;">or</span> <span style="color: #81A1C1;">not</span> <span style="color: #81A1C1;">any</span>([
                trace(nc[0], nc[1], seq[1:]) <span style="color: #81A1C1;">for</span> nc <span style="color: #81A1C1;">in</span> neighbor_coords(i, j)
        ]):
            m_e[i][j] = <span style="color: #81A1C1;">False</span>
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
        <span style="color: #81A1C1;">else</span>:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
    <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0, <span style="color: #81A1C1;">len</span>(M)):
        <span style="color: #81A1C1;">for</span> j <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(0, <span style="color: #81A1C1;">len</span>(M[0])):
            <span style="color: #81A1C1;">if</span> trace(i, j, S):
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    contains_sequence(M, S) == r <span style="color: #81A1C1;">for</span> M,S,r <span style="color: #81A1C1;">in</span> [
        (
            [[1,2,5],
             [3,4,3],
             [5,6,7]],
            [3,4,7],
            <span style="color: #81A1C1;">False</span>,
        ),
        (
            [[1,2,5],
             [3,4,3],
             [5,6,7]],
            [3,4,6,7],
            <span style="color: #81A1C1;">True</span>,
        ),
        (
            [[1,2,3],
             [3,4,5],
             [5,6,7]],
            [1,3,4,6],
            <span style="color: #81A1C1;">True</span>,
        ),
        (
            [[1,2,3],
             [3,4,5],
             [5,6,7]],
            [1,2,3,4],
            <span style="color: #81A1C1;">False</span>,
        ),
    ]
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgacfe5fd" class="outline-3">
<h3 id="orgacfe5fd"><span class="section-number-3">2.14</span> Greedy Algorithms and Invariants</h3>
<div class="outline-text-3" id="text-2-14">
</div>
<div id="outline-container-orge29446c" class="outline-4">
<h4 id="orge29446c"><span class="section-number-4">2.14.1</span> <span class="done DONE">DONE</span> The 3-sum problem</h4>
<div class="outline-text-4" id="text-2-14-1">
<p>
Design an algorithm that takes as input an array and a number, and
determines if there are three entries in the array (not necessarily
distinct) which add up to the specified number. For example, if the array is
<code>&lt;11,2,5,7,3&gt;</code> then there are three entries in the array which add up to 21
(3, 7, 11, and 5, 5, 11) (note that we can use 5 twice, since the problem
statement said we c an use the same entry more than once). However, no three
entries add up to 22.
</p>

<p>
<i>Hint</i>: How would you check if a given array entry can be added to two more
entries to get the specified number?
</p>
</div>
