README.org
**** Solution

     Note that we do not need to return the specific set of three entries --
     only determine that it exists.

     First we sort the array A in O(n log n). Then, for each index i, we iterate
     through indices j and k in opposite directions to determine if any satisfy
     A[j] + A[k] = v - A[i]. This brings our final time complexity to O(n^{2}).

     #+BEGIN_SRC python :results silent :session
       def has_three_sum(A, v):
           for a in A:
               j = 0
               k = len(A) - 1
               while j < k:
                   _v = a + A[j] + A[k]
                   if _v < v:
                       j += 1
                   elif _v > v:
                       k -= 1
                   else:
                       return True
           return False
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           has_three_sum([11,2,5,7,3], 21),
           not has_three_sum([11,2,5,7,3], 100),
           not has_three_sum([11,2,5,7,3], 0),
       ])

     #+END_SRC

     #+RESULTS:
     : True

*** LOOKED-UP The gasup problem                                             :C1:
    CLOSED: [2017-07-02 Sun 16:46]

    A number of cities are arranged on a circular road. You need to visit all
    the cities and come back to the starting city. A certain amount of gas is
    available at each city. The amount of gas summed up over all cities is equal
    to the amount of gas required to go around the road once. Your gas tank has
    unlimited capacity. Call a city /ample/ if you can begin at that city with
    an empty tank, refill at it, then travel through all the remaining cities,
    refilling at each, and return to the ample city, without running out of gas
    at any point.

    Given an instance of the gasup problem, how would you efficiently compute an
    ample city, if one exists?

    /Hint/: Think about starting with more than enough gas to complete the
    circuit without gassing up. Track the amount of gas as you perform the
    circuit, gassing up at each city.
    
**** Solution

     Find the city/cities for which gas level is at minimum on arrival (ignoring
     impossibility of negative gas levels). Call one of these cities c. Since we
     have that total amount of gas at each city is enough to complete the full
     circle, and that, due to being at a minimum on arrival, we will never have
     less gas than we would have on entry to c, we know that we can complete the
     full circle from c. Finding the exact value of c is a simple matter of
     finding the minimum entry gas level of each city, which can be done in
     linear time.

*** TODO Find the majority element                                          :C2:

    You are reading a sequence of strings. You know a priori that more than half
    of the strings are repetitions of a single string but the positions where
    the majority element occurs are unknown. Write a program that makes a single
    pass over the sequence and identifies the majority element. For example, if
    the input is =<b,a,c,a,a,b,a,a,c,a>=, then a is the majority element (it
    appears in 6 out of the 10 places).
    
    /Hint/: Take advantage of the existence of a majority element to perform
    elimination.

*** TODO Compute the maximum water trapped by a pair of vertical lines      :C2:

*** TODO Compute the largest rectangle under the skyline                    :C3:

*** TODO Implement Huffman coding                                           :C4:

** Graphs

*** DONE Search a maze                                                      :C0:

    Given a 2D array of black and white entries representing a maze with
    designated entrance and exit points, find a path from the entrance to the
    exit, if one exists.

    /Hint/: Model the maze as a graph.

