index.html

<div id="outline-container-orgc701172" class="outline-5">
<h5 id="orgc701172"><span class="section-number-5">2.14.1.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-14-1-1">
<p>
Note that we do not need to return the specific set of three entries &#x2013;
only determine that it exists.
</p>

<p>
First we sort the array A in O(n log n). Then, for each index i, we iterate
through indices j and k in opposite directions to determine if any satisfy
A[j] + A[k] = v - A[i]. This brings our final time complexity to O(n<sup>2</sup>).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">has_three_sum</span>(A, v):
    <span style="color: #81A1C1;">for</span> a <span style="color: #81A1C1;">in</span> A:
        <span style="color: #D8DEE9;">j</span> = 0
        <span style="color: #D8DEE9;">k</span> = <span style="color: #81A1C1;">len</span>(A) - 1
        <span style="color: #81A1C1;">while</span> j &lt; k:
            <span style="color: #D8DEE9;">_v</span> = a + A[j] + A[k]
            <span style="color: #81A1C1;">if</span> _v &lt; v:
                <span style="color: #D8DEE9;">j</span> += 1
            <span style="color: #81A1C1;">elif</span> _v &gt; v:
                <span style="color: #D8DEE9;">k</span> -= 1
            <span style="color: #81A1C1;">else</span>:
                <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>
    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    has_three_sum([11,2,5,7,3], 21),
    <span style="color: #81A1C1;">not</span> has_three_sum([11,2,5,7,3], 100),
    <span style="color: #81A1C1;">not</span> has_three_sum([11,2,5,7,3], 0),
])

</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc31d1fa" class="outline-4">
<h4 id="orgc31d1fa"><span class="section-number-4">2.14.2</span> <span class="done LOOKED_UP">LOOKED-UP</span> The gasup problem</h4>
<div class="outline-text-4" id="text-2-14-2">
<p>
A number of cities are arranged on a circular road. You need to visit all
the cities and come back to the starting city. A certain amount of gas is
available at each city. The amount of gas summed up over all cities is equal
to the amount of gas required to go around the road once. Your gas tank has
unlimited capacity. Call a city <i>ample</i> if you can begin at that city with
an empty tank, refill at it, then travel through all the remaining cities,
refilling at each, and return to the ample city, without running out of gas
at any point.
</p>

<p>
Given an instance of the gasup problem, how would you efficiently compute an
ample city, if one exists?
</p>

<p>
<i>Hint</i>: Think about starting with more than enough gas to complete the
circuit without gassing up. Track the amount of gas as you perform the
circuit, gassing up at each city.
</p>
</div>

<div id="outline-container-org8452838" class="outline-5">
<h5 id="org8452838"><span class="section-number-5">2.14.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-14-2-1">
<p>
Find the city/cities for which gas level is at minimum on arrival (ignoring
impossibility of negative gas levels). Call one of these cities c. Since we
have that total amount of gas at each city is enough to complete the full
circle, and that, due to being at a minimum on arrival, we will never have
less gas than we would have on entry to c, we know that we can complete the
full circle from c. Finding the exact value of c is a simple matter of
finding the minimum entry gas level of each city, which can be done in
linear time.
</p>
</div>
</div>
</div>

<div id="outline-container-orga1151f4" class="outline-4">
<h4 id="orga1151f4"><span class="section-number-4">2.14.3</span> <span class="todo TODO">TODO</span> Find the majority element</h4>
<div class="outline-text-4" id="text-2-14-3">
<p>
You are reading a sequence of strings. You know a priori that more than half
of the strings are repetitions of a single string but the positions where
the majority element occurs are unknown. Write a program that makes a single
pass over the sequence and identifies the majority element. For example, if
the input is <code>&lt;b,a,c,a,a,b,a,a,c,a&gt;</code>, then a is the majority element (it
appears in 6 out of the 10 places).
</p>

<p>
<i>Hint</i>: Take advantage of the existence of a majority element to perform
elimination.
</p>
</div>
</div>

<div id="outline-container-org76b3e1c" class="outline-4">
<h4 id="org76b3e1c"><span class="section-number-4">2.14.4</span> <span class="todo TODO">TODO</span> Compute the maximum water trapped by a pair of vertical lines</h4>
</div>

<div id="outline-container-org955e17b" class="outline-4">
<h4 id="org955e17b"><span class="section-number-4">2.14.5</span> <span class="todo TODO">TODO</span> Compute the largest rectangle under the skyline</h4>
</div>

<div id="outline-container-org4572825" class="outline-4">
<h4 id="org4572825"><span class="section-number-4">2.14.6</span> <span class="todo TODO">TODO</span> Implement Huffman coding</h4>
</div>
</div>

<div id="outline-container-org6a47807" class="outline-3">
<h3 id="org6a47807"><span class="section-number-3">2.15</span> Graphs</h3>
<div class="outline-text-3" id="text-2-15">
</div>
<div id="outline-container-orgbeace61" class="outline-4">
<h4 id="orgbeace61"><span class="section-number-4">2.15.1</span> <span class="done DONE">DONE</span> Search a maze</h4>
<div class="outline-text-4" id="text-2-15-1">
<p>
Given a 2D array of black and white entries representing a maze with
designated entrance and exit points, find a path from the entrance to the
exit, if one exists.
</p>

<p>
<i>Hint</i>: Model the maze as a graph.
</p>
</div>
