README.org
**** <2018-05-05 Sat> Solution

     Without loss of generality, we make the following simplifying assumptions
     for any maze of size MxN:
     
     - The entrance is at index (0,0); and
     - The exit is at index (M-1,N-1).


     We can treat this problem as similar to a depth-first search on a graph,
     where each element on our stack tracks:

     - The "current" room; as well as
     - All preceding rooms visited.


     At worst, the problem is equivalent to depth-first traversal, with
     complexity O(V+E) = O(V+4V) = O(V).


     #+BEGIN_SRC python :session
       def traverse(maze):
           def _mark_visited(i,j):
               maze[i][j]=0
           def _is_unvisited_room(i, j):
               return maze[i][j] == 1

           def _is_within_bounds(i, j):
               return i >= 0 and i < len(maze) and j >= 0 and j < len(maze[0])

           def _get_next_candidates(i, j):
               return filter(
                   lambda c: _is_within_bounds(c[0],c[1]) and _is_unvisited_room(c[0],c[1]),
                   [(i+1, j), (i-1, j), (i, j+1), (i, j-1)],
               )

           ENTRANCE = (0, 0)
           EXIT = (len(maze)-1, len(maze[0])-1)

           progress = [([], ENTRANCE)]

           while progress:
               path, curr = progress.pop()

               if curr == EXIT:
                   return True, path + [curr]

               progress.extend([
                   (path + [curr], cand)
                   for cand in _get_next_candidates(curr[0], curr[1])
               ])

               _mark_visited(curr[0],curr[1])

           return False, []
     #+END_SRC

     #+RESULTS:

     #+BEGIN_SRC python :session
       all([
           traverse([
               [1, 0, 0],
               [1, 1, 0],
               [0, 1, 1],
           ]) == (True, [(0, 0), (1, 0), (1, 1), (2, 1), (2, 2)]),

           traverse([
               [1, 1, 0, 0, 0],
               [0, 1, 1, 1, 0],
               [0, 0, 0, 1, 0],
               [0, 1, 1, 1, 0],
               [0, 1, 0, 0, 0],
               [0, 1, 1, 1, 1],
           ]) == (True, [
               (0, 0), (0, 1), (1, 1), (1, 2), (1, 3), (2, 3), (3, 3), (3, 2), (3, 1),
               (4, 1), (5, 1), (5, 2), (5, 3), (5, 4),
           ]),

           traverse([
               [1,1,1],
               [0,0,1],
               [0,0,0],
           ]) == (False, []),
       ])
     #+END_SRC

     #+RESULTS:
     : True
     
*** WRITTEN Transform one string to another                                 :C1:
    CLOSED: [2017-06-29 Thu 15:13]

    Let s and t be strings and D a dictionary, i.e. a set of strings. Define s
    to produce t if there exists a sequence of strings from the dictionary P =
    <s_0, s_1, ..., s_{n-1}> such that the first string is s, the last string is t,
    and adjacent strings have the same length and differ in exactly one
    character. The sequence P is called a /production sequence/. For example, if
    the dictionary is ={bat, cot, dog, dag, dot, cat}=, then =<cat, cot, dot,
    dog>= is a production sequence.

    Given a dictionary D and two strings s and t, write a program to determine
    if s produces t. Assume that all characters are lowercase alphabets. If s
    does produce t, output the length of the shortest production sequence;
    otherwise, output -1.

    /Hint/: Treat strings as vertices in an undirected graph, with an edge
    between u and v if and only if the corresponding strings differ in one
    character.

**** Solution

     Create a graph according to the hint in time complexity O(n^{2}). Traverse the
     graph using BFS in time O(|V| + |E|) = O(n + n^{2}) = O(n^{2}).

     Note that we don't need to necessarily "create" a graph per se; edges can
     be "discovered" ad-hoc by finding words in the dictionary that are one
     character off from the current vertex.

*** DONE Paint a Boolean matrix                                             :C2:
    CLOSED: [2017-07-02 Sun 17:29]

    Implement a routine that takes an n x m Boolean array A together with an
    entry (x,y) and flips the color of the region associated with (x,y).

    /Hint/: Solve this conceptually, then think about implementation
    optimizations.
    
**** Solution

     Record the target value of (x,y); if (x,y) is True, target is False, and
     vice-versa. From (x,y), fan out -- recursively or with a queue -- to all
     neighbor entries. If neighbor n is already set to the target, do nothing;
     otherwise, set n to the target, and add n's neighbors to the visitation
     queue. Continue in this way until the visitation queue is empty.

     Time O(n) and space O(n) for the size of the array.

     #+BEGIN_SRC python :results output :session
       def flip_region(Ab, i, j):
           def neighbors(Ab, i, j):
               if i > 0:
                   yield (i-1,j)
               if i < len(Ab) - 1:
                   yield (i+1, j)
               if j > 0:
                   yield (i, j-1)
               if j < len(Ab[0]) - 1:
                   yield (i, j+1)
           _Ab = Ab
           target = not _Ab[i][j]
           visit_queue = [(i,j)]
           while visit_queue:
               _i, _j = visit_queue.pop(0)
               curr = _Ab[_i][_j]
               if curr == target:
                   continue
               for n in neighbors(_Ab, _i, _j):
                   _Ab[_i][_j] = target
                   visit_queue.append(n)
           return _Ab
     #+END_SRC

     #+BEGIN_SRC python :results value :session
       all([
           flip_region([
               [1,0,1],
               [0,1,1],
               [1,1,1],
           ], 0, 2) == [
               [1,0,0],
               [0,0,0],
               [0,0,0],
           ],
       ])
     #+END_SRC

     #+RESULTS:
     : True
     
