index.html

<div id="outline-container-orgcefba3e" class="outline-5">
<h5 id="orgcefba3e"><span class="section-number-5">2.15.1.1</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-05-05 Sat&gt; </span></span> Solution</h5>
<div class="outline-text-5" id="text-2-15-1-1">
<p>
Without loss of generality, we make the following simplifying assumptions
for any maze of size MxN:
</p>

<ul class="org-ul">
<li>The entrance is at index (0,0); and</li>
<li>The exit is at index (M-1,N-1).</li>
</ul>


<p>
We can treat this problem as similar to a depth-first search on a graph,
where each element on our stack tracks:
</p>

<ul class="org-ul">
<li>The &ldquo;current&rdquo; room; as well as</li>
<li>All preceding rooms visited.</li>
</ul>


<p>
At worst, the problem is equivalent to depth-first traversal, with
complexity O(V+E) = O(V+4V) = O(V).
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">traverse</span>(maze):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_mark_visited</span>(i,j):
        maze[i][j]=0
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_is_unvisited_room</span>(i, j):
        <span style="color: #81A1C1;">return</span> maze[i][j] == 1

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_is_within_bounds</span>(i, j):
        <span style="color: #81A1C1;">return</span> i &gt;= 0 <span style="color: #81A1C1;">and</span> i &lt; <span style="color: #81A1C1;">len</span>(maze) <span style="color: #81A1C1;">and</span> j &gt;= 0 <span style="color: #81A1C1;">and</span> j &lt; <span style="color: #81A1C1;">len</span>(maze[0])

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_get_next_candidates</span>(i, j):
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">filter</span>(
            <span style="color: #81A1C1;">lambda</span> c: _is_within_bounds(c[0],c[1]) <span style="color: #81A1C1;">and</span> _is_unvisited_room(c[0],c[1]),
            [(i+1, j), (i-1, j), (i, j+1), (i, j-1)],
        )

    <span style="color: #D8DEE9;">ENTRANCE</span> = (0, 0)
    <span style="color: #D8DEE9;">EXIT</span> = (<span style="color: #81A1C1;">len</span>(maze)-1, <span style="color: #81A1C1;">len</span>(maze[0])-1)

    <span style="color: #D8DEE9;">progress</span> = [([], ENTRANCE)]

    <span style="color: #81A1C1;">while</span> progress:
        <span style="color: #D8DEE9;">path</span>, <span style="color: #D8DEE9;">curr</span> = progress.pop()

        <span style="color: #81A1C1;">if</span> curr == EXIT:
            <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">True</span>, path + [curr]

        progress.extend([
            (path + [curr], cand)
            <span style="color: #81A1C1;">for</span> cand <span style="color: #81A1C1;">in</span> _get_next_candidates(curr[0], curr[1])
        ])

        _mark_visited(curr[0],curr[1])

    <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">False</span>, []
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    traverse([
        [1, 0, 0],
        [1, 1, 0],
        [0, 1, 1],
    ]) == (<span style="color: #81A1C1;">True</span>, [(0, 0), (1, 0), (1, 1), (2, 1), (2, 2)]),

    traverse([
        [1, 1, 0, 0, 0],
        [0, 1, 1, 1, 0],
        [0, 0, 0, 1, 0],
        [0, 1, 1, 1, 0],
        [0, 1, 0, 0, 0],
        [0, 1, 1, 1, 1],
    ]) == (<span style="color: #81A1C1;">True</span>, [
        (0, 0), (0, 1), (1, 1), (1, 2), (1, 3), (2, 3), (3, 3), (3, 2), (3, 1),
        (4, 1), (5, 1), (5, 2), (5, 3), (5, 4),
    ]),

    traverse([
        [1,1,1],
        [0,0,1],
        [0,0,0],
    ]) == (<span style="color: #81A1C1;">False</span>, []),
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>

<div id="outline-container-org2170b8b" class="outline-4">
<h4 id="org2170b8b"><span class="section-number-4">2.15.2</span> <span class="done WRITTEN">WRITTEN</span> Transform one string to another</h4>
<div class="outline-text-4" id="text-2-15-2">
<p>
Let s and t be strings and D a dictionary, i.e. a set of strings. Define s
to produce t if there exists a sequence of strings from the dictionary P =
&lt;s<sub>0</sub>, s<sub>1</sub>, &#x2026;, s<sub>n-1</sub>&gt; such that the first string is s, the last string is t,
and adjacent strings have the same length and differ in exactly one
character. The sequence P is called a <i>production sequence</i>. For example, if
the dictionary is <code>{bat, cot, dog, dag, dot, cat}</code>, then <code>&lt;cat, cot, dot,
    dog&gt;</code> is a production sequence.
</p>

<p>
Given a dictionary D and two strings s and t, write a program to determine
if s produces t. Assume that all characters are lowercase alphabets. If s
does produce t, output the length of the shortest production sequence;
otherwise, output -1.
</p>

<p>
<i>Hint</i>: Treat strings as vertices in an undirected graph, with an edge
between u and v if and only if the corresponding strings differ in one
character.
</p>
</div>

<div id="outline-container-orged1059c" class="outline-5">
<h5 id="orged1059c"><span class="section-number-5">2.15.2.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-15-2-1">
<p>
Create a graph according to the hint in time complexity O(n<sup>2</sup>). Traverse the
graph using BFS in time O(|V| + |E|) = O(n + n<sup>2</sup>) = O(n<sup>2</sup>).
</p>

<p>
Note that we don&rsquo;t need to necessarily &ldquo;create&rdquo; a graph per se; edges can
be &ldquo;discovered&rdquo; ad-hoc by finding words in the dictionary that are one
character off from the current vertex.
</p>
</div>
</div>
</div>

<div id="outline-container-org93dbd1b" class="outline-4">
<h4 id="org93dbd1b"><span class="section-number-4">2.15.3</span> <span class="done DONE">DONE</span> Paint a Boolean matrix</h4>
<div class="outline-text-4" id="text-2-15-3">
<p>
Implement a routine that takes an n x m Boolean array A together with an
entry (x,y) and flips the color of the region associated with (x,y).
</p>

<p>
<i>Hint</i>: Solve this conceptually, then think about implementation
optimizations.
</p>
</div>

<div id="outline-container-org15b58a8" class="outline-5">
<h5 id="org15b58a8"><span class="section-number-5">2.15.3.1</span> Solution</h5>
<div class="outline-text-5" id="text-2-15-3-1">
<p>
Record the target value of (x,y); if (x,y) is True, target is False, and
vice-versa. From (x,y), fan out &#x2013; recursively or with a queue &#x2013; to all
neighbor entries. If neighbor n is already set to the target, do nothing;
otherwise, set n to the target, and add n&rsquo;s neighbors to the visitation
queue. Continue in this way until the visitation queue is empty.
</p>

<p>
Time O(n) and space O(n) for the size of the array.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">flip_region</span>(Ab, i, j):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">neighbors</span>(Ab, i, j):
        <span style="color: #81A1C1;">if</span> i &gt; 0:
            <span style="color: #81A1C1;">yield</span> (i-1,j)
        <span style="color: #81A1C1;">if</span> i &lt; <span style="color: #81A1C1;">len</span>(Ab) - 1:
            <span style="color: #81A1C1;">yield</span> (i+1, j)
        <span style="color: #81A1C1;">if</span> j &gt; 0:
            <span style="color: #81A1C1;">yield</span> (i, j-1)
        <span style="color: #81A1C1;">if</span> j &lt; <span style="color: #81A1C1;">len</span>(Ab[0]) - 1:
            <span style="color: #81A1C1;">yield</span> (i, j+1)
    <span style="color: #D8DEE9;">_Ab</span> = Ab
    <span style="color: #D8DEE9;">target</span> = <span style="color: #81A1C1;">not</span> _Ab[i][j]
    <span style="color: #D8DEE9;">visit_queue</span> = [(i,j)]
    <span style="color: #81A1C1;">while</span> visit_queue:
        <span style="color: #D8DEE9;">_i</span>, <span style="color: #D8DEE9;">_j</span> = visit_queue.pop(0)
        <span style="color: #D8DEE9;">curr</span> = _Ab[_i][_j]
        <span style="color: #81A1C1;">if</span> curr == target:
            <span style="color: #81A1C1;">continue</span>
        <span style="color: #81A1C1;">for</span> n <span style="color: #81A1C1;">in</span> neighbors(_Ab, _i, _j):
            _Ab[_i][_j] = target
            visit_queue.append(n)
    <span style="color: #81A1C1;">return</span> _Ab
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">all</span>([
    flip_region([
        [1,0,1],
        [0,1,1],
        [1,1,1],
    ], 0, 2) == [
        [1,0,0],
        [0,0,0],
        [0,0,0],
    ],
])
</pre>
</div>

<pre class="example">
True
</pre>
</div>
</div>
</div>
