index.html

<div id="outline-container-org5e1158c" class="outline-4">
<h4 id="org5e1158c"><span class="section-number-4">2.15.4</span> <span class="done DONE">DONE</span> Compute enclosed regions</h4>
<div class="outline-text-4" id="text-2-15-4">
<blockquote>
<p>
Consider a matrix of black and white entries.
</p>

<p>
We say that an element in a 2D matrix is &ldquo;enclosed&rdquo; if there is no path from
any of them to the boundary that only passes through elements of the same
color.
</p>

<p>
Write a program that takes a 2D array A, whose entries are either white or
black, and replaces all white elements that cannot reach the boundary with
black.
</p>
</blockquote>

<p>
For simplicity&rsquo;s sake, we&rsquo;ll redefine A to be a 2D binary array, where 1 is
white and 0 is black.
</p>

<p>
We iterate through all elements of the matrix. If the element is black, we
ignore it. If it is white, we initiate depth-first search for an edge
element. If we find one, we then initiate a breadth-first sweep of all
adjacent white elements to each element on the stack, setting all to black.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">compute_enclosed</span>(A):
    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_is_within_bounds</span>(i, j):
        <span style="color: #81A1C1;">return</span> i &gt;= 0 <span style="color: #81A1C1;">and</span> i &lt; <span style="color: #81A1C1;">len</span>(A) <span style="color: #81A1C1;">and</span> j &gt;= 0 <span style="color: #81A1C1;">and</span> j &lt; <span style="color: #81A1C1;">len</span>(A[0])

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_is_edge</span>(i, j):
        <span style="color: #81A1C1;">return</span> i == 0 <span style="color: #81A1C1;">or</span> i == <span style="color: #81A1C1;">len</span>(A)-1 <span style="color: #81A1C1;">or</span> j == 0 <span style="color: #81A1C1;">or</span> j == <span style="color: #81A1C1;">len</span>(A[0])-1

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_is_white</span>(i, j):
        <span style="color: #81A1C1;">return</span> A[i][j] == 1

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_get_next_candidates</span>(i, j):
        <span style="color: #81A1C1;">return</span> <span style="color: #81A1C1;">filter</span>(
            <span style="color: #81A1C1;">lambda</span> c: _is_within_bounds(c[0], c[1]) <span style="color: #81A1C1;">and</span> _is_white(c[0], c[1]),
            [(i+1, j), (i-1, j), (i, j+1), (i, j-1)],
        )

    <span style="color: #81A1C1;">def</span> <span style="color: #88C0D0;">_clear</span>(path):
        <span style="color: #D8DEE9;">_path</span> = path

        <span style="color: #81A1C1;">while</span> _path:
            <span style="color: #D8DEE9;">i</span>, <span style="color: #D8DEE9;">j</span> = _path.pop()
            A[i][j] = 0
            _path.extend(_get_next_candidates(i, j))

    <span style="color: #81A1C1;">for</span> i <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(<span style="color: #81A1C1;">len</span>(A)):
        <span style="color: #81A1C1;">for</span> j <span style="color: #81A1C1;">in</span> <span style="color: #81A1C1;">range</span>(<span style="color: #81A1C1;">len</span>(A[0])):
            <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> _is_white(i, j):
                <span style="color: #81A1C1;">continue</span>

            <span style="color: #D8DEE9;">path</span> = [(i, j)]

            <span style="color: #D8DEE9;">cleared</span> = <span style="color: #81A1C1;">False</span>
            <span style="color: #81A1C1;">while</span> path <span style="color: #81A1C1;">and</span> <span style="color: #81A1C1;">not</span> cleared:
                <span style="color: #D8DEE9;">_i</span>, <span style="color: #D8DEE9;">_j</span> = path[-1]

                <span style="color: #81A1C1;">if</span> _is_edge(_i, _j):
                    _clear(path)
                    <span style="color: #D8DEE9;">cleared</span> = <span style="color: #81A1C1;">True</span>
                    <span style="color: #81A1C1;">continue</span>

                <span style="color: #D8DEE9;">cands</span> = _get_next_candidates(_i, _j)
                <span style="color: #81A1C1;">if</span> <span style="color: #81A1C1;">not</span> cands:
                    <span style="color: #D8DEE9;">cleared</span> = <span style="color: #81A1C1;">True</span>
                    <span style="color: #81A1C1;">continue</span>

                path.extend(cands)

    <span style="color: #81A1C1;">return</span> A
</pre>
</div>
</div>
</div>

<div id="outline-container-org22f7d09" class="outline-4">
<h4 id="org22f7d09"><span class="section-number-4">2.15.5</span> Compute a shortest path with fewest edges</h4>
</div>
</div>
<div id="outline-container-orgd5af4c9" class="outline-3">
<h3 id="orgd5af4c9"><span class="section-number-3">2.16</span> Parallel Computing</h3>
</div>
</div>

<div id="outline-container-org138f5e4" class="outline-2">
<h2 id="org138f5e4"><span class="section-number-2">3</span> Domain Specific Problems</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org93156dc" class="outline-3">
<h3 id="org93156dc"><span class="section-number-3">3.1</span> Design Problems</h3>
</div>

<div id="outline-container-org5bd56a4" class="outline-3">
<h3 id="org5bd56a4"><span class="section-number-3">3.2</span> Language Questions</h3>
</div>

<div id="outline-container-org7770752" class="outline-3">
<h3 id="org7770752"><span class="section-number-3">3.3</span> Object-Oriented Design</h3>
</div>

<div id="outline-container-orge712c79" class="outline-3">
<h3 id="orge712c79"><span class="section-number-3">3.4</span> Common Tools</h3>
</div>
</div>

<div id="outline-container-org4a3ce55" class="outline-2">
<h2 id="org4a3ce55"><span class="section-number-2">4</span> Honors Class</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Jin</p>
<p class="date">Created: 2018-07-27 Fri 16:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
